{"id":1546,"date":"2019-11-15T09:00:19","date_gmt":"2019-11-15T09:00:19","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=1546"},"modified":"2022-05-30T14:59:32","modified_gmt":"2022-05-30T13:59:32","slug":"how-will-brexit-affect-online-sellers","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-will-brexit-affect-online-sellers\/","title":{"rendered":"How Will Brexit Affect Online Sellers?"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text]\n<h3><strong>Are you an online seller struggling to make sense of Brexit and what it will mean for your business?<\/strong><\/h3>\n<p><em>Are you concerned about the potential impact Brexit may have on your sales?<\/em><\/p>\n<p>Imagine if you could predict what was going to happen to the eCommerce industry and buyer confidence in a post-Brexit world? If you could create a plan for your business that reduces the potential risks and the impact on your online sales.<\/p>\n<p><strong>How great would that be?<\/strong><\/p>\n<p><strong>Right now, that feels like a distant dream doesn’t it?<\/strong><\/p>\n<ul>\n<li>The politicians leading the UK can’t seem to agree on anything<\/li>\n<li>Brexit has already reduced investment and employment growth<\/li>\n<li>Consumer confidence is at an all-time low<\/li>\n<\/ul>\n<p>While nobody can predict the full impact that Brexit will have on eCommerce, we have put together a list of the key burning issues that could impact your online business and provide the answers to ensure the sales keep coming when the Brexit dust settles.<\/p>\n<h3><strong>What eCommerce sellers should do to get Brexit ready<\/strong><\/h3>\n<p>Brexit is inching closer. This article tells you how to get your business Brexit ready before it’s too late.<\/p>\n<h3><strong><img decoding=\"async\" class=\"aligncenter wp-image-1552 size-full\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2019\/11\/BREXIT_BLOG-1.jpg\" alt=\"How Will Brexit Affect Online 3PL Blog Sellers\" width=\"1000\" height=\"639\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2019\/11\/BREXIT_BLOG-1.jpg 1000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2019\/11\/BREXIT_BLOG-1-300x192.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2019\/11\/BREXIT_BLOG-1-768x491.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/strong><\/h3>\n<h3><strong>Check if you are in scope<\/strong><\/h3>\n<p>Firstly, does the eCommerce Directive even apply to your business? The official government <a href=\"https:\/\/www.gov.uk\/guidance\/ecommerce-directive-what-online-service-providers-in-the-uk-should-do-to-get-ready-for-brexit#check-whether-you-are-in-scope\">guidance page on Brexit<\/a> states that it applies to ‘Information society services’. If you are now scratching your head and wondering what exactly that means. It is defined as:<\/p>\n<ul>\n<li>any service normally provided for payment, including indirect payment such as advertising revenue<\/li>\n<li>‘at a distance’ (where customers can use the service without the provider being present)<\/li>\n<li>by electronic means<\/li>\n<li>at the individual request of a recipient of the service<\/li>\n<\/ul>\n<h3><strong>Are still trying to figure it if Brexit applies to your Online Business? <\/strong><\/h3>\n<p>Essentially, the eCommerce Directive covers pretty much every type of online service provider. If you are selling online then this applies to you.<\/p>\n<h3><strong>The impact Brexit could have on your eCommerce sales<\/strong><\/h3>\n<p><em>Spoiler alert: It’s not all doom and gloom! We cover some of the positive ways Brexit could impact your online business too.<\/em><\/p>\n<h3><strong>Shipping costs and delivery times will increase<\/strong><\/h3>\n<p>There are currently some 500,000 parcels sent into the UK EVERY DAY!! The current rules mean allow them to get arrive pretty quickly as they don’t have to pass through customs.<\/p>\n<h3><strong>After Brexit, this could all change!<\/strong><\/h3>\n<p>Overnight, each delivery will have to go through customs check, and this could dramatically increase the time it takes for parcels to reach the UK from Europe due to all of the extra paperwork (Everyone loves more paperwork. Right?).<\/p>\n<p>It could also result in extra customs charges for you and your customers. Although the government have long term plans to fix this problem, the short term could be absolute chaos.<\/p>\n<h3><strong>Take the pain out of sending orders after Brexit<\/strong><\/h3>\n<p>Use the expertise of a third-party logistics partner to take care of your carrier management. Companies like 3PL have partnerships with the world’s best couriers to ensure you get the best available service and prices.<\/p>\n<h3><strong>You will have to register for VAT in other countries<\/strong><\/h3>\n<p>How the VAT system will work post-Brexit all depends on how we leave. If the UK leaves without an agreement in place, then there will be some big changes to how VAT is applied to transactions that take place between the UK and the EU countries.<\/p>\n<h3><strong>Goods bought into the UK from an EU country will be subject to import VAT and import duty<\/strong><\/h3>\n<p>This may also see an increase in the amount of VAT online sellers have to pay on Amazon and eBay, with fees expected to rise from 15% to 20% post Brexit.<\/p>\n<h3><strong>International payments will cost you more, a problem for your profit margins.<\/strong><\/h3>\n<p>Currency rates are already volatile, and the pound feels like it is getting weaker daily, in large part due to the uncertainty over Brexit. IMF analysts have predicted that the <a href=\"https:\/\/www.theguardian.com\/business\/2018\/jul\/19\/no-deal-brexit-would-harm-all-european-countries-warns-imf\">EU could lose up to 1.5% of GDP<\/a> and the UK could be hit even harder with a potential loss of up to 4%. As a business owner, the last thing you want is uncertainty especially when it comes to the costs of importing, exporting and manufacturing goods.<\/p>\n<p><strong>To avoid the risk of currency fluctuations consider doing the following:<\/strong><\/p>\n<ul>\n<li>Buy currency in advance when the rates are high as security against poor exchange rates in the future.<\/li>\n<li>Open a foreign currency account – your payments then avoid having to be converted to pounds.<\/li>\n<li>Use a specialist foreign currency provider – they can help to save you money, keeping your costs to a minimum and avoid the risk of being charged twice for the same transaction, both the country you are exporting to and also your home country (ouch!)<\/li>\n<\/ul>\n<h3><strong>Data protection laws could all change…AGAIN!<\/strong><\/h3>\n<p><strong>Is GDPR still fresh in your mind?<\/strong><\/p>\n<p>Just as businesses have finally come to grips with the latest data compliance regulations, Brexit is about to open a whole new can of worms.<\/p>\n<p>After Brexit the UK could be viewed as a third country, as a result, the transfer of personal data from organisations within the EU to other organisations in the UK will be subject to strict data transfer rules, as set out by the EU General Data Protection Regulation (GDPR) – this is going to be tricky and very difficult to police on both sides.<\/p>\n<p>It is going to be up to the UK to prove to Europe that it is a safe and ‘adequate’ country for data processing, otherwise restrictions on data could be imposed.<\/p>\n<h3><strong>Here comes the good news&#8230;<\/strong><\/h3>\n<p>As the old saying goes <em>‘every cloud has a silver lining’ <\/em>and Brexit could have a positive impact on your eCommerce business<\/p>\n<h3><strong>A weaker pound could boost eCommerce sales<\/strong><\/h3>\n<p>As the value of UK currency continues to tumble, it means UK goods are becoming more and more attractive for overseas shoppers. Shopping on UK eCommerce stores is now an alluring prospect for savvy shoppers, who can buy items cheaper from the UK than they can at home.<\/p>\n<h3><strong>How can you make the most of this opportunity?<\/strong><\/h3>\n<p>Make sure your website is installed with currency converters, translation plugins and equipped with tools to accept payments in as many different currencies as possible.<\/p>\n<h3><strong>Buyers will be on the lookout for the best deals<\/strong><\/h3>\n<p>UK shoppers are reluctant to spend, but that doesn’t mean they won’t if the price is right – everyone loves a bargain. Entice your UK shoppers by introducing time-sensitive deals and special discounts into your marketing strategy.<\/p>\n<p><strong> <\/strong>In the search for orders, don’t forget about your customer&#8217;s experience<\/p>\n<h3><strong>Fulfilment by Amazon won’t be affected (domestically!)<\/strong><\/h3>\n<p>If you are currently using Amazon FBA services, you will rejoice in the fact they have revealed that regardless of the Brexit outcome, domestic <a href=\"https:\/\/services.amazon.co.uk\/services\/fulfilment-by-amazon\/features-benefits.html\">Fulfilment by Amazon<\/a> will remain unchanged and goods in UK fulfilment centres will still be delivered to UK customers, while inventory in Germany, France, Italy and Spain will still be delivered to customers in Europe.<\/p>\n<h3><strong>A no-deal Brexit could make things a little trickier<\/strong><\/h3>\n<p>In the event of a ‘no-deal’ Brexit, you may see some disruption in goods being sent from the UK to mainland Europe and possibly not being fulfilled at all.<\/p>\n<h3><strong>Pan-European sellers may fair a little better<\/strong><\/h3>\n<p>If you are signed up for the <a href=\"https:\/\/services.amazon.co.uk\/services\/fulfilment-by-amazon\/pan-european-fba.html\">Amazon Pan-European FBA<\/a> programme and have inventory in EU based Amazon fulfilment centres, then you will be able to continue to sell as normal within mainland Europe, but you may incur some delays when your products are being sent from the UK and incur additional taxes on the goods being stored.<\/p>\n<h3><strong>eBay Global Shipping Programme won’t be affected.<\/strong><\/h3>\n<p>eBay aims to support export from the UK and keep the process hassle-free for sellers. eBay will take care of the duty payments and customs clearances under the programme and your seller performance standards are also protected. The only cost to you will be posting to the UK shipping centres.<\/p>\n<h3><strong>Consider partnering with a fulfilment and logistics expert<\/strong><\/h3>\n<p>These are uncertain times for everyone. It’s certainly not easy for eCommerce online sellers to fully understand the full impact that Brexit will have on sales and also the experience you want to create for your customers.<\/p>\n<p>Partnering with a <a href=\"http:\/\/www.3p-logistics.co.uk\/\">third-party logistics provider<\/a> is something to consider as part of your shipping strategy as they will have the expertise and experience to remove any potential barriers you have when it comes to fulfilling orders and make sure that whatever happens, your customers&#8217; expectations continue to be exceeded.<\/p>\n<p><strong>To learn more about third-party logistics, <a href=\"https:\/\/www.3p-logistics.co.uk\/third-party-logistics\/\">click here<\/a><\/strong><\/p>\n<p><strong>P.S. Learn how 3PL help fast growing brands to deliver a better customer experience &#8211; <a href=\"https:\/\/www.3p-logistics.co.uk\/case-studies\/\">Customer success stories<\/a><\/strong>[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text] Are you an online seller&#8230;<\/p>\n","protected":false},"author":1,"featured_media":1547,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/1546"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=1546"}],"version-history":[{"count":11,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/1546\/revisions"}],"predecessor-version":[{"id":1558,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/1546\/revisions\/1558"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/1547"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=1546"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=1546"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=1546"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}