{"id":2091,"date":"2020-03-04T17:30:49","date_gmt":"2020-03-04T17:30:49","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2091"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"amazon-fba-what-are-the-advantages-and-disadvantages","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/amazon-fba-what-are-the-advantages-and-disadvantages\/","title":{"rendered":"Amazon FBA: What Are The Advantages And Disadvantages?"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text]Are you an online seller considering Amazon FBA (or Fulfilment by Amazon as it&#8217;s also known) but confused by how it all works? Perhaps you are an Amazon Seller struggling to understand all of the various guidelines you need to follow and have been left wondering if it’s the right thing for you.<\/p>\n<p>The good news is…<em>you’re not alone.<\/em><\/p>\n<p>There is still a major lack of understanding when it comes to how Amazon FBA works. There are many myths surrounding the Amazon Fulfilment process. Every seller is different, if you are using the service directly or choosing to go with a <a href=\"https:\/\/www.3p-logistics.co.uk\/third-party-logistics\/\">third-party fulfilment provider<\/a> you should compare what the main advantages and disadvantages will be for your business.<\/p>\n<h2><strong>Is Amazon FBA delivery free?<\/strong><\/h2>\n<p><strong> <\/strong>This depends on the value of the transaction (i.e. £10 for books or £20 for other categories). After that, Amazon will charge you an amount equal to any shipping fee charged to the buyer. These transactions are called &#8220;Shipping Chargeback&#8221; and will appear in your settlement report. <a href=\"https:\/\/services.amazon.co.uk\/services\/fulfilment-by-amazon\/winning-with-fba\/faq.html\">Amazon consumes a big chunk of commission<\/a> on sale value and this means they can offset a degree of delivery costs. Amazon encourages sellers to add the FBA charges to the sale price as this generates more commission on every sale.<\/p>\n<p>Only on certain thresholds is the delivery cost-free to the seller but be mindful that you are already paying Amazon a commission on sale to fund the delivery. So, the savings may not be quite as good as they first appear.<\/p>\n<h2><strong>Will I be guaranteed “buy box” status and get better listings positions?<\/strong><\/h2>\n<p>A seller&#8217;s eligibility to win the Amazon “Buy Box” is linked to specific seller performance criteria that identify the sellers that have consistently provided customers with a great buying experience on Amazon’s website.<\/p>\n<p>Since seller performance requirements vary by category and are subject to change, the specific targets are never revealed, to become an eligible seller you have to meet Amazon’s very high standards consistently. If you are an eligible seller, you can increase your chances of winning the “Buy Box” if you are <em>knocking it out of the park in these areas<\/em>:<\/p>\n<ul>\n<li>Pricing<\/li>\n<li>Availability<\/li>\n<li>Updated Inventory<\/li>\n<li>Fulfilment<\/li>\n<li>Customer Experience<\/li>\n<\/ul>\n<p>The Amazon Seller with the lowest listing price and highest feedback rating will normally win the “Buy Box”. Only on the rare occasions when there is an equal standing in the scorecard does an FBA registered seller come out on top.<\/p>\n<h2><strong>Will Amazon FBA want to sell all of my product range?<\/strong><\/h2>\n<p>Amazon is only interested in your top-selling lines, as this results in higher commissions without the risk of burdening their warehouses with slow-moving stock.<\/p>\n<p>If you send slow-moving stock to FBA, additional long-term storage fees will apply. FBA also applies an extended exclusion list for a wide range of products from flammables, to goods with expiry dates. Oversized goods should be excluded at all costs or you will run the risk of excessive storage and handling surcharges.<\/p>\n<h2><strong>Does Amazon FBA only want fast sellers?<\/strong><\/h2>\n<p>Amazon is keen to fulfil fast-moving lines for two reasons:<\/p>\n<p>1: More sales = more commission<\/p>\n<p>2: Smell what sells: Amazon may decide to source and stock the product themselves.<\/p>\n<p>Making money from fulfilment services isn’t the main goal of Amazon and could be seen as a “loss-leading” back end activity to generate better front-end commissions on every sale.<\/p>\n<h2><strong>Is FBA a good way of promoting and controlling my brand?<\/strong><\/h2>\n<p>All goods are despatched using Amazon-branded packaging, invoicing, paperwork and often includes various promotional inserts to your customer. From a brand control perspective, Amazon will also take returns and sell them under their warehouse deals program. Major brands restrict their vendors from joining Amazon FBA because of this.<\/p>\n<p>FBA packaging spec allows no scope for individual brand awareness or your own in package promotions. On the matter of brand protection, yes Amazon will put you in front of a large audience, but you will lose direct control of your brand experience.<strong> <\/strong><\/p>\n<h2><strong>Do I only pay for the cost of picking &amp; packing my order?<\/strong><\/h2>\n<p>With different fee structures for each product type, Amazon adopts a rather complex charging system linked to cubic metres for storage and weight handling surcharges for delivery. FBA also penalises for:<\/p>\n<ul>\n<li>Long term storage<\/li>\n<li>Peak season storage<\/li>\n<li>Storage and handling of oversized goods<\/li>\n<li>Preparing and delivering the goods to FBA directly<\/li>\n<\/ul>\n<p>Any decision to withdraw your products from FBA will also result in hefty picking charges.<\/p>\n<p>Unless you can truly define your cost per unit using the FBA model then you simply cannot make the right decision. The complex pricing structure that Amazon uses for fulfilment makes it more scientific than it needs to be. The FBA comparison tool provided by Amazon can be misleading, as it only assumes the minimum activities undertaken and the real picture over a full year is likely to be much different.<\/p>\n<h2><strong>Using FBA is a cheaper alternative than a traditional fulfilment house for every product type?<\/strong><\/h2>\n<p>As more and more fulfilment houses invest in technology and automation, the more efficient they become. With greater efficiencies come lower prices and with increased throughput comes economies of scale. Most fulfilment houses will prove competitive when compared to FBA especially when fulfilling orders for all other channels (e.g. eBay), or your brand website. But it’s the other benefits of using a <a href=\"https:\/\/www.3p-logistics.co.uk\/amazon-fba-preperation-fulfilment\/\">third-party Amazon Fulfilment provider<\/a> that count. Benefits like:<\/p>\n<ul>\n<li>Centralised inventory: no need to spend time on preparing goods for FBA<\/li>\n<li>Personable service: real people with ease of access<\/li>\n<li>Transparent pricing: Know your unit cost<\/li>\n<li>Consistent Warehouse Pricing: Void of surcharges<\/li>\n<li>Flexible Partner: Full range of eCommerce services under one roof<\/li>\n<li>Fewer restrictions: Most product types\/sizes accounted for<\/li>\n<li>Branding: Branded packaging if required<\/li>\n<li>Bespoke: Specific tasks undertaken<\/li>\n<li>Less Risk: Amazon may decide to source and sell similar products<\/li>\n<li>The growing number sellers looking to leave FBA is a sign that FBA may only be cheaper on certain products types that are linked to certain order profiles. The wider benefits of using a third-party fulfilment house may offer better value for money.<strong> <\/strong><\/li>\n<\/ul>\n<h2><strong>Can customers request a refund, do a credit card chargeback, or leave negative feedback after 90 days?<\/strong><\/h2>\n<p>Sellers give up these rights under FBA.<strong> <\/strong><\/p>\n<p>Here’s an example, a customer who read a book ELEVEN MONTHS after receiving it (yes, 11 months) &#8230; didn&#8217;t enjoy the book, and requested a refund. FBA granted the refund without consulting the seller and took the money out of the seller&#8217;s account to refund the customer.<\/p>\n<p>The good news is that this particular book was of low value. The bad news is, there is no limit to what FBA can do to your account &#8211; hold funds, issue refunds and not restock your returned items.<\/p>\n<p>The fact is that an FBA seller has less protection than a non-FBA seller.<\/p>\n<h2><strong>If I have an issue with FBA can contact a real person to fix it?<\/strong><\/h2>\n<p>The main way to raise a query is via the &#8220;click-to-call&#8221; feature. This feature will call your phone in less than 5 seconds. Unfortunately, you are then likely to be on hold for at least 5 minutes. The likelihood is that you may well be on the phone for a further 15 minutes before you have an answer to your question (if a solution can be found at all that is).<\/p>\n<p>The scale of Amazon makes speaking to a person difficult. Most third-party fulfilment houses, on the other hand, offer direct telephone support from account managers who will have a much better understanding of your business needs and will be able to support you in finding a solution.<\/p>\n<h2><strong>Is the majority of negative feedback left on FBA seller accounts due to products being shipped incorrectly?<\/strong><\/h2>\n<p>The main cause for up to 90% of negative FBA customer feedback is actually due to damages by the FBA warehouse itself. Amazon will remove the feedback is if they ship the wrong item or in the unlikely event a customer states that this was an FBA error. Unfortunately, any goods damaged on arrival that has been handled by FBA will remain as negative feedback.<\/p>\n<p>The overall task of requesting the removal of negative feedback is long-winded and not for the faint-hearted or the ‘short on patience’ types.<strong> <\/strong><\/p>\n<h2><strong>Is FBA good value for money?<\/strong><\/h2>\n<p>There are so many variables that there is no definitive answer. When you start selling via FBA your popular items will fly off the shelves but as the long-term storage fees and unforeseen costs kick in the upsides are often superseded by the downsides.<\/p>\n<p>If you get the right product at the right price, then you can definitely make a profit, but overstock on the wrong product at the wrong price and you could well end up making make a loss.<\/p>\n<h2><strong>Final Thoughts<\/strong><\/h2>\n<h2><strong>FBA or Fulfilment by Merchant?<\/strong><\/h2>\n<p>There are advantages and disadvantages to selling on FBA and most of the time it is only through trial and error that will tell you whether FBA and FBM is a good option for your business.<\/p>\n<p>There are lots of things that a seller needs to consider before leaping FBA.<\/p>\n<p>Handing over a part of your business and your reputation to a third-party can be difficult. When you send your inventory into a fulfilment centre and trust them to ship your product, you are growing your team and trusting them to deliver the same customer experience that you would. Fulfilment centres are usually automated, and they have their own systems in place for efficiency &#8211; This is good because this is what you are hiring them for.<\/p>\n<p>By comparison, Amazon is a juggernaut and isn’t agile enough to adapt to your business needs. You have to adapt to Amazon, and they are less forgiving of, “OOPS, I didn’t know that.” Amazon fully expects its sellers to have read their guidelines and the specific rules for the categories you will be selling in. If their rules are ignored on multiple occasions, then you could be kicked off the platform.<\/p>\n<h2><strong>You don’t have to use FBA to win the Buy Box<\/strong><strong> <\/strong><\/h2>\n<p>Amazon is a commission-based business model and will, therefore, promote the items that will make them the most money. If you aren’t in a position to source direct and send straight to FBA in large quantities, then merchant fulfilment via a third-party fulfilment house is likely to be the most logical solution.<\/p>\n<p>The FBA solution will work for a limited number of sellers”. The decision on whether you select FBA, a third-party fulfilment house or your own in-house solution depends on operating compliance, growth expectations, and the brand values that are most important to you and your business.<\/p>\n<h3><strong>PS, want to know more about Amazon FBA Preparation? <a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\">Contact 3PL<\/a> today for a chat about how using a third-party logistics provider could benefit you.<\/strong><\/h3>\n[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text]Are you an online seller considering&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2093,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2091"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2091"}],"version-history":[{"count":6,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2091\/revisions"}],"predecessor-version":[{"id":2200,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2091\/revisions\/2200"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2093"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}