{"id":2300,"date":"2020-04-02T16:25:22","date_gmt":"2020-04-02T15:25:22","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2300"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"how-will-coronavirus-affect-the-uk-retail-industry","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-will-coronavirus-affect-the-uk-retail-industry\/","title":{"rendered":"How Will Coronavirus Affect the UK Retail Industry?"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text]\n<h2>Is this really the end for traditional retail?<\/h2>\n<p>Not since WW2 has anything affected the global community on a scale like the coronavirus pandemic, as countries continue to battle the virus and contain the spread, it’s hard to imagine when and where it might all end for the retail industry.<\/p>\n<p>Originally starting in China, coronavirus has quickly spread to engulf every corner of the globe, its impact felt by everyone.<\/p>\n<p>One of the biggest changes has been the shift in consumer behaviour. The UK retail industry is having change quickly to meet the rapidly evolving needs of customers that are now spending the majority of their day at home, brands that fail to evolve quickly enough may not make it through to the other side.<\/p>\n<p>With retailers shuttering their bricks-and-mortar stores, the focus has moved to online as the main route to market. Retailers need to find creative ways to remain relevant in this time of uncertainty.<\/p>\n<p>What are the key challenges facing retailers and how can you adapt to overcome them?<\/p>\n<h2><strong>Disruption to The Supply Chain<\/strong><\/h2>\n<p>When the pandemic began to take hold in China, the factories that supply products to brands around the world had to close, causing production to cease overnight. As in the UK, workers were asked to stay home and this also meant good couldn’t be shipped on time, resulting in further delays.<\/p>\n<p>The situation was made worse as the UK and much of Europe also went into lockdown. The UK government realised the importance of the supply chain in supporting the economy (especially for food, science and health products) acting quickly to make those working in the supply chain ‘keyworkers’, this has allowed fulfilment centres to continue operating but to which level of capacity, will be driven by where consumers are spending their money online and how strict the lockdown measures become.<\/p>\n<p>The impact has already been felt by most retailers, many <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-amazon-fba-sellers-can-stay-in-business-during-coronavirus\/\">Amazon sellers<\/a> have struggled to bring goods into the country, but the true impact of may not be felt until the second quarter and beyond.<\/p>\n<h3><strong>What Can Retailers Do?<\/strong><\/h3>\n<p>In the past, you may have looked for overseas suppliers that could offer the cheapest price. This could be the moment when price is no longer your main consideration. You may look for suppliers that are closer to home, although this may prove to be more expensive in the short term, it may come as secondary to the logistical advantages that having suppliers closer to home brings.<\/p>\n<p>Your main concern may be the increased costs of finished goods, that you will then have to pass onto your customer. Perhaps, in a climate where we are advised to stay apart, we will end feeling closer together and supporting each other. Rather than the lowest price and fastest shipping option being the main consideration in purchasing behaviour, consumers could now switch their focus to supporting local businesses.<\/p>\n<p>If there is an opportunity to bring every part of your supply chain closer to home from manufacturing to <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/which-ecommerce-order-fulfilment-strategy-is-best-for-your-business\/\">order fulfilment<\/a>, now may be the time to consider it.<\/p>\n<h2><strong>Bricks and Mortar Stores<\/strong><\/h2>\n<p>It’s a surreal feeling to see once heaving high streets now empty, the ‘end of the high street’ debate is nothing new, but now suddenly feels like more of a reality.<\/p>\n<p>As social distancing measures take effect consumers have no option but to buy online. A consumer survey by analyst <a href=\"https:\/\/www.retaileconomics.co.uk\/\">Retail Economics,<\/a> found that two-thirds of shoppers said they had switched to purchasing products online that they have previously purchased only in-store.<\/p>\n<p>Nowhere, has this been felt more than in the online grocery sector, it’s boom time again for supermarkets, even the most resolute shoppers have no other option than to shop online for fresh goods. Will they ever go back shopping instore again? Some will, but many will realise just how convenient shopping online for groceries is and never go back to how things used to be. This is going to present some huge challenges for retailers and in particular independents.<\/p>\n<h3><strong>What Can Retailers Do?<\/strong><\/h3>\n<p>Now is the time to adopt an omnichannel approach and focus on improving your online presence by enhancing your website, doubling down on your content strategy, upping your social media game and focus building an email list – these are channels that you will still  own in any economic situation.<\/p>\n<h2><strong>The Ecommerce Opportunity <\/strong><\/h2>\n<p>As consumers spend more time at home, they will inevitably spend more time shopping for products online. Multichannel retailers have a window of opportunity to switch up their focus and investment to online channels, focusing on developing better, smarter and more creative marketing campaigns to drive traffic to their online stores and create a better user experience. Some brands are already rolling out virtual reality product launches to keep their online communities engaged and entertained.<\/p>\n<p><strong>What Can Retailers Do?<\/strong><\/p>\n<p>For many FMCG, healthcare and grocery brands this is a bittersweet period. While so many are struggling, they are having success on a scale similar to the Black Friday madness we see each year. For those <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-amazon-fba-sellers-can-stay-in-business-during-coronavirus\/\">brands that fall into the ‘non-essential’<\/a> items like fashion or luxury categories, the challenges are much greater.<\/p>\n<p>Right now, consumers’ minds are dialled into just buying the things they need, rather than the things they want. There is hope, after every war and recession there has been a huge spike in the sale of luxury goods as consumers look to inject some good feeling back into their lives. The sale of luxury goods is already bouncing back in China, once the major threat had passed consumer confidence has gradually returned.<\/p>\n<h2><strong>Customer Experience More Important Than Ever<\/strong><\/h2>\n<p>Now, more than ever there is a spotlight on how brands communicate with their customers.<\/p>\n<p>How transparent, sincere and understanding you are now will count a lot towards how your customers will remember you in the future. This is a time to show empathy with your customers. Now is not the time to run that <em>&#8216;19% OFF using code COVID19&#8217;<\/em> or <em>‘free hand sanitiser’<\/em> with every purchase promo (those brands know who they are).<\/p>\n<p>Use this time to connect with your audience more deeply and build long term relationships that will last long into the future.<\/p>\n<p>Over the coming months, online orders and fulfilment will be everything for brands and this experience will make or break your brand&#8217;s reputation. Creating a safe and convenient environment for customers to receive your products may be the difference between making a sale or not, as stopping the spread is still top of mind for everyone.<\/p>\n<h2><strong>What Can Retailers Do?<\/strong><\/h2>\n<p>If your customers weren’t demanding an online service from you before, they will be now. Now is the time to adopt an online <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/which-ecommerce-order-fulfilment-strategy-is-best-for-your-business\/\">order and fulfilment strategy<\/a> that supports your customer experience. If you are fulfilling orders in-house, make sure that you are adhering to the latest government safety guidelines (and letting your customers know about it).<\/p>\n<p>If you are currently <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-key-advantages-of-using-a-third-party-logistics-provider\/\">outsourcing your order fulfilment to a third party<\/a>, make sure they are operating within a safe environment and making safe distancing part of their best practice procedures.<\/p>\n<h3><strong>PS, If you need help getting started with ecommerce order fulfilment, <a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\">Contact 3PL<\/a> today for a chat about how outsourcing could benefit you.<\/strong><\/h3>\n<h3 style=\"text-align: center;\"><strong>More from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\">3PL blog<\/a>…<\/strong><strong> <\/strong><\/h3>\n<h3 style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-amazon-fba-sellers-can-stay-in-business-during-coronavirus\/\">How Amazon FBA Sellers Can Stay in Business During Coronavirus<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/which-ecommerce-order-fulfilment-strategy-is-best-for-your-business\/\">Which eCommerce Order Fulfilment Strategy is Best For Your Business?<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-do-fulfilment-centres-work\/\">How Do Fulfilment Centres Work?<\/a><\/strong><\/h3>\n[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; overlay_strength=&#8221;0.3&#8243; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_link_target=&#8221;_self&#8221; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; overlay_strength=&#8221;0.3&#8243; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text] Is this really the end&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2299,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2300"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2300"}],"version-history":[{"count":5,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2300\/revisions"}],"predecessor-version":[{"id":2305,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2300\/revisions\/2305"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2299"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2300"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2300"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2300"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}