{"id":2434,"date":"2020-05-19T08:55:22","date_gmt":"2020-05-19T07:55:22","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2434"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"free-shipping-should-your-e-commerce-store-offer-it","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/free-shipping-should-your-e-commerce-store-offer-it\/","title":{"rendered":"Free Shipping: Should Your eCommerce Store Offer It?"},"content":{"rendered":"<h2>Offering free shipping is often seen as the holy grail for customers &#8211; they want their products to arrive fast, free and without any hitches.<\/h2>\n<p>But, what is the cost of this to your eCommerce store? Can you really meet these increasing demands while still making money?<\/p>\n<p>Coming up with a successful free shipping strategy takes time, research and careful tactics to be able to make it work effectively. Afterall, you don’t want to fall into the trap of having a warehouse working overtime to fulfil orders that just aren’t making you money.<\/p>\n<p>So, should you really join the throngs offering free shipping? What are the benefits and how do you create your own free shipping strategy? We’ve put together a guide to get you started&#8230;<\/p>\n<h2>Does Offering Free Shipping Increase Sales?<\/h2>\n<p>At the heart of every free shipping strategy is one fundamental goal &#8211; to make more money.<\/p>\n<p>And, the main way to make more money? Make more sales.<\/p>\n<p>There are different paths to this end goal. It could be that you want to improve your conversion rate, bring in new customers or improve your average order value. However, they all boil down to one thing &#8211; more products being sold and more profit being added to your bottom line.<\/p>\n<p>So, does how free shipping work when it comes to increasing sales?<\/p>\n<p>With so many eCommerce stores, both big and small, offering free shipping to customers, you might be feeling the pressure to do the same. And it is true, a lot of research and case studies do reveal that a correctly executed free shipping strategy can increase sales and add to your net profit.<\/p>\n<p>Countless surveys and polls have revealed how important free shipping is to potential buyers, with results claiming that free shipping can…<\/p>\n<ul>\n<li>Improve average order value<\/li>\n<li>Reduce the number of abandoned carts<\/li>\n<li>Increase your sale conversion rate<\/li>\n<li>Attract new buyers to your eCommerce store<\/li>\n<\/ul>\n<p>There’s also plenty of research into the importance of free shipping to customers, with increasing numbers expecting a free delivery option when they get to the checkout.<\/p>\n<h2>Does free shipping work?<\/h2>\n<p>So, it’s clear that free shipping does work for customers. But the question is, does it work for your business?<\/p>\n<p>Yes, free shipping might increase your number of sales, but there is another, more important, question that should qualify this &#8211; will free shipping <em>make me more profit?<\/em><\/p>\n<p>If you dive head first into offering free shipping without laying out a well-informed and calculated strategy first, those extra sales could actually be dragging your business down. Afterall, shipping does cost money, and can easily begin to eat into your profit margin when you don’t keep it on a tight leash.<\/p>\n<h2>Can you offer free shipping and still make money?<\/h2>\n<p>Of course, it <em>is<\/em> possible to offer free shipping and still make money &#8211; that’s why so many eCommerce stores and brands do it.<\/p>\n<p>But, to do it right, you need to consider the following points first…<\/p>\n<ul>\n<li><strong>Your profit margins<\/strong> &#8211; if you can’t cover the cost of the shipping without making an acceptable level of profit, this is something you need to address before rolling out a free shipping strategy.<\/li>\n<li><strong>Delivery costs<\/strong> &#8211; you want to be sure you can find the lowest, most reliable shipping rates for your products. Remember, heavier items and international will cost more, so factor this in if it applies to you.<\/li>\n<li><strong>Your average order value<\/strong> &#8211; this is useful for when setting a minimum order threshold, which we will look at in more detail later. It can also help if customers tend to buy multiple items at once as this will lower your shipping costs.<\/li>\n<li><strong>Can you evaluate the impact of a new free shipping strategy?<\/strong> &#8211; if you are new to free shipping, it’s vital that you evaluate the success of implementing it. A good <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-are-the-essential-requirements-for-inventory-management-software\/\" target=\"_blank\" rel=\"noopener noreferrer\">inventory management software<\/a> can give you valuable insights into this.<\/li>\n<\/ul>\n<p>The key to offering free shipping and still making money is to plan, plan and plan some more. Do your calculations carefully, research your options thoroughly and keep a close eye on whether those increased sales really are turning into increased profit for your eCommerce business.<\/p>\n<h2>Are there any more benefits to a free shipping strategy?<\/h2>\n<p>So, other than the cold bottom line, are there any other benefits to offering free shipping? There are a few other reasons that might help you make your decision…<\/p>\n<ul>\n<li>It can make your customers more <strong>loyal<\/strong> and encourage <strong>repeat purchases<\/strong><\/li>\n<li>It can provide you with a <strong>marketing hook<\/strong> during special promotions<\/li>\n<li>It can help <strong>improve customer satisfaction<\/strong> which might mean more <strong>positive reviews<\/strong> for your eCommerce store<\/li>\n<\/ul>\n<h2>Free shipping vs Paid Shipping &#8211; Which is Best?<\/h2>\n<p>Now we’ve seen the benefits of offering free shipping for your eCommerce store, it’s only fair to weigh them up against paid shipping.<\/p>\n<p>A paid shipping strategy usually charges the same amount for delivery for every customer order &#8211; regardless of order value or the number of products purchased.<\/p>\n<p>This is a common tactic for many small eCommerce stores as it is predictable and simple for customers to understand. It works best if all the products you sell are a similar size and weight. If they aren’t, customers might feel they aren’t getting their money’s worth if they are paying a high delivery cost for a lightweight item.<\/p>\n<p>Offering a standard price for shipping across your site is the easiest, most profitable and most transparent way to cover delivery costs, particularly in the early days of your eCommerce business when you are fulfilling all your orders yourself.<\/p>\n<p>As your order volume increases and you develop stronger relationships with couriers, you can negotiate lower costs per item which will help improve your profit margin. Whether you pass these savings on to the customer, continue to use them to cover your own costs or begin to introduce free shipping is part of the next step in being more competitive.<\/p>\n<h2>What Free Shipping Strategy is Best For Your eCommerce Store?<\/h2>\n<p>There is more than one way to introduce a successful free shipping strategy to your eCommerce store. There aren’t many stores out there that offer a blanket free shipping option across all orders on their website &#8211; apart from big eCommerce giants like Amazon, of course!<\/p>\n<p>So, let’s take a look at some of the best free shipping strategy options to choose from…<\/p>\n<h3><strong>1. Minimum spend threshold<\/strong><\/h3>\n<p>This is one of the most common eCommerce free shipping strategies. It is clear, easy to understand, can help boost order values and helps protect your profit margin.<\/p>\n<p>Yes, having a required minimum order value to receive free shipping is a tried and tested tactic. It allows you the best of both worlds, as those lower revenue orders continue to cover shipping for themselves, while those bringing you more money can bring the benefits of free shipping.<\/p>\n<p>The concept here is that customers will be encouraged to spend more in order to get their delivery for free. You need to be tactical and set the threshold just about your average order value, which can lead to upsells as customers spend more to ‘save’ on delivery.<\/p>\n<h3><strong>2. Free shipping for members<\/strong><\/h3>\n<p>If you want to improve customer loyalty and retain more existing customers, this is a good way to use free shipping to your advantage.<\/p>\n<p>If you set up a loyalty club or membership to your website, offering free shipping is a big perk to help customers sign up to it. This is best for businesses where repeat purchases are regular, such as fashion and beauty websites, for example.<\/p>\n<p>Typically, customers will pay a fee to receive free shipping on all orders for the next 12 months. In return, you can send them regular marketing communications, plus will have them in a position where they are more committed to buying from you.<\/p>\n<h3><strong>3. Use free shipping as part of a sale or promotion<\/strong><\/h3>\n<p>A free shipping strategy doesn’t have to be year-round. For many eCommerce stores, free shipping is reserved for big marketing pushes, particularly at competitive times of year.<\/p>\n<p>It could be as part of your Black Friday sale or in the final run up to Christmas &#8211; you can also include a minimum spend threshold, to really make the most of those periods of increased consumer spending.<\/p>\n<p>On the flip side, free shipping can also be used to help move slow moving stock that you want to get rid of faster. Again, as part of a promotion, you could offer free shipping on these particular products as a way of increasing interest in them.<\/p>\n<h3><strong>4. Free shipping absorbed in product cost<\/strong><\/h3>\n<p>Is anything ever really free?!<\/p>\n<p>If you are struggling to make the numbers add up, you can help cover the cost of free shipping by raising product prices slightly. But again, you need to be tactical. The ‘free shipping’ banner on your website might attract customers away from competitors, but savvy shoppers will still know where the best deal is &#8211; so, don’t make your prices excessive, and be sure to highlight the free shipping service.<\/p>\n<h3><strong>5. Offer a choice of shipping options<\/strong><\/h3>\n<p>Finally, you can also try offering free shipping as one of a number of options to give your customers a flexible choice.<\/p>\n<p>For example, you could offer free shipping for your low cost delivery option &#8211; one that might take 3 days+ to get to the customer. As an alternative, you could offer <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/expedited-shipping-explained\/\" target=\"_blank\" rel=\"noopener noreferrer\">expedited shipping<\/a> as a faster option, but at a cost to the customer.<\/p>\n<h3><strong>Implementing a free shipping strategy&#8230;<\/strong><\/h3>\n<p>The free shipping strategy you choose depends on your particular business and its goals. Have a clear reason in mind what you want to achieve from your free shipping and build a strategy around it.<\/p>\n<p>Another vital requirement to ensuring you have a successful free shipping strategy is ensure you have the best possible courier rates and most efficient logistics process &#8211; something that a <a href=\"https:\/\/www.3p-logistics.co.uk\/third-party-logistics\/\" target=\"_blank\" rel=\"noopener noreferrer\">third party logistics company<\/a> can really help you out with.<\/p>\n<p>Finally, you want to have the ability to review the impact of your free shipping by reviewing whether it has helped you reach your goals &#8211; whether that is an improved conversion rate, new customers or fewer cart abandonments. If you meet your targets and see an increase in the bottom line of your profit &#8211; congratulations on your successful free shipping strategy!<\/p>\n<h3 style=\"text-align: center;\">PS, would you like a chat about how you can start successfully offering free shipping as part of your eCommerce store? <a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\" target=\"_blank\" rel=\"noopener noreferrer\">Contact 3PL<\/a> for our expert advice.<\/h3>\n<p style=\"text-align: center;\"><strong>More e-commerce business advice from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\" target=\"_blank\" rel=\"noopener noreferrer\">3PL blog<\/a>…<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/demand-forecasting\/\" target=\"_blank\" rel=\"noopener noreferrer\">Demand Forecasting: What is it, Methods and Best Practices<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-are-the-essential-requirements-for-inventory-management-software\/\" target=\"_blank\" rel=\"noopener noreferrer\">What Are the Essential Requirements For Inventory Management Software?<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-key-advantages-of-using-a-third-party-logistics-provider\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Key Advantages of Using a Third Party Logistics Provider<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Offering free shipping is often seen as the holy grail for customers &#8211; they want their products to arrive fast, free and without any hitches. But, what is the cost&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2436,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2434"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2434"}],"version-history":[{"count":8,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2434\/revisions"}],"predecessor-version":[{"id":2445,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2434\/revisions\/2445"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2436"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2434"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2434"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2434"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}