{"id":2459,"date":"2020-06-02T12:24:07","date_gmt":"2020-06-02T11:24:07","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2459"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"how-important-are-eco-friendly-packaging-options-to-todays-businesses","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-important-are-eco-friendly-packaging-options-to-todays-businesses\/","title":{"rendered":"How Important Are Eco Friendly Packaging Options to Today&#8217;s Businesses?"},"content":{"rendered":"<h2>What is most important to your eCommerce store? Is it profit? Your people? Or, maybe it’s the environment?<\/h2>\n<p>Today, more than ever, consumers want to know where their favourite products are coming from. When making a purchase online, more and more people are thinking twice about the wider impact of their decision &#8211; climate change, pollution and the health of the planet are now impacting our lives like never before.<\/p>\n<p>This is where the rise of eco friendly packaging comes in. Brands are beginning to shift their focus to keep up with the changing priorities of their customers. Will you be doing the same?<\/p>\n<p>In today’s blog, we take a look into the importance of eco friendly packaging and whether you should start factoring it into your <a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">eCommerce fulfilment<\/a> process&#8230;<\/p>\n<h2>What is Eco Friendly Packaging?<\/h2>\n<p>Eco friendly packaging is a broad term that refers to any packaging that is made from recycled, recyclable, biodegradable or renewable materials.<\/p>\n<p>Generally, the purpose of this is to:<\/p>\n<ul>\n<li>Protect the environment from harmful waste<\/li>\n<li>Reduce our reliance on non-renewable resources<\/li>\n<li>Reduce our carbon footprint by saving more trees and producing less greenhouse gasses<\/li>\n<li>Send fewer items to landfills, where they can find their way back into the ecosystem<\/li>\n<\/ul>\n<p>Words like ‘eco friendly’, ‘sustainable’ and ‘conscious’ are all quickly becoming buzzwords popping up everywhere from news reports to marketing tactics.<\/p>\n<h2>Why Does Eco Friendly Packaging Matter to eCommerce?<\/h2>\n<p>So, what exactly has this got to do with your eCommerce store?<\/p>\n<p>While eCommerce continues to grow, this also means that the amount of packaging we are using is growing, too. This doesn’t quite fit in with another issue that is rapidly grabbing your customer’s attention &#8211; the effect their use of plastic and packaging has on the environment.<\/p>\n<p>In fact, research in 2019 revealed that <a href=\"https:\/\/www.theguardian.com\/environment\/2019\/apr\/19\/half-of-uk-consumers-willing-to-pay-more-to-avoid-plastic-packaging-survey-shows\" target=\"_blank\" rel=\"noopener noreferrer\">eight in 10 consumers are trying to reduce their plastic waste<\/a> and half of those questioned would be happy to <em>pay more<\/em> to receive their item in eco friendly packaging.<\/p>\n<p>What’s more, 46% of people asked expressed that they feel ‘guilty’ about the amount of plastic they use. Younger people in particular feel this way, with 51% of people aged 18-24 admitting to feeling guilty, compared to 43% of those in their late 40s to early 50s.<\/p>\n<p>This isn’t a change that has happened over night.<\/p>\n<p>In 2015, free single-use plastic bags were put to an end in England, resulting in a <a href=\"https:\/\/www.gov.uk\/government\/news\/plastic-bag-sales-down-90-since-introduction-of-5p-charge\" target=\"_blank\" rel=\"noopener noreferrer\">90% reduction in their use by 2019<\/a>.<\/p>\n<p>A couple of years later, David Attenborough’s Blue Planet II documentary was credited with having a <a href=\"https:\/\/www.globalcitizen.org\/en\/content\/88-blue-planet-2-changed-david-attenborough\/\" target=\"_blank\" rel=\"noopener noreferrer\">huge impact on our environmental choices<\/a>, from using refillable water bottles and coffee cups, to choosing loose fruit over pre-packaged.<\/p>\n<p>The trend continued in 2018, when the use of <a href=\"https:\/\/www.gov.uk\/government\/news\/world-leading-microbeads-ban-comes-into-force\" target=\"_blank\" rel=\"noopener noreferrer\">microbeads was banned<\/a> for use in products sold in the UK after growing awareness of their effect on marine life. In the same year, European Parliament voted in favour of a <a href=\"http:\/\/bbc.co.uk\/news\/world-europe-45965605\" target=\"_blank\" rel=\"noopener noreferrer\">ban on single use plastics<\/a> across the EU, including plastic cutlery, cotton buds and plastic straws.<\/p>\n<p>It’s clear that many consumers want plastic and non-recyclable materials out of our lives as much as possible. However, with more and more consumers buying online, we’ve also needed packaging materials more than ever before &#8211; so, the need has arisen to consolidate these two issues.<\/p>\n<h2>Is There Another Side to the Eco Packaging Story?<\/h2>\n<p>It’s true that plastic does have a hugely negative impact on our environment.<\/p>\n<p>But, you do need to tread carefully when thinking of advertising your brand as eco-friendly.<\/p>\n<p>The packaging industry has pointed out that plastic packaging <a href=\"https:\/\/www.packaginginsights.com\/news\/packaging-trends-2019-part-1-the-search-for-sustainability.html\" target=\"_blank\" rel=\"noopener noreferrer\">can help reduce food waste by extending shelf life<\/a> &#8211; but only an estimated <strong>9% of it has been recycled since the 1950s<\/strong>. There is also some confusion around ‘bioplastics’ &#8211; many of which claim to be biodegradable or compostable, but can still leave toxic microplastics behind.<\/p>\n<p>Other issues such as water usage and land usage can also impact the ‘eco friendliness’ of your packaging choice, leaving many feeling as though they are in a minefield of options.<\/p>\n<p>When it comes to your brand, you don’t want to find yourself in a sticky situation where your good intentions are subject to scrutiny. There are a number of eco friendly packaging suppliers out there, so it’s always best to do your research on them and ask them exactly how their products are made, where they are sourced and how they can be disposed of. You should then pass this knowledge onto your customers in an honest and transparent way.<\/p>\n<p>If your brand pays lip service to eco issues without properly following through with them, consumers will take note &#8211; and you might have to work hard to get their trust back.<\/p>\n<h2>Should You Be Using Eco Friendly Packaging for Your eCommerce Store?<\/h2>\n<p>It’s clear that the demand for companies that offer a solution to our environmental concerns is there &#8211; from <a href=\"https:\/\/www.3p-logistics.co.uk\/subscription-box-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">subscription box fulfilment<\/a> to <a href=\"https:\/\/www.3p-logistics.co.uk\/amazon-fba-preperation-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">orders made on Amazon<\/a>, customers want less packaging. But, exactly how should you approach it as an eCommerce business?<\/p>\n<p>Adding a ‘conscience’ to your brand not only helps the environment &#8211; the main aim &#8211; but can help you sell your products, too. When faced with your brand and a competitor’s, your promise to use eco friendly packaging could be the USP that finalises your customers decision.<\/p>\n<p>Have a think about these points when you are thinking about improving the eco credentials of your eCommerce store…<\/p>\n<ul>\n<li><strong>Your brand<\/strong> &#8211; using eco friendly packaging can give you an image boost to the environmentally-conscious, but think about how you will have to adapt your existing brand. If you change to recycled cardboard for example, it might have a very different look and feel to it than if you were using laminated or foiled cardboard previously. How will you make the two align?<\/li>\n<li><strong>Your Audience<\/strong> &#8211; think about who they are and how you will communicate your new eco message to them. If you market to Gen Z and Millenials, you might see a more active response than if you have an older market base.<\/li>\n<li><strong>Your budget<\/strong> &#8211; going eco friendly might be important to you and your customers, but always make sure your numbers add up.<\/li>\n<li><strong>Is it suitable?<\/strong> &#8211; finally, be sure any new packaging meets the requirements of your product. Any changes in size or weight could have an effect on your courier costs and <a href=\"https:\/\/www.3p-logistics.co.uk\/fulfilment-warehouse\/\" target=\"_blank\" rel=\"noopener noreferrer\">warehousing<\/a> space, plus you still need to be confident it will protect the item inside throughout the <a href=\"https:\/\/www.3p-logistics.co.uk\/third-party-logistics\/\" target=\"_blank\" rel=\"noopener noreferrer\">logistics process<\/a> &#8211; an experienced 3PL company can help you navigate these changes.<\/li>\n<\/ul>\n<p>Once you have considered everything and are ready to put your eco packaging into action, be sure to shout about it! Let customers know about the changes you are making and provide them with any further information on how to recycle or reuse what you are sending out.<\/p>\n<h2><strong>What Are Eco Friendly Packaging Materials?<\/strong><\/h2>\n<p>As we have already mentioned, there are so many options out there when looking for eco friendly packaging materials!<\/p>\n<p>Here are some of the most popular eco friendly packaging ideas…<\/p>\n<p><strong>Cardboard and paper<\/strong><\/p>\n<p>Yes, it’s simple but true &#8211; old fashioned cardboard and paper can make an easy alternative to plastic bags, wrappings and even bubble wrap. Make sure it is certified as being sustainably sourced, or has been manufactured out of recycled paper.<\/p>\n<p>Cardboard and paper has the benefit of being up to 80% biodegradable, but it’s also a good idea to make it recyclable again. Some laminations and inks can prevent this or can be toxic, so check when choosing your materials.<\/p>\n<p><strong>Recycled plastics<\/strong><\/p>\n<p>We can reduce the amount of plastic we use going forwards, but what about the immense <a href=\"https:\/\/www.nationalgeographic.com\/news\/2017\/07\/plastic-produced-recycling-waste-ocean-trash-debris-environment\/\" target=\"_blank\" rel=\"noopener noreferrer\">8.3 billion tons that currently exists on the planet<\/a>? If your product simply cannot be packaged without the use of plastic, using recycled plastic can help you do your bit to reduce the amount being sent to landfills.<\/p>\n<p>You can also see if you can use less of the plastic too. Sometimes, simply reducing the amount of single use packaging you use can go far in helping the environment.<\/p>\n<p><strong>Bioplastics and biodegradable plastics<\/strong><\/p>\n<p>Bioplastics made from things like cornstarch aren’t without their own issues. While they take significantly less greenhouse gasses to produce and can biodegrade into compost, it relies on them being disposed of correctly. Let your customers know how they can best get rid of their packaging once they are done with it.<\/p>\n<p><strong>Jute and cotton<\/strong><\/p>\n<p>If you sell more of a whiteglove item or luxury product, using organic cotton or jute can give your items a layer of protection that is eco friendly while still looking attractive. Reusable drawstring bags are a popular idea, especially when they have your brand’s logo printed on them.<\/p>\n<h2>Can You Use Eco Friendly Packaging With Third Party Logistics?<\/h2>\n<p>There are many advantages to using a <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-key-advantages-of-using-a-third-party-logistics-provider\/\" target=\"_blank\" rel=\"noopener noreferrer\">third party logistics provider<\/a> &#8211; one is that they can pick-and-pack your items using your choice of packaging, as well as dispatch your orders efficiently. So, you can concentrate on making your brand as appealing as possible.<\/p>\n<h3><strong>P.S, if you want to chat about how our third party logistics company can help your eCommerce business grow, <a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\" target=\"_blank\" rel=\"noopener noreferrer\">contact 3PL<\/a> for our expert advice.<\/strong><\/h3>\n<p style=\"text-align: center;\"><strong>More eCommerce business insights from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\" target=\"_blank\" rel=\"noopener noreferrer\">3PL blog<\/a>…<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/free-shipping-should-your-e-commerce-store-offer-it\/\" target=\"_blank\" rel=\"noopener noreferrer\">Free Shipping: Should Your eCommerce Store Offer It?<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/expedited-shipping-explained\/\" target=\"_blank\" rel=\"noopener noreferrer\">Expedited Shipping Explained<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-the-best-way-to-manage-and-keep-control-of-my-inventory\/\" target=\"_blank\" rel=\"noopener noreferrer\">What is the Best Way to Manage and Keep Control Of My Inventory?<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is most important to your eCommerce store? Is it profit? Your people? Or, maybe it’s the environment? Today, more than ever, consumers want to know where their favourite products&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2462,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2459"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2459"}],"version-history":[{"count":6,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2459\/revisions"}],"predecessor-version":[{"id":2468,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2459\/revisions\/2468"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2462"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2459"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2459"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2459"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}