{"id":2624,"date":"2020-07-10T09:03:27","date_gmt":"2020-07-10T08:03:27","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2624"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"how-to-work-out-the-cost-per-order-of-your-ecommerce-store","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-work-out-the-cost-per-order-of-your-ecommerce-store\/","title":{"rendered":"How to Work Out the Cost Per Order of Your  eCommerce Store"},"content":{"rendered":"<h3>What are the most important eCommerce metrics you should be tracking to ensure the success of your business?<\/h3>\n<p>When selling online, there is so much data to sift through, it can be hard to know where to begin.<\/p>\n<p>However, there is one key factor that every eCommerce store should be familiar with &#8211; CPO, or ‘cost per order’.<\/p>\n<p>In this guide, we break down the essential information on what CPO is, why you need to use it and how you can keep it as low as possible.<\/p>\n<h2>What is Cost Per Order?<\/h2>\n<p>Cost per order (CPO) is a calculation you can make to work out how much you spend on every sale your eCommerce store makes. This allows you to see exactly how much profit you make on every order.<\/p>\n<h2>Why Do You Need to Know Your Cost Per Order For Your eCommerce Store?<\/h2>\n<p>The main reason why you need to know your cost per order is to ensure you aren’t spending more money on acquiring customers than they are spending with you in return.<\/p>\n<p>In short, it allows you to see how much profit you are making off each order when you take into consideration all the costs involved in making the sale and the fulfillment process.<\/p>\n<p>By keeping a close eye on your cost per order, you can also:<\/p>\n<ul>\n<li>Make sure each area of your business is running as cost effectively as possible<\/li>\n<li>Equip yourself with the data you need to start successfully scaling up your eCommerce store<\/li>\n<li>Identify areas where you need to spend more or less on acquiring customers<\/li>\n<\/ul>\n<p>It’s important that you don’t use estimates when it comes to CPO, especially as your business starts to grow.<\/p>\n<p>As more costs become involved, new product lines are added and marketing spend begins to increase, you need to know exactly how much profit this is translating into. A common pitfall for growing eCommerce stores is to ramp up marketing spend without ensuring a sustainable amount of ROI. Calculating your CPO gives you the best visibility over how big your profit margin is.<\/p>\n<p>Similarly, it’s good to know when costs can actually be increased. If you can save money in one area, you can try out investing it in another area that you want to grow &#8211; whether that is marketing, product production or maybe on some new branded packaging that will improve customer experience.<\/p>\n<h2>What Costs Should You Include in Your Cost Per Order Calculation?<\/h2>\n<p>The costs you include in your cost per order calculation depends on exactly what you want to know.<\/p>\n<p>This could be:<\/p>\n<ul>\n<li><strong>The cost to acquire a customer (CAC)<\/strong> &#8211; this would include all of your advertising costs<\/li>\n<li><strong>The cost of order fulfilment<\/strong> &#8211; think about warehousing, packaging, logistical and shipping costs<\/li>\n<li><strong>A ‘fully loaded’ CPO<\/strong> &#8211; including all of the costs involved in running the business, from salaries and labour costs to your lighting bill<\/li>\n<\/ul>\n<p>Typically, you will need to know the following costs to fully be able to get to grips with your true CPO:<\/p>\n<ul>\n<li>All marketing spend and materials, whether this is on- or offline<\/li>\n<li>Packaging<\/li>\n<li>Shipping<\/li>\n<li>Warehousing and utilities<\/li>\n<li>Picking and packing<\/li>\n<li>Storage<\/li>\n<li>Direct and indirect labour costs<\/li>\n<li>Total cost of the goods sold (COGS)<\/li>\n<\/ul>\n<p>If there are any other additional costs relevant to your eCommerce store, be sure to factor them in too.<\/p>\n<h2>How to Calculate Your CPO<\/h2>\n<h3>Cost Per Order Formula<\/h3>\n<p>The cost per order formula is pretty straightforward. You just need to divide the total sum of all your costs by the number of orders fulfilled in a chosen period of time:<\/p>\n<p><strong>Total costs \/ total number of orders = CPO<\/strong><\/p>\n<p>However, this number alone won’t be useful unless you know how much revenue you made off those orders. To do this, work out your average order value (AOV) over the same period of time:<\/p>\n<p><strong>Total revenue \/ total number of orders = AOV<\/strong><\/p>\n<p>If you then deduct the CPO from the AOV, you will see how much profit you have made on average for every order.<\/p>\n<p><strong>AOV &#8211; CPO = average profit per order<\/strong><\/p>\n<p>If your CPO is higher than your AOV, or is below the profit margin you had planned for, something isn’t right. You need to address your costs to see where money can be spent more efficiently in your sales and fulfilment process.<\/p>\n<h2>How Can You Lower Your Cost Per Order?<\/h2>\n<p>So, maybe you have worked out your CPO and think it is too high. What can you do about it?<\/p>\n<p>First of all, break down all of your costs into a percentage, so you can see where the biggest proportion of money is being spent.<\/p>\n<p>Then, address each area to see if costs can be reduced…<\/p>\n<h3>Shipping costs<\/h3>\n<p>The cost of shipping your orders can have a big impact on your cost per order, especially if you have a <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/free-shipping-should-your-e-commerce-store-offer-it\/\" target=\"_blank\" rel=\"noopener noreferrer\">free shipping strategy<\/a>. Even if your customers pay shipping costs themselves, if this is too high they might abandon their purchase &#8211; which has a knock on effect for your bottom line.<\/p>\n<p>If your order volume is high enough, see if you can negotiate lower rates and compare with other courier services. Working with an <a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">eCommerce fulfilment provider<\/a> can help here, as they generally have access to discounted shipping and efficient <a href=\"https:\/\/www.3p-logistics.co.uk\/international-freight-forwarding\/\" target=\"_blank\" rel=\"noopener noreferrer\">freight forwarding<\/a>.<\/p>\n<h3>Warehousing<\/h3>\n<p>Running an efficient warehouse isn’t easy. The order process, <a href=\"https:\/\/www.3p-logistics.co.uk\/pick-pack-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">picking and packing<\/a> and staffing all takes tight organisation to ensure it is as cost effective as possible. Not only does this take money, but also valuable time that could be invested in other areas of the business.<\/p>\n<p>Again, consider using a 3PL company if your warehousing is becoming an issue. One of the key benefits in this respect is that all staffing, training and management costs are already set up in the most efficient way possible. This means orders can be fulfilled quickly and smoothly, so you can streamline your process.<\/p>\n<p>Find out more about the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-key-advantages-of-using-a-third-party-logistics-provider\/\" target=\"_blank\" rel=\"noopener noreferrer\">key advantages of using a third party logistics provider here<\/a>.<\/p>\n<h3>Stock Storage<\/h3>\n<p>Do you have slow moving stock sitting on your shelves? Or perhaps you are paying for storage space you don’t actually need? If you rent a warehouse, this could be adding unnecessary costs to your eCommerce store.<\/p>\n<p>Make sure you are properly managing your inventory with suitable software so you don’t over-order on your stock. A <a href=\"https:\/\/www.3p-logistics.co.uk\/fulfilment-warehouse\/\" target=\"_blank\" rel=\"noopener noreferrer\">fulfilment warehouse<\/a> tracks your inventory in real time and often only charges for the storage space you actually use. This means you can keep a close eye on your stock levels and don’t end up paying for something you don’t actually need.<\/p>\n<p>We have a full guide on the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-the-best-way-to-manage-and-keep-control-of-my-inventory\/\" target=\"_blank\" rel=\"noopener noreferrer\">best ways to manage your inventory here<\/a>.<\/p>\n<h3>Cost of Goods Sold<\/h3>\n<p>How much you are paying for your inventory is vital to controlling your CPO. If you are currently running a <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/should-you-use-dropshipping-for-your-e-commerce-store\/\" target=\"_blank\" rel=\"noopener noreferrer\">dropshipping business<\/a>, it can be hard to negotiate a lower price as demand is already so high. However, if you order in bulk from a wholesaler, you might be able to receive your goods for a lower price as your sales volume increases.<\/p>\n<h2>CPO &#8211; Summary<\/h2>\n<p>So, are you ready to reevaluate your CPO? If you are, make sure to pay special attention to your warehousing, shipping and order fulfilment process to see if your improved efficiency can turn into more profit per sale.<\/p>\n<h3 style=\"text-align: center;\">P.S, if you want to find out whether a third party logistics provider can make your eCommerce store more cost effective, <a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\" target=\"_blank\" rel=\"noopener noreferrer\">contact 3PL<\/a> for a chat today.<\/h3>\n<p style=\"text-align: center;\"><strong>More from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\" target=\"_blank\" rel=\"noopener noreferrer\">3PL blog<\/a>&#8230;<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-important-are-eco-friendly-packaging-options-to-todays-businesses\/\" target=\"_blank\" rel=\"noopener noreferrer\">How Important Are Eco-Friendly Packaging Options to Today&#8217;s Businesses?<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/expedited-shipping-explained\/\" target=\"_blank\" rel=\"noopener noreferrer\">Expedited Shipping Explained<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-a-third-party-logistics-provider\/\" target=\"_blank\" rel=\"noopener noreferrer\">What is a Third Party Logistics Provider?<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What are the most important eCommerce metrics you should be tracking to ensure the success of your business? When selling online, there is so much data to sift through, it&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2626,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2624"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2624"}],"version-history":[{"count":4,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2624\/revisions"}],"predecessor-version":[{"id":2631,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2624\/revisions\/2631"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2626"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2624"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2624"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2624"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}