{"id":2781,"date":"2020-09-09T08:55:13","date_gmt":"2020-09-09T07:55:13","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2781"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"what-to-consider-when-importing-goods-to-the-uk","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-to-consider-when-importing-goods-to-the-uk\/","title":{"rendered":"What to Consider When Importing Goods to the UK"},"content":{"rendered":"<p><strong>Today, we really do live in the age of a global marketplace &#8211; but, just how easy is it to import goods into the UK for your eCommerce store?<\/strong><\/p>\n<p>The truth is, importing requires a lot of preparation, logistics and research to get started. But, if done properly, you can reap a number of rewards for your eCommerce business, from lower costs to an improved product offering.<\/p>\n<p>Want to find out more? Take a look at these key things to consider when importing goods to the UK for your online business&#8230;<\/p>\n<h2>What are the Benefits of Importing Goods to the UK?<\/h2>\n<p>There’s no denying it that to the uninitiated, importing goods is a long and complex looking process. So, why do so many UK eCommerce businesses do it?<\/p>\n<p>There are a couple of key reasons for importing goods that could make it worth your while:<\/p>\n<ul>\n<li>It <em>can<\/em> reduce costs if done effectively, as some products can be manufactured cheaper overseas<\/li>\n<li>You can find new and unique products to bring to the market that are only produced outside the UK<\/li>\n<\/ul>\n<p>Businesses that have broken through any initial hurdles when it comes to importing goods for sale in the UK can really set themselves apart from their competitors. It could be through being able to offer the lowest prices to their customers, being the only supplier of a certain product, offering the best quality or even finding rare goods.<\/p>\n<h2>What are the Disadvantages of Importing Goods?<\/h2>\n<p>Importing goods to the UK can also come with a number of downsides, too.<\/p>\n<p>For starters, while the actual cost of your goods might be cheaper in another country, there is a whole new set of costs involved in getting them into your warehouse. You will need to manage these carefully to ensure you really are getting the best deal.<\/p>\n<p>You will have to consider the cost of:<\/p>\n<ul>\n<li>Transportation<\/li>\n<li>Import duty to the UK<\/li>\n<li>VAT<\/li>\n<li>The effect exchange rates will have on the cost<\/li>\n<\/ul>\n<p>To make matters even <em>more<\/em> complicated, there are often different sets of rules for each country, while the EU also has its own regulations. Then, there is the small matter of Brexit in the wings to add another spanner in the works!<\/p>\n<p><strong>Related: <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-will-brexit-affect-online-sellers\/\"><strong>How Will Brexit Affect Online Sales?<\/strong><\/a><\/p>\n<p>So as you can see, when importing goods into the UK, knowledge really is power. If not handled properly, it could be very costly, time consuming or even land you with a fine or legal troubles.<\/p>\n<p>For this reason, many businesses employ the help of a customs broker to ensure they can clear the import process as seamlessly as possible.<\/p>\n<h2>Importing Goods to the UK &#8211; What Do You Need to Do?<\/h2>\n<p>We’re not going to pretend we have an easy guide to importing goods into the UK! The truth is, all the paperwork you need can get complicated. Your process will be unique to the products you are importing and the country you are bringing them in from.<\/p>\n<p>However, you will likely need to follow these general steps when importing to the UK&#8230;<\/p>\n<h3>Choose Your Shipping Methods<\/h3>\n<p>The shipping method you choose to transport your goods from their country of origin to the UK will have a huge impact on the overall cost.<\/p>\n<p>There are a number of options available, including:<\/p>\n<ul>\n<li><strong>Air freight <\/strong>&#8211; fast, but is usually the most expensive. Prices are calculated based on weight, so not ideal for heavy items<\/li>\n<li><strong>Sea freight<\/strong> &#8211; slower, but much cheaper than air freight. The cost is often based on volume rather than weight, so is usually better suited to heavy goods<\/li>\n<li><strong>Rail<\/strong> &#8211; very cost effective in Europe, but you are limited to existing rail routes<\/li>\n<li><strong>Road<\/strong> &#8211; flexible in Europe, though can be slow and costly when you add in fuel and road tolls<\/li>\n<\/ul>\n<p>For anyone new to international logistics, finding the most cost-effective transportation can be a huge task. It’s unlikely you will have a lot of local knowledge or network connections to help you out.<\/p>\n<p>For this reason, using a <a href=\"https:\/\/www.3p-logistics.co.uk\/international-freight-forwarding\/\">freight forwarding service<\/a> &#8211; like ours at <a href=\"https:\/\/www.3p-logistics.co.uk\/\">3PL<\/a> &#8211; can make the whole process a lot easier. We can negotiate bulk rates, track your shipments in real time and offer a customer support service to keep you informed every step of the way.<\/p>\n<h3>Register Your Business and Goods<\/h3>\n<p>Before you start importing your goods, you need to have all of the correct documentation in place to ensure they can come into the country as seamlessly as possible&#8230;<\/p>\n<ul>\n<li><strong>EORI Number<\/strong><strong> <\/strong><\/li>\n<\/ul>\n<p>EORI stands for ‘Economic Operators Registration and Identification’ and is required for importing goods to the UK from outside the EU.<\/p>\n<p>That being said, from 1 January 2021, you will also need an EORI number that starts with ‘GB’ to import goods from <em>within<\/em> the EU, too.<\/p>\n<p>You can apply for an EORI number on the government website, and it should be ready for you within a week. If you are VAT registered, you might have already been assigned one.<\/p>\n<ul>\n<li><strong>Commodity Code<\/strong><\/li>\n<\/ul>\n<p>Commodity codes are numbers allocated to certain types of goods, making them easy to identify when they are imported. When correctly classified, you will be able to see what import duty will you be charged on them, plus any licenses or other regulations you will need to follow.<\/p>\n<ul>\n<li><strong>Import Licenses<\/strong><\/li>\n<\/ul>\n<p>Most items being imported into the UK do not require an import license. However, it is always best to check. Typically, it is only goods that need to be monitored by the government that will need a licence, such as firearms, medicine, chemicals, artwork and plants.<\/p>\n<ul>\n<li><strong>Value your goods<\/strong><\/li>\n<\/ul>\n<p>Before you import goods from outside the EU, you will also need to value them and inform the HMRC.<\/p>\n<p>This can be tricky, and there are a few different ways you can do it. Take a look at the <a href=\"https:\/\/www.gov.uk\/guidance\/how-to-value-your-imports-for-customs-duty-and-trade-statistics?step-by-step-nav=849f71d1-f290-4a8e-9458-add936efefc5\">government website<\/a> for some advice.<\/p>\n<h3>Pass Your Goods Through UK Customs<\/h3>\n<p>Finally, once you have laid the groundwork and transported your goods to the UK border, they will be ready for you to officially import.<\/p>\n<p>You will need to submit an import declaration, and will then be told exactly how much duty and VAT you need to pay to get the goods released. A customs broker can really help you out here.<\/p>\n<p>Once you have paid any required charges, you will be sent a Import VAT Certificate as proof that your goods have been correctly imported.<\/p>\n<p>Remember to keep hold of all the documents you receive &#8211; any invoices, customs paperwork or records &#8211; throughout the importing process in case you need them again.<\/p>\n<h2>Import Duty &#8211; What Is It &amp; How is it Calculated?<\/h2>\n<p>Import duty is a tax you pay on any goods you bring into the UK.<\/p>\n<p>It used to be that you would only pay import tax in the UK if you imported goods from <em>outside<\/em> the EU. However, with the UK set to leave the EU, from 1 January 2021 there will be a new rate of tax and duty to pay to import goods from Europe, too.<\/p>\n<h3>How is Import Duty Calculated?<\/h3>\n<p>Import duty is calculated based on:<\/p>\n<ul>\n<li>The type of product you are importing &#8211; this will be identified by your commodity code<\/li>\n<li>Where you are importing your goods from<\/li>\n<li>The value of the goods you are importing<\/li>\n<li>The cost of transportation and shipping insurance<\/li>\n<\/ul>\n<p>If you want to calculate import duty for yourself, use the <a href=\"https:\/\/www.gov.uk\/trade-tariff\">Trade Tariff<\/a> to find out what percentage of the total value of your goods you will need to pay:<\/p>\n<p><strong>Cost of goods + cost of transportation + shipping insurance = value of goods<\/strong><strong> <\/strong><\/p>\n<p><strong>X% of value of goods = Import Duty<\/strong><\/p>\n<p>(You will find the value of X by submitting your specific details into the Trade Tariff calculator).<\/p>\n<p>Then, you can add your import duty amount to your value of goods. You will then pay VAT on this total amount.<\/p>\n<p><strong>20% of (value of goods + import tax) = VAT<\/strong><\/p>\n<p><strong>(Value of goods + import duty) + VAT = Total cost of import<\/strong><\/p>\n<p>As the cost of transporting your goods to the UK is included in your import duty, it’s <em>even more<\/em> important that you use the best value shipping methods to ensure you keep your costs as manageable as possible.<\/p>\n<h3 style=\"text-align: center;\">P.S &#8211; Are you thinking about importing goods into the UK for your eCommerce business? Have a <a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\">chat with 3PL<\/a> to see how our freight forwarding services and <a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\">eCommerce fulfilment<\/a> solutions can help.<\/h3>\n<p style=\"text-align: center;\"><strong>More eCommerce fulfilment advice from the <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><strong>3PL blog<\/strong><\/a><strong>&#8230;<\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\"><strong>5 Ways to Improve Your Order Fulfillment Process<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/free-shipping-should-your-e-commerce-store-offer-it\/\"><strong>Free Shipping: Should Your eCommerce Store Offer It?<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-a-third-party-logistics-provider\/\"><strong>What is a Third Party Logistics Provider?<\/strong><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today, we really do live in the age of a global marketplace &#8211; but, just how easy is it to import goods into the UK for your eCommerce store? The&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2782,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2781"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2781"}],"version-history":[{"count":1,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2781\/revisions"}],"predecessor-version":[{"id":2783,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2781\/revisions\/2783"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2782"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2781"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2781"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2781"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}