{"id":2797,"date":"2020-09-22T13:49:03","date_gmt":"2020-09-22T12:49:03","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2797"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"inventory-turnover-ratio-what-is-it-how-to-calculate-it","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/inventory-turnover-ratio-what-is-it-how-to-calculate-it\/","title":{"rendered":"Inventory Turnover Ratio: What Is It &#038; How to Calculate It"},"content":{"rendered":"<h3>Every successful eCommerce business is built on a thorough understanding of what works, what doesn’t and how to put this into action.<\/h3>\n<p>One of the most important metrics used for this is the inventory turnover ratio.<\/p>\n<p>By tracking it properly, your inventory turnover calculations can reveal the driving forces behind your revenue, offering valuable insights into where your profit is falling short.<\/p>\n<p>So, what exactly is inventory turnover? How do you work it out and what should you do about it? Read our guide to find out&#8230;<\/p>\n<h2>What is Inventory Turnover?<\/h2>\n<p>Put simply, your inventory turnover is the number of times your stock is bought and sold in any chosen period of time.<\/p>\n<p>Similar to stock rotation, an inventory turnover calculation lets you know how fast your items are selling &#8211; which is essential for ensuring that your eCommerce business is generating profit efficiently.<\/p>\n<p>Remember, there is a difference between turnover and revenue.<\/p>\n<p>While the two terms are often used in the same way, <strong>revenue<\/strong> refers to the total income you earn from your sales. <strong>Turnover<\/strong>, more specifically, measures the <em>rate<\/em> at which your investments are translating <em>into<\/em> revenue.<\/p>\n<h2>What Can You Learn From Your Inventory Turnover Ratio?<\/h2>\n<p>So, before we get into calculating our inventory turnover ratio, it’s important to keep in mind <em>why<\/em> you are doing it.<\/p>\n<p>As with any data you gather for your eCommerce business, it will be worthless unless you have goals and actions to deliver off the back of it.<\/p>\n<p>You can use your inventory turnover ratio to&#8230;<\/p>\n<ul>\n<li>Make YOY comparisons to see if your stock is still in demand<\/li>\n<li>Compare yourself to industry averages to see if you are falling behind or leading the pack<\/li>\n<li>Plan what stock you buy for the year ahead based on which way your inventory turnover ratio is trending<\/li>\n<li>Identify stock which isn’t delivering revenue fast enough to be of benefit to your business<\/li>\n<\/ul>\n<p>It’s important to bear in mind that different industries have different aims in mind when it comes to inventory turnover. If you sell expensive luxury items, such as cars or fine jewellery, a low turnover rate is to be expected.<\/p>\n<p>For fast fashion eCommerce businesses or sellers of perishable goods, it’s important that stock is sold quickly, before it becomes outdated or expires.<\/p>\n<p>This is why it is always good to set yourself a benchmark for how much stock you need to turnover in your key selling periods to remain profitable.<\/p>\n<h2>How to Calculate Inventory Formula<\/h2>\n<p>To work out your inventory turnover, you need a few pieces of information first:<\/p>\n<ul>\n<li>The <strong>period you want to calculate your turnover for<\/strong> &#8211; often, this will be your full financial year, but your might also want to check it per quarter<\/li>\n<li>The total <strong>cost of goods sold<\/strong> in your chosen period<\/li>\n<li>The <strong>cost of your average inventory<\/strong> you purchased over the same period<\/li>\n<\/ul>\n<p>Here’s how you do it&#8230;<\/p>\n<h3>1. Finding your cost of goods sold (COGS)<\/h3>\n<p>Find out the cost of the inventory you held at the start of the period. Then, add on any indirect costs, such as warehousing or order fulfilment, that are also involved.<\/p>\n<p>Once you have this number, deduct your remaining inventory left at the end of the period. This should give you your cost of goods sold:<\/p>\n<p><strong>(Starting inventory + indirect costs) &#8211; ending inventory = cost of goods sold (COGS)<\/strong><\/p>\n<h3>2. Average inventory formula<\/h3>\n<p>Next, work out your average inventory. Doing this should be simple &#8211; just add the value of your beginning inventory and ending inventory together, and divide by 2:<\/p>\n<p><strong>(Beginning inventory + ending inventory) ÷ 2 = average inventory<\/strong><\/p>\n<h3>3. Inventory turnover formula<\/h3>\n<p>Now, you can put together your inventory turnover calculation.<\/p>\n<p>To do this, you divide your COGS by your average inventory:<\/p>\n<p><strong>COGs ÷ average inventory = inventory turnover rate<\/strong><\/p>\n<h2>Where Does Your Inventory Turnover Ratio Fit Into Your eCommerce Fulfilment Chain?<\/h2>\n<p>When you’ve crunched the numbers, there is still plenty of work to do!<\/p>\n<p>Once you have your inventory turnover ratio, you need to take a look into what this means for your <a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">eCommerce fulfilment<\/a> chain &#8211; can it be too high? Or is it too low? What can you do to make improvements?<\/p>\n<h3>What it means if your inventory turnover ratio is high…<\/h3>\n<p>Typically, a high inventory turnover ratio is a good sign.<\/p>\n<p>If you are turning over a lot of stock, it means you aren’t wasting money on storing inventory that won’t sell. It also suggests that your products are in high demand and you have priced it competitively.<\/p>\n<p><strong>So, are there any downsides to a high inventory turnover?<\/strong><\/p>\n<p>If your turnover is very high, you might be running the risk of running short of supply if there is a surge or increase in demand.<\/p>\n<p>Think about your current warehousing set-up; could you take larger volumes of stock if needed?<\/p>\n<p>If you partner with an order fulfilment company, you have the benefit of flexible <a href=\"https:\/\/www.3p-logistics.co.uk\/fulfilment-warehouse\/\" target=\"_blank\" rel=\"noopener noreferrer\">stock storage<\/a> space. You can scale up slowly without having to invest in a large warehouse before you are ready to.<\/p>\n<p>Check up on your pricing, too. Are you selling so fast because your profit margin is significantly lower than competitors? Are you making the most of this opportunity?<\/p>\n<p>If the demand is there, it could be that you could actually ship more orders if your fulfilment process could handle it. Again, partnering with an eCommerce fulfilment company could benefit you by helping you ship a higher volume of orders more efficiently.<\/p>\n<h3>What it means if your inventory turnover ratio is low…<\/h3>\n<p>Low inventory turnover is usually something to be avoided.<\/p>\n<p>Holding on to too much stock often means decreased profit as you spend more on storage than might be necessary. If you buy in bulk to take advantage of any discounts, make sure the savings you make aren’t negated by this.<\/p>\n<p>If your stock turnover is very low, your fulfilment chain runs the risk of becoming stagnant. You’re not making enough sales, but you don’t have the space to bring in new stock either, as your existing inventory is using up all the space.<\/p>\n<p>Your cash will end up tied into stock that you could be spending on more profitable goods.<\/p>\n<h2>What Can You Do to Improve a Low Inventory Turnover Ratio?<\/h2>\n<p>If your inventory turnover is too low, it doesn’t mean it’s the end of the line for your eCommerce business!<\/p>\n<p>There are a number of things you can do to help turn things around for the better&#8230;<\/p>\n<h3>Pricing<\/h3>\n<p>If you haven’t adjusted your pricing in some time, consider whether this will help shift your stock. If you are outpriced by competitors, see if there is anything you can do to be more competitive &#8211; offer multi-buy discounts, loyalty schemes or <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/free-shipping-should-your-e-commerce-store-offer-it\/\" target=\"_blank\" rel=\"noopener noreferrer\">free shipping<\/a>.<\/p>\n<h3>Planning<\/h3>\n<p>Do you know when your key sales periods are? Does stock move faster at a certain time of year? Are you doing thorough <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/demand-forecasting\/\" target=\"_blank\" rel=\"noopener noreferrer\">sales and demand forecasting<\/a>?<\/p>\n<p>The old saying is true &#8211; if you fail to prepare, then prepare to fail!<\/p>\n<p>Plan ahead carefully to ensure you have the right stock at the right time to nail your inventory turnover targets.<\/p>\n<h3>Marketing<\/h3>\n<p>Are you getting enough word out there about your product or brand? Consider investing in new marketing campaign channels, such as email and social media, or improving your website’s performance.<\/p>\n<p>Before getting carried away with a new line of costs though, always keep an eye on the return on investment from your marketing efforts.<\/p>\n<h3>Management<\/h3>\n<p>Keeping every step in your eCommerce supply and fulfilment cycle as efficient as possible is vital. Make sure you know <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-the-best-way-to-manage-and-keep-control-of-my-inventory\/\" target=\"_blank\" rel=\"noopener noreferrer\">the best way to keep control of your inventory<\/a>. If you don’t already, use an <a href=\"https:\/\/www.3p-logistics.co.uk\/fusion-platform\/\" target=\"_blank\" rel=\"noopener noreferrer\">inventory management platform<\/a> to keep a close eye on every order that comes through.<\/p>\n<p>Getting an in-depth, automated view of the workings of your business can help you optimise without wasting time on manual tasks &#8211; allowing you to focus on creating strong customer relationships and experiences that result in those all-important repeat purchases.<\/p>\n<p style=\"text-align: center;\"><strong>PS, want to know more about how you can improve your inventory ratio? <a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\" target=\"_blank\" rel=\"noopener noreferrer\">Contact 3PL<\/a> today for a chat about how an eCommerce fulfilment partner could benefit your business.<\/strong><\/p>\n<p style=\"text-align: center;\"><strong>More from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\" target=\"_blank\" rel=\"noopener noreferrer\">3PL blog<\/a>…<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-work-out-the-cost-per-order-of-your-ecommerce-store\/\" target=\"_blank\" rel=\"noopener noreferrer\">How to Work Out Cost Per Order for Your eCommerce Store<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\" target=\"_blank\" rel=\"noopener noreferrer\">5 Ways to Improve Your Order Fulfilment Process<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-key-advantages-of-using-a-third-party-logistics-provider\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Key Advantages of Using a Third Party Logistics Provider<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every successful eCommerce business is built on a thorough understanding of what works, what doesn’t and how to put this into action. One of the most important metrics used for&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2799,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2797"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2797"}],"version-history":[{"count":2,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2797\/revisions"}],"predecessor-version":[{"id":2805,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2797\/revisions\/2805"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2799"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2797"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2797"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2797"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}