{"id":2801,"date":"2020-09-29T14:01:07","date_gmt":"2020-09-29T13:01:07","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2801"},"modified":"2022-05-30T14:59:31","modified_gmt":"2022-05-30T13:59:31","slug":"a-guide-to-international-shipping-for-ecommerce-stores","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/a-guide-to-international-shipping-for-ecommerce-stores\/","title":{"rendered":"A Guide to International Shipping for eCommerce Stores"},"content":{"rendered":"<h3>For eCommerce stores, the prospect of reaching a whole new realm of customers overseas is an incredibly tempting way to expand business and add a new stream of revenue.<\/h3>\n<p>But, is it really worth it?<\/p>\n<p>Adding international shipping to your order fulfilment strategy takes a lot of consideration. Even if you are certain the demand is there, you need to be sure that the additional logistics and costs don’t begin to weigh you down.<\/p>\n<p>Not sure where to start with international shipping? Our guide covers the basics to help get you going&#8230;<\/p>\n<h2>How Long Does International Shipping Take?<\/h2>\n<p>When shipping your products internationally, the length of time they take to arrive at your customer’s door can vary anywhere from just a few days to a number of weeks.<\/p>\n<p>This is because the speed of international delivery depends on a number of factors. Get these things right, and your customers will receive their item quickly and satisfactory.<\/p>\n<p>Get them wrong and there could be lengthy transit times, delays due to customs and even damage to the item.<\/p>\n<p>So, why exactly <em>can<\/em> international shipping take so long compared to domestic mail?<\/p>\n<p>Well, first of all, the courier you choose can have a huge impact on the time it takes to ship internationally. Most services offer a number of different options under different names, such as:<\/p>\n<ul>\n<li>Same day shipping<\/li>\n<li>Next day or express shipping<\/li>\n<li>‘Next available flight’<\/li>\n<li>1-3 business days<\/li>\n<li>5 business days<\/li>\n<\/ul>\n<p>Not only this, but each courier service will also have their own cut off times and hours of operation so choosing the best one for your business can get confusing.<\/p>\n<p>Even if you choose the fastest possible route, your international shipment could <em>still<\/em> get held up. If you don’t attach the correct documentation &#8211; such as a commercial invoice, export packing list or certificate of origin &#8211; your delivery could be found sitting at the border waiting to be released.<\/p>\n<h2>How Much is International Shipping?<\/h2>\n<p>Like with shipping times, the cost of shipping internationally can also vary widely.<\/p>\n<p>Just like when you fulfil orders domestically, the weight and size can impact the cost of shipping.<\/p>\n<p>But, with an international order, there are even more factors that can add to the price.<\/p>\n<p>Naturally, faster shipments come with a higher price as they will typically be sent via air freight. If customers are willing to wait, you will be able to reduce the cost as your courier will be able to send it via a slower and cheaper method, such as by sea freight.<\/p>\n<p>Keep in mind that longer delivery times sent via sea shipments means that your packages might be more likely to become damaged. So, pay extra attention when packaging them and consider paying extra to send very fragile items by air.<\/p>\n<p>The distance you want to ship your package will also come into play. As you would expect, the further you are sending the order, the more it will cost.<\/p>\n<h2>What is the Best International Shipping for Small Businesses?<\/h2>\n<p>So, as you can see, there are a lot of choices to be made when fulfilling international orders for your small business or growing eCommerce store!<\/p>\n<p>But, don’t let them put you off. Most courier services have calculators available for you to work out the cost of international shipping. Try and weigh up the benefits between fast delivery and cheaper delivery and consider which will be more beneficial to your customers.<\/p>\n<p>If your fulfilling international orders still gets too complicated, or is coming out too expensive, consider whether partnering with an <a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">eCommerce fulfilment<\/a> partner could be of use. As experts in logistics, they can often get you access to better value international courier services, plus advise you on the steps you need to take and ensure each order is sent via the correct delivery method.<\/p>\n<h2>What You Need to Consider When Shipping Internationally…<\/h2>\n<h3>Country specific restrictions<\/h3>\n<p>Before you go ahead and announce worldwide shipping to your audience, be sure to check whether you sell any items that are prohibited, restricted or considered dangerous in any countries. Your products might be absolutely fine to sell in the UK, but could be classed differently in other countries.<\/p>\n<p>If you ignore these restrictions, or aren’t aware of them, your orders will likely be grounded and delayed indefinitely.<\/p>\n<p>It may be that you only sell to particular countries to begin with, such as the USA or Australia, to begin testing international waters. Make this blindingly clear on your website, if you do.<\/p>\n<h3>Duty &amp; VAT fees<\/h3>\n<p>Along with the cost to actually transport your international delivery, you need to consider the cost of duty and VAT, too. Any fees that are owed will need to be paid before your customer can receive their order.<\/p>\n<p>There are two types of duty:<\/p>\n<ul>\n<li><strong>DDP (deliver duty paid)<\/strong> &#8211; the <em>seller<\/em> is responsible for paying any duty or other charges to import the delivery<\/li>\n<li><strong>DDU (deliver duty unpaid)<\/strong> &#8211; the <em>customer<\/em> is required to pay any duty or charges to have their delivery released by their domestic customs<\/li>\n<\/ul>\n<p>If you choose DDP, your courier will likely charge you a fee to cover this. Some couriers will not send items DDP.<\/p>\n<p>For shipments sent DDU, you won’t be charged, but your customer will. So, it&#8217;s important that you make it clear that they will have an extra fee to pay before they make their order, or they may become a little disgruntled and even try to cancel their order.<\/p>\n<h3>Required documentation<\/h3>\n<p>When shipping internationally, paperwork can become a real headache!<\/p>\n<p>But, if you don’t attach the correct documentation, and ensure it is completely accurate, it will become even <em>more<\/em> difficult.<\/p>\n<p>Depending on what you are shipping and the country you are sending to, the documents you need could vary. But, it is likely you will need at least a few of the following:<\/p>\n<ul>\n<li>Purchase order<\/li>\n<li>Commercial invoice<\/li>\n<li>Bill of lading<\/li>\n<li>Export packing list<\/li>\n<li>Airway bill<\/li>\n<li>Letter of credit<\/li>\n<li>Dock or warehouse receipt<\/li>\n<li>Certificate of origin<\/li>\n<li>Insurance certificate<\/li>\n<li>Export license<\/li>\n<\/ul>\n<p>You also need to check you have the correct address format for your destination to minimise any chance of you package getting lost.<\/p>\n<h3>Track your shipments<\/h3>\n<p>With your delivery travelling thousands of miles and through dozens of pairs of hands, it’s more important than ever to ensure it is tracked properly. This way, you can easily see where it’s up to if a delay occurs and reassure customers that it is on its way.<\/p>\n<h3>Communicate with customers<\/h3>\n<p>We’ve already mentioned a couple of times the importance of this, but it’s worth repeating again.<\/p>\n<p>International shipping more often than not takes longer than domestic deliveries, plus tends to cost more, too.<\/p>\n<p>Most customers will probably be understanding with this, so long as they are given a realistic timeframe and you are honest about how much it will cost.<\/p>\n<p>Include your shipping policy clearly on your website, making it obvious how long international shipping takes and whether any duty or other extra fees will need to be paid.<\/p>\n<h3 style=\"text-align: center;\">P.S – Are you thinking about expanding into international deliveries? Have a <a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\" target=\"_blank\" rel=\"noopener noreferrer\">chat with 3PL<\/a> to see how our third party logistic services can help.<\/h3>\n<p style=\"text-align: center;\"><strong>More eCommerce fulfilment advice from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\" target=\"_blank\" rel=\"noopener noreferrer\">3PL blog<\/a>…<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-to-consider-when-importing-goods-to-the-uk\/\" target=\"_blank\" rel=\"noopener noreferrer\">What to Consider When Importing Good to the UK<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/free-shipping-should-your-e-commerce-store-offer-it\/\" target=\"_blank\" rel=\"noopener noreferrer\">Free Shipping: Should Your eCommerce Store Offer It?<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/expedited-shipping-explained\/\" target=\"_blank\" rel=\"noopener noreferrer\">Expedited Shipping Explained<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For eCommerce stores, the prospect of reaching a whole new realm of customers overseas is an incredibly tempting way to expand business and add a new stream of revenue. But,&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2802,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2801"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2801"}],"version-history":[{"count":1,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2801\/revisions"}],"predecessor-version":[{"id":2804,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2801\/revisions\/2804"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2802"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}