{"id":2868,"date":"2020-11-11T16:39:39","date_gmt":"2020-11-11T16:39:39","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=2868"},"modified":"2022-05-30T14:59:30","modified_gmt":"2022-05-30T13:59:30","slug":"how-will-black-friday-be-different-for-ecommerce-retailers-in-2020","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-will-black-friday-be-different-for-ecommerce-retailers-in-2020\/","title":{"rendered":"How Will Black Friday Be Different for eCommerce Retailers in 2020?"},"content":{"rendered":"<p>Every year, retailers of every kind try to predict what form their customers’ Black Friday behaviour will take.<\/p>\n<p>But, as we all already know, 2020 is different.<\/p>\n<p>Whereas once you would have been preparing to ramp up your Black Friday strategy with confidence, it now all feels a little more like fumbling in the dark.<\/p>\n<p>Will Black Friday be transformed into an eCommerce frenzy? Or will it fizzle out without the usual in-store hype?<\/p>\n<p>To help you find your way, we’ve taken a look at some of the key changes eCommerce retailers should expect for Black Friday 2020&#8230;<\/p>\n<h2>Shoppers are set to buy online more than ever<\/h2>\n<p>This year, it’s clearer than ever before that the shift towards online spending will be significant.<\/p>\n<p>Research has suggested that there has been a <a href=\"https:\/\/modernretail.co.uk\/black-friday-2020-how-to-successfully-prepare-for-peak-in-the-face-of-uncertainty\/\" target=\"_blank\" rel=\"noopener noreferrer\">74% growth in online shopping since the Covid-19 outbreak<\/a>, with 45% of adults saying they have been receiving more parcel deliveries than they did before the lockdown.<\/p>\n<p>With Black Friday 2020 falling during <em>another<\/em> national lockdown in the UK, it’s safe to expect more sales being made online than ever before. In fact, Shopify reported that in the U.S <a href=\"https:\/\/www.shopify.com\/enterprise\/is-black-friday-dead-not-just-yet?utm_source=marketo&amp;utm_medium=email&amp;utm_content=0&amp;utm_campaign=2020-bfcm-webinar&amp;mkt_tok=eyJpIjoiTmpVME9UUTBOMlV4T1RKbCIsInQiOiJYMVlFY2hmV0RYNTdTaURiZ2FaVndXcEtMdFpRVktpSnhiTkxOTTBJRjduWDlmNGh4NFB3angzQ0xZaHZGcE9ZVTllOEFFXC83WEhQdzJac05tMGc3cHNGRjVWYWwxNHpGeFArWVhBeUZKMVJFYmRGdG1FS3Q0N3dSWWRZOEJYSHQifQ%3D%3D\" target=\"_blank\" rel=\"noopener noreferrer\">73% of shoppers plan to do more holiday shopping online<\/a>.<\/p>\n<p>As shops in the UK are still set to be closed during this peak sales period, it’s likely to be a similar story here, too.<\/p>\n<h2>However, they may be spending less…<\/h2>\n<p>Brick and mortar stores are closed and online sales are rocketing like never before.<\/p>\n<p>Surely this is only good news for eCommerce retailers?<\/p>\n<p>Not necessarily. Online stores <em>do<\/em> have the benefit of being best placed to continue fulfilling orders. But, the flip side of the closure of many businesses across the country has resulted in financial difficulties for a big portion of shoppers.<\/p>\n<p>One study revealed that <a href=\"https:\/\/internetretailing.net\/peak\/peak\/shoppers-will-be-buying-online-in-store-and-early-this-christmas-three-insights-into-peak-2020\" target=\"_blank\" rel=\"noopener noreferrer\">43% of UK adults were worried about their current financial situation<\/a>, with 40% wanting to save as much as possible for the remainder of the year.<\/p>\n<p>So, you might need to expect your customers to really consider every purchase they make. Do they really need it? Does it offer good value for money? These are the things you will need to prove to your customers this Black Friday.<\/p>\n<h2>Price, value and authenticity will be the main drivers<\/h2>\n<p>Leading on from our last point, it’s clear that price and value will be key drivers for your customers’ spending decisions.<\/p>\n<p>Even in previous years, there has been a ‘conscious consumerism’ trend among a certain type of shopper. These are the people who have been calling out companies who they see as taking advantage of shoppers, encouraging them to spend more than is needed and promoting offers that don’t actually represent good value for money.<\/p>\n<p>This year, sensitivity will be key. <a href=\"https:\/\/www.bbc.co.uk\/news\/business-52660591\" target=\"_blank\" rel=\"noopener noreferrer\">Redundancies over the last 3 months have been at record level<\/a>. It has been reported that 4.8% of the UK population is now classed as unemployed, with the Bank of England expecting this to peak at around 7.7% by June 2021.<\/p>\n<p>In 2020, brands that constantly ask their audience to buy more may be looked on unfavourably.<\/p>\n<p>If you have a strong offer that you know gives your audience great value for money, then let them know about it.<\/p>\n<p>If, however, you plan on pushing the same blanket discount as last year, you might want to rethink your strategy for 2020.<\/p>\n<h2>November will be the big month for Christmas shopping<\/h2>\n<p>Again, Black Friday for 2020 offers a drastically different retail landscape. While in previous years, customers might have been used to last minute dashes into busy stores, their behaviour is yet again predicted to change.<\/p>\n<p>This year, shoppers will have a number of new concerns they may never have faced before.<\/p>\n<p>Crowds have become off-putting as we become wary of social distancing. Having experienced delays in order fulfilment during our first lockdown, shoppers are concerned about deliveries arriving too late or stock running out completely.<\/p>\n<p>So, in 2020 it’s predicted that Christmas shopping will begin earlier than usual. A recent survey revealed that <a href=\"https:\/\/internetretailing.net\/peak\/peak\/shoppers-will-be-buying-online-in-store-and-early-this-christmas-three-insights-into-peak-2020\" target=\"_blank\" rel=\"noopener noreferrer\">40% of respondents plan on doing their Christmas shopping in November<\/a>, with just 22% planning on waiting until December.<\/p>\n<p>Because of this, many eCommerce stores are planning to release deals and offers earlier than Black Friday to cater to this new shift in spending behaviour.<\/p>\n<p>So, rather than one big weekend of sales, it’s possible we will see deals spread over a few weeks.<\/p>\n<h2>Your marketing tactics will need to be smart<\/h2>\n<p>How have your customers changed the way they interact with your brand this year?<\/p>\n<p>If you don’t know, it’s time to look into this before you put your Black Friday plans into action!<\/p>\n<p>As we have already said, shopping behaviour has changed significantly this year. So, you need to know how this has affected your brand and online store to ensure your Black Friday sales period still hits the mark.<\/p>\n<p>It could be that your social media profiles have been more active than ever. Or that your best selling products have changed. You might even have new data to help you segment your audience with.<\/p>\n<p>Review which channels and items in your inventory have been most profitable for you. And, adjust your strategy accordingly.<\/p>\n<h2>Your order fulfilment process will need to be better than ever<\/h2>\n<p>Yes, eCommerce is in for a wild ride this Black Friday period. And with even more uncertainty on the horizon, this isn’t likely to change any time soon!<\/p>\n<p>So, it is more important than ever to ensure you have an <a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\" target=\"_blank\" rel=\"noopener noreferrer\">order fulfilment process<\/a> that can handle whatever is thrown at you.<\/p>\n<p>Is your fulfilment process scaleable and able to flex to changes in demand?<\/p>\n<p>Have you organised your <a href=\"https:\/\/www.3p-logistics.co.uk\/fulfilment-warehouse\/\" target=\"_blank\" rel=\"noopener noreferrer\">warehouse<\/a> for optimum efficiency?<\/p>\n<p>Do you have multiple couriers to fall back on who offer weekend delivery?<\/p>\n<p>If not, these are the things that you should be focussing your attention on. Look at <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\" target=\"_blank\" rel=\"noopener noreferrer\">improving your order fulfilment process now<\/a> and your business will be best positioned to go from strength to strength over the next 12 months.<\/p>\n<h3 style=\"text-align: center;\">P.S, if you aren’t sure how to boost your eCommerce fulfilment process, <a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\" target=\"_blank\" rel=\"noopener noreferrer\">contact 3PL<\/a> for a chat about how third party logistics can help<\/h3>\n<p style=\"text-align: center;\"><strong>More from the <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\" target=\"_blank\" rel=\"noopener noreferrer\">3PL blog<\/a>…<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-ecommerce-stores-should-be-preparing-for-2020s-peak-selling-period\/\" target=\"_blank\" rel=\"noopener noreferrer\">How eCommerce Stores Should Be Preparing for 2020’s Peak Selling Period<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-key-advantages-of-using-a-third-party-logistics-provider\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Key Advantages of Using a Third Party Logistics Provider<\/a> | <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/heres-how-to-manage-order-fulfilment-in-a-post-coronavirus-world\/\" target=\"_blank\" rel=\"noopener noreferrer\">Here’s How to Manage Order Fulfilment in a Post-Coronavirus World<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every year, retailers of every kind try to predict what form their customers’ Black Friday behaviour will take. But, as we all already know, 2020 is different. Whereas once you&#8230;<\/p>\n","protected":false},"author":1,"featured_media":2870,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2868"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=2868"}],"version-history":[{"count":1,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2868\/revisions"}],"predecessor-version":[{"id":2869,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/2868\/revisions\/2869"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/2870"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=2868"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=2868"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=2868"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}