{"id":3039,"date":"2021-02-04T08:53:47","date_gmt":"2021-02-04T08:53:47","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3039"},"modified":"2022-05-30T14:59:30","modified_gmt":"2022-05-30T13:59:30","slug":"rethinking-returns-why-return-policies-are-vital-for-a-good-customer-experience","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/rethinking-returns-why-return-policies-are-vital-for-a-good-customer-experience\/","title":{"rendered":"Rethinking Returns: Why Return Policies Are Vital For a Good Customer Experience"},"content":{"rendered":"<p><strong>How does the word ‘returns’ make you feel?<\/strong><\/p>\n<p>If you are an online retailer, you might have shifted in your seat a little &#8211; maybe even rolled your eyes or felt that little niggle of stress?<\/p>\n<p>Returns have been seen as a plague upon eCommerce almost since it very first began.<\/p>\n<p>It’s not all bad, though. According to <a href=\"https:\/\/see.narvar.com\/rs\/249-TEC-877\/images\/State%20of%20Online%20Returns%20-%20A%20Global%20Study_Narvar%20Consumer%20Study%202019.pdf?mkt_tok=eyJpIjoiT0RNM05XUTFPR1l6T0dJMiIsInQiOiJcL3I5WHBQc29wQ0pJWFdCU25mclI0bDlXMzlFMUVJWUJtY0hcL3JZMmRLdTIxTkFxYjgzMVZ0dm9zRWNGZGdcL1NCRnJ0ZmdIcDluZnc3U2ZIOEsrbldvSXFLUnFRNCtYTWl0MGlheVRXNXBvSmhpUXczWm5RdzF2ZEdCdU1rcDVkcCJ9\" target=\"_blank\" rel=\"noopener\">Narvar’s 2019 consumer research<\/a>, 60% of shoppers worldwide said their last return was ‘easy’. Nevertheless, there is still huge room for improvement, with the same study highlighting huge areas of disconnect between what customers want and what retailers are actually offering.<\/p>\n<p>However, by shifting your perspective on how you view and approach returns, they can become a true turning point for providing the best customer experience.<\/p>\n<h2>Why are returns so important in the shopper experience?<\/h2>\n<p>All too often, returns are approached as a problem to be solved, rather than an opportunity to be embraced.<\/p>\n<p>By rethinking your returns process, it can be transformed from being a thorn in the side to one of the most valuable parts of your customer experience.<\/p>\n<p><strong>Here’s why a good returns policy is so important&#8230;<\/strong><\/p>\n<h3>Customer loyalty and retention<\/h3>\n<p>It can be disheartening to see any proportion of your product being sent back to you for a refund. But, it’s important to remember that a returned item does not mean a lost customer.<\/p>\n<p>However, a <em>bad returns experience<\/em> more than likely will result in a customer being put off from buying from you again. In fact, a recent survey of over 2,000 shoppers in the UK by Klarna revealed that a huge <a href=\"https:\/\/www.klarna.com\/assets\/sites\/3\/2019\/11\/14080024\/6310-KLA-Re-thinking-Returns_DD1-28.02.191.pdf\" target=\"_blank\" rel=\"noopener\">84% of people wouldn’t return to a retailer if they had a poor returns experience<\/a>.<\/p>\n<p>On the flipside, 78% agreed that they would buy more with a retailer over time if they offered free returns, while 39% said they would be more likely to make a purchase if they knew the returns process was simple and pain-free.<\/p>\n<p>So, establishing a customer-centric returns policy is vital in improving your number of repeat customers and preventing an excessive customer churn rate.<\/p>\n<p>A higher number of retained customers is also good news for your bottom line. The cost and amount of time it takes to acquire a new customer is only increasing.<\/p>\n<p>Trust between business and potential customers is loosening, while digital marketing is only getting more expensive with increased competition. Customer retention is more important than ever, saving you money in the long term that you can’t afford to lose out on.<\/p>\n<p>You should also consider your customer services team. If your returns policy is unclear or your customers aren’t happy with it, they may well become swamped with enquiries. While often overlooked, customer service is actually one of the most important areas of your business; they are the most personal touch point your customers will have with your brand, and can either make or break your reputation.<\/p>\n<p>Nevertheless, if your returns policy doesn’t feel fair or transparent there is little they can do other than spend their time firefighting.<\/p>\n<h3>Customer acquisition<\/h3>\n<p>When it comes to returns, the first thought that comes to mind is around existing customers.<\/p>\n<p>But, a good returns policy is more than that. It’s not just about adding value to the shopping experience, but it’s also a valuable marketing tool.<\/p>\n<p>Customers now expect to be able to return an item as cheap and easily as possible. What’s more, research by Barclays revealed that <a href=\"https:\/\/www.salecycle.com\/blog\/featured\/ecommerce-returns-2018-stats-trends\/\" target=\"_blank\" rel=\"noopener\">30% of shoppers questioned deliberately over purchased<\/a> items with the intent of sending the unwanted items back.<\/p>\n<p>This puts your returns policy in a new light when you think of it in terms of customer acquisition. It can be a tactic that sets you apart from competitors, especially if they already offer a similar product at a similar price.<\/p>\n<p>If a customer knows they can easily return an item, it takes the risk out of their purchase, while putting them in the safe knowledge that they can always try something else from your website if needed.<\/p>\n<p>Don’t forget the power of word-of-mouth, either. If you have a customer who experiences a very bad returns process, they are likely to warn their friends and family about making a purchase, too.<\/p>\n<p>If they are particularly annoyed, they could even express their unhappiness on social media or with a negative review, which can damage your reputation for a long time.<\/p>\n<h2>Why is it so hard to get returns right?<\/h2>\n<p>We’ve seen why a strong returns policy is an essential aspect of customer retention, acquisition and customer service.<\/p>\n<p>So, why do so many retailers find it hard to get it right?<\/p>\n<p>For retailers, returns can be scary. They cost money and pose logistical challenges that threaten to eat into the bottom line if not managed properly.<\/p>\n<p>One report suggested that while up to 10% of instore purchases are returned, this increases to <a href=\"https:\/\/www.cnbc.com\/2019\/01\/10\/growing-online-sales-means-more-returns-and-trash-for-landfills.html\" target=\"_blank\" rel=\"noopener\">between 15% and 40% for purchases made online<\/a>. In several years, some predictions have even valued the cost of returns will reach a trillion dollars, while others have claimed that some retailers end up throwing away over 25% of returned items.<\/p>\n<p>This is bad both for businesses and the environment.<\/p>\n<p>As a result, top retailers are having to think of new ways to keep up with the landslide of returns coming their way.<\/p>\n<p>It’s an issue that reached new levels of urgency in 2020 during the global lockdowns of the Covid-19 pandemic. Research by Royal Mail found that <a href=\"https:\/\/www.cnbc.com\/2019\/01\/10\/growing-online-sales-means-more-returns-and-trash-for-landfills.html\" target=\"_blank\" rel=\"noopener\">returns in the UK increased by 25% in July 2020<\/a> compared to the previous year as shoppers turned online to make their purchases.<\/p>\n<p>This sudden change in behaviour served to highlight the weaknesses in returns policies and reverse logistics. Retailers should act now to improve this process, whether they seek the help of a <a href=\"https:\/\/www.3p-logistics.co.uk\/\" target=\"_blank\" rel=\"noopener\">third party logistics provider<\/a> or address their issues internally.<\/p>\n<h2>5 Ways to Improve Your Returns Policy<\/h2>\n<h3>1. Look at your returns window<\/h3>\n<p>Do you offer a standard 30 days for you customers to return an item to you?<\/p>\n<p>This is expected as the minimum in the UK as returns are covered by the Consumer Rights Act. Other countries are not so generous, with many stores in the USA requiring returns within just 7 days to receive a refund.<\/p>\n<p>First of all, you always want to make sure your returns policy abides by any consumer rights laws within the country you are trading.<\/p>\n<p>Then, think about whether your customers will find this long enough. For big or expensive purchases, they might appreciate a little extra time to familiarise themselves with their new item. Again, this can be a big draw in acquiring new customers, especially if you know very few customers actually do send the product back.<\/p>\n<p>Some retailers are going either further with their returns windows. For example, <a href=\"https:\/\/www.ikea.com\/ca\/en\/customer-service\/returns-claims\/\" target=\"_blank\" rel=\"noopener\">IKEA famously gives a full 365 days for customers to change their mind<\/a>.<\/p>\n<p>A lot of brands offer a ‘trial’ period with a guaranteed refund if they aren’t happy. Beauty website <a href=\"https:\/\/www.feelunique.com\/try-me\" target=\"_blank\" rel=\"noopener\">Feel Unique offers a ‘Try Me’ service<\/a>, sending out a sample along with a full sized product. Customers can then test it out before opening the bottle, allowing them to return it if they decide it isn’t for them.<\/p>\n<h3>2. Consider the language you use in your returns policy<\/h3>\n<p>Even if you find returns are a pain point for your business, you customer shouldn’t feel that way.<\/p>\n<p>Review your returns policy page on your website and put yourself in the customer’s shoes. How does it make you feel? Are you reading off a list of rules to be obeyed? Or, do you feel as though your business understands that returns are important to you?<\/p>\n<p>Words and phrases like ‘you must’ and ‘we are not responsible’ will be immediate turn-offs.<\/p>\n<p>Instead, use phrases such as ‘we hope you love your item’ and ‘we understand’ to build up a relationship of trust.<\/p>\n<p>Choosing the right language when writing a returns policy is key. You want to reassure your customer that you want them to love their item. But, you also need to show that you are aware that it might not be quite right for them &#8211; or that they might simply change their mind.<\/p>\n<p>Make it transparent and genuine, too. Don’t over complicate, use jargon or worse &#8211; just copy and paste it from Google. Use your brand’s tone of voice and create an opportunity to connect with your customers. Including some positive testimonials from existing customers here is a good way to prove that others have had a great experience with your brand.<\/p>\n<h3>3. Shout about your returns policy<\/h3>\n<p>As we have already mentioned, your returns policy isn’t just about keeping existing customers happy. It’s also a chance for you to impress new potential customers.<\/p>\n<p>According to UPS, <a href=\"https:\/\/www.ups.com\/us\/en\/services\/knowledge-center\/article.page?kid=art16e12c5bc15\" target=\"_blank\" rel=\"noopener\">68% of shoppers check the return policy on a website<\/a> before making a purchase.<\/p>\n<p>So, if you have a policy that sets you above your competitors, then make sure you advertise it. As a standard, it should have it’s own landing page. But, to get the most out of it, highlight your returns USPs on banners across your website.<\/p>\n<p>Even better, include a link to it on your order confirmation emails. It might seem counterintuitive to think about returning an item before it’s even been shipped. But, it shows you are transparent and are putting your customer’s experience and needs before your own.<\/p>\n<h3>4. Make it easy for your customer<\/h3>\n<p>When eCommerce stores were first grappling with the returns process, it probably wasn’t uncommon for customers to have to print their own label off, package up the item themselves and pay for the postage.<\/p>\n<p>Today, more and more retailers are aware of the importance of returns for their customers’ shopping experience. As a result, free returns and pre-printed labels are now expected as the norm.<\/p>\n<p>Other online retailers are going the extra mile and defining the future of returns. This year, <a href=\"https:\/\/www.asos.com\/men\/fashion-feed\/2020_02_3-mon\/how-to-do-paperless-returns\/\" target=\"_blank\" rel=\"noopener\">ASOS announced their commitment to paperless returns<\/a>, responding to their largely Millenial and Gen-Z audiences’ concerns around the impact of their shopping on the environment.<\/p>\n<p>Not only does this align the brand with their customers values, but makes the whole returns experience even easier.<\/p>\n<p>Their already tech-savvy customers simply need to log onto their ASOS app. There, they can record their return, choose from a wide range of courier and drop-off options and track its progress. Customers can even have their return picked up from their own front door, an option that no doubt proved popular during mass working from home in 2020.<\/p>\n<p>This would have been a huge logistical and technological achievement from ASOS. So, does it work? Despite <a href=\"https:\/\/www.businessinsider.com\/asos-posted-revenue-upwards-1-billion-boohoo-posted-higher-growth-2020-7?r=US&amp;IR=T\" target=\"_blank\" rel=\"noopener\">reporting over $1 billion revenue between May and June of 2020<\/a>, UK sales were down.<\/p>\n<p>During this period, the brand’s trademark next-day delivery was suspended and orders were delayed by weeks. So, could this suggest that ASOS really does owe its success to it’s market leading delivery and returns policies?<\/p>\n<h3>5. Ask <em>why<\/em> you are getting returns<\/h3>\n<p>Returns are a natural part of running any retail business. It’s <em>incredibly<\/em> rare to not receive any requests for refunds or exchanges.<\/p>\n<p>However, this doesn’t mean you shouldn’t question why your customers are sending items back.<\/p>\n<p>An excessive number of returns could be an indication that something else in your customer’s experience isn’t quite right.<\/p>\n<p>Fashion is an excellent example of this. Infamous for being the industry with one of the highest return rates, customers order items to try on in their own homes. If they don’t fit or suit the wearer, they are swiftly sent back.<\/p>\n<p>This is a key aspect of the customer journey that fashion retailers are now working on improving. Showing clothing on more diverse models, providing accurate sizing guides and including videos are just the beginning.<\/p>\n<p>In another move motivated by the lockdowns of 2020, a growing number of retailers are experimenting with virtual reality to allow customers to better visualise the clothes on themselves before buying them.<\/p>\n<p>According to Zeekit, who have developed the technology behind this, the service has already <a href=\"https:\/\/www.businessinsider.com\/retailers-like-macys-adidas-are-turning-to-virtual-fitting-rooms-2020-8?r=US&amp;IR=T\" target=\"_blank\" rel=\"noopener\">helped reduce return rates by 36%<\/a>.<\/p>\n<p>This is not only great news for the retailers who can minimise the number of returns they need to process. It also fixes a major pain point for the customer, too, improving their online shopping experience.<\/p>\n<h2>It’s time to rethink returns<\/h2>\n<p>If there is anything you can learn or takeaway from this article, it’s this &#8211; stop seeing returns as a problem.<\/p>\n<p>A returns policy is a huge opportunity for your retail business, offering the chance for you to improve customer relationships, entice in new shoppers and even give you incredibly valuable insights into your customer’s journey.<\/p>\n<p>The past year has shown us that times really are changing. Online retail is a big part of this shift, which means returns are only going to become a bigger part of your customer’s lives. Act now and you are sure to begin reaping the benefits in the future.<\/p>\n<h3 style=\"text-align: center;\">P.S, if you need help with your returns process, <a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\" target=\"_blank\" rel=\"noopener\">contact 3PL<\/a> for a chat about, how we could help<\/h3>\n<p style=\"text-align: center;\"><strong>Find more eCommerce &amp; order fulfilment advice on our blog&#8230;<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-best-manage-returns-for-your-e-commerce-store\/\" target=\"_blank\" rel=\"noopener\">How to Best Manage Returns For Your eCommerce Store<\/a><\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-improve-your-shipping-process-make-it-your-competitive-advantage\/\" target=\"_blank\" rel=\"noopener\">How to Improve Your Shipping Process &amp; Make it Your Competitive Advantage<\/a><\/strong><\/p>\n<p style=\"text-align: center;\"><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\" target=\"_blank\" rel=\"noopener\">5 Ways to Improve Your Order Fulfilment Process<\/a><\/strong><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How does the word ‘returns’ make you feel? If you are an online retailer, you might have shifted in your seat a little &#8211; maybe even rolled your eyes or&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3040,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3039"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3039"}],"version-history":[{"count":1,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3039\/revisions"}],"predecessor-version":[{"id":3042,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3039\/revisions\/3042"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3040"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3039"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3039"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3039"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}