{"id":3139,"date":"2021-02-25T17:10:30","date_gmt":"2021-02-25T17:10:30","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3139"},"modified":"2022-05-30T14:59:30","modified_gmt":"2022-05-30T13:59:30","slug":"inventory-valuation-methods-your-ecommerce-store-needs-to-know","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/inventory-valuation-methods-your-ecommerce-store-needs-to-know\/","title":{"rendered":"Inventory Valuation Methods Your eCommerce Store Needs to Know"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">If your eCommerce store has seen consistent order demand for one of your products, yet you’re starting to see a dip in profits associated with that product, you might have an issue with your inventory valuation method. Here are the inventory valuation methods your eCommerce store needs to know.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2><span style=\"font-weight: 400;\">What is inventory valuation?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Inventory valuation is the way an eCommerce store calculates how much its inventory is worth at the end of the financial year (or accounting period).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With inventories often being the largest current asset of eCommerce stores, inventory valuation is a crucially important part of maintaining accurate financial records. Using proper inventory valuation methods will allow you to calculate the Cost of Goods Sold (COGS), and your overall profitability.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re running an eCommerce store and you’re not undertaking inventory valuation then it’s unlikely you are properly measuring your expenses and revenue and you could be on the road to making some costly business decisions.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2><span style=\"font-weight: 400;\">What does inventory valuation aim to achieve?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Let’s start off with a definition. Inventory simply refers to the goods meant for sale (or unsold goods). In eCommerce, inventory refers to the goods you have in stock ready for sale.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">That’s the definition. Next, let’s take a look at what inventory valuation aims to achieve.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Perhaps the most important objective is determining the gross profit of your eCommerce business.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Determining gross profit<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Gross profit (sometimes also known as gross income) is the excess of sales over costs of goods sold. Over the course of an accounting year, gross profit is determined by matching the cost of goods sold with the revenue. This can summarised in a handy formula:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Gross Profit = Revenue &#8211; Cost of Goods Sold.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Using this formula, you can see how inventory value will impact your gross profit. For example, if your eCommerce store had net sales of £1,000,000 during the previous accounting year, and the cost of goods sold was £800,000, then your gross profit was £200,000 and your gross profit margin was 20%.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, if the cost of goods sold changes part of the way through that financial year, then this will change your gross profit &#8211; hence the importance of inventory valuation.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Determining your financial position<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">A broader metric than gross profit, but using inventory valuation to determine your financial position should be another important consideration for eCommerce stores. At the end of the financial year (or accounting period) your closing stock (in other words, stock that hasn’t been sold yet) will be classed as a current asset. The value of this stock will determine the financial position of your eCommerce store.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3140\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-scaled.jpg\" alt=\"Inventory Valuation should be an integral part of your eCommerce business\" width=\"2000\" height=\"1333\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-scaled.jpg 2000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-1024x683.jpg 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-768x512.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-1536x1024.jpg 1536w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-2048x1365.jpg 2048w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-Valuation-should-be-an-integral-part-of-your-eCommerce-business-900x600.jpg 900w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" \/>Choosing your inventory valuation account system<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Having defined what inventory valuation <\/span><i><span style=\"font-weight: 400;\">is, <\/span><\/i><span style=\"font-weight: 400;\">it’s time to look at <\/span><i><span style=\"font-weight: 400;\">how <\/span><\/i><span style=\"font-weight: 400;\">you can go about carrying out an inventory valuation for your eCommerce business. The first thing to consider is the type of <\/span><b>inventory valuation accounting system<\/b><span style=\"font-weight: 400;\"> you will use.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are two main types of inventory valuation accounting systems.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Perpetual inventory valuation<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">A perpetual inventory valuation accounting system allows you to show the amount of inventory you have on hand <\/span><i><span style=\"font-weight: 400;\">at all times. <\/span><\/i><span style=\"font-weight: 400;\">Every time a piece of stock is added or removed from your inventory, your accounting records are updated. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When recording sales, a perpetual accounting system uses an extra entry to debit the Cost of Goods Sold as well as crediting the merchandise inventory. By recording the Cost of Goods Sold for each sale, a perpetual accounting system reduces the need to adjust entries and calculations of goods sold at the end of the financial year (or your accounting period).<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Periodic inventory valuation<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In a periodic inventory valuation accounting system, each sale is recorded as it occurs, <\/span><i><span style=\"font-weight: 400;\">but your inventory is not<\/span><\/i><span style=\"font-weight: 400;\">. Instead, your inventory is updated at the end of the financial year (or your accounting period) to determine the cost of goods.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Which one is right for you? It very much depends on the nature of your eCommerce business.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For the majority of eCommerce businesses, where maintaining an accurate record of your inventory (and its value) is of critical importance, the perpetual inventory valuation accounting system is the preferred option. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To help you decide if this is the correct system for you, we’ve listed some of the advantages and disadvantages.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Advantages of a perpetual inventory valuation accounting system<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Real time information. <\/b><span style=\"font-weight: 400;\">By its very nature, a perpetual inventory valuation accounting system provides you with real time information as to the value of your inventory. This means you can keep a track of the profitability of various items within your inventory. This accounting system will also help you monitor things like stock levels, ensuring you never run out of a popular item.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Manage multiple locations easily.<\/b><span style=\"font-weight: 400;\"> If your eCommerce company’s inventory is located in different places, then a perpetual inventory valuation accounting system will help you keep a better track of each location. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Improved forecasting.<\/b><span style=\"font-weight: 400;\"> A perpetual accounting system will help you better understand the varying profitability of certain items and lines over time. This can also help you manage your stock levels, ordering more stock at times of the year when it is more profitable to do so. Aside from the financial metrics, a perpetual accounting system will also help you better understand the purchasing habits of your customers.<\/span><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Disadvantages of a perpetual inventory valuation accounting system<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Cost. <\/b><span style=\"font-weight: 400;\">Whilst perpetual accounting systems deliver many benefits, this comes at a cost; a literal one. Perpetual inventory valuation accounting involves many ‘moving parts’ such as software, barcodes scanners, and staff training and the costs associated with these can soon add up.<\/span><\/li>\n<\/ul>\n<p><b>If you do choose to use a perpetual accounting system for your inventory valuation, then continue reading to discover the best inventory valuation <\/b><b><i>methods<\/i><\/b><b> for putting a perpetual system into action.<\/b><\/p>\n<h2><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3141\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-scaled.jpg\" alt=\"The top inventory evaluation methods for your eCommerce store\" width=\"2000\" height=\"1335\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-scaled.jpg 2000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-1024x683.jpg 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-768x513.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-1536x1025.jpg 1536w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-2048x1367.jpg 2048w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/02\/Inventory-evaluation-methods-900x600.jpg 900w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" \/>Top inventory valuation methods for your eCommerce store<\/span><\/h2>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Specific identification method<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you’re an eCommerce store that carries a wide range of very different products, which all have varying degrees of value, then the specific identification method may be the best way of managing your inventory valuation. It works by tracking every single item in stock <\/span><i><span style=\"font-weight: 400;\">individually <\/span><\/i><span style=\"font-weight: 400;\">from the moment it arrives in your inventory, to the moment it leaves.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This method not only tracks each item individually, but also assigns a cost individually to each item.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Advantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The specific identification method has a number of advantages, the most pertinent of which is its accuracy. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">By tracking individual items (and their values), this method has a very high level of accuracy and allows you to calculate the value of your inventory in income or profit. The specific identification method also virtually eliminates the chances of losing or misplacing inventory.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Disadvantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Although justifiably prized for its accuracy, the specific identification method may not be suitable for all companies due to the complexity of the processes involved. You see, the specific identification method requires your eCommerce business to have the ability to easily and consistently identify all the individual items within your inventory and track their cost. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This requires the ability to attach the cost of the item (and the amount received for the sale of the item) to the item using a unique identifier. This can be incredibly difficult to achieve if you have a very large inventory.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Weighted average cost (WAC)<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The WAC method of inventory valuation determines the amount that goes into Cost of Goods Sold and inventory by using a weighted average. This method is sometimes also known as the average cost method. Under a perpetual inventory valuation accounting system WAC can also be referred to as the ‘moving average cost method’.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The WAC method of inventory valuation is calculated using the following formula:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Cost of goods available for sale \/ Total units in your inventory.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Advantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">If your eCommerce store is one that has a high volume of items in your inventory that are all the same (or very similar) then the WAC method will work well for you. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if you sell denim jeans (with different colours and sizes in stock) and you charge the same price for whatever colour\/size combination a customer chooses, then you can use one value for your inventory. Alternative valuation methods will require you to work out and apply multiple inventory values.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Disadvantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">As the above paragraph makes clear, the WAC method doesn’t really work for businesses whose inventories carry lots of wildly different (and differently priced) items. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another potential drawback of the WAC method centres on the fluctuation of your material costs. If your costs recently went up, but you’re still calculating your prices based on a standard markup of COGS, your pricing will no longer reflect the actual cost of an item and you’ll make a loss.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">First-In, First-Out (FIFO)<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Under the FIFO method you must be prepared to make an assumption; that the first items to be added to your inventory will be the first item sold (and so on). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To provide an example of how the FIFO method works, imagine that you’ve just bought 100 keyrings for your eCommerce store at a cost of £10 per item. You then decide to buy another 100 keyrings for your eCommerce store, but the cost has risen to £15 per item. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Under the FIFO method, the first 100 keyrings sold would be assigned the cost of £10. After the first 100 keyrings have sold, any subsequent keyrings sold would be assigned the cost of £15.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Advantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The FIFO method is popular amongst eCommerce businesses as it’s simple and logical; the cycle of goods runs from oldest to newest. FIFO can also help prevent your inventory from becoming obsolete, with the oldest items of stock being the first to be sold.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Disadvantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Under the FIFO method it can be difficult to gain an accurate valuation of your inventory during periods of inflation when your production costs may increase significantly. For example, if the cost of your product doubles, but your accountants are using values from months or even years ago, then your profits will take a hit.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-weight: 400;\">Last-In, First-Out (LIFO)<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In opposition to FIFO, the LIFO method is based on the assumption that the goods that have been added to your inventory most recently, will be the first to be sold. Under this method, the cost of the most recent goods purchased (or manufactured) are the first to be expensed as cost of goods sold.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To understand what the LIFO method looks like in ‘real life’, let’s consider an example. If you bought a batch of denim jeans in December 2020 at a cost of £50 per item, and then bought another batch of the same denim jeans in February 2021 at a cost of £40 per item, your accounts will make the assumption that you sold the lower-cost February denim jeans first.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Before you rush to start using this method however, you should be aware that it is only used in the US.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Advantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The primary advantage of LIFO is that it can yield tax advantages for your business. During times of inflation, LIFO can result in a higher cost of goods sold and lower balance of remaining inventory. A higher cost of goods sold will result in a lower net income, which equals a lower tax liability.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>Disadvantages<\/b><\/p>\n<p><span style=\"font-weight: 400;\">For many businesses, the prospect of selling new inventory before older inventory is not a particularly appealing prospect. Doing so can leave you with obsolete or spoiled inventory (this is especially a concern for industries such as Fast Moving Consumer Goods (FMCG)).<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">These are the four most common and popular methods for inventory valuation. Choosing the right one can have an enormous impact upon the success and profitability of your eCommerce store. <\/span><\/i><\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: center;\"><span style=\"font-weight: 400;\">If you’d like to find out more about the different inventory valuation methods available for your business, <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\"><span style=\"font-weight: 400;\">speak to 3PL today<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/h2>\n<p style=\"text-align: center;\"><b>Find more advice for your eCommerce business on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/inventory-turnover-ratio-what-is-it-how-to-calculate-it\/\"><b>Inventory Turnover Ratio: What It Is &amp; How to Calculate It<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\"><b>5 Ways to Improve Your Order Fulfillment Process<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-work-out-the-cost-per-order-of-your-ecommerce-store\/\"><b>How to Work Out the Cost Per Order of Your eCommerce Store<\/b><\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If your eCommerce store has seen consistent order demand for one of your products, yet you’re starting to see a dip in profits associated with that product, you might have&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3144,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3139"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3139"}],"version-history":[{"count":4,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3139\/revisions"}],"predecessor-version":[{"id":3147,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3139\/revisions\/3147"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3144"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3139"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3139"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3139"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}