{"id":3217,"date":"2021-04-16T09:01:01","date_gmt":"2021-04-16T08:01:01","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3217"},"modified":"2022-05-30T14:59:30","modified_gmt":"2022-05-30T13:59:30","slug":"what-is-dead-stock-and-how-to-deal-with-it","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-dead-stock-and-how-to-deal-with-it\/","title":{"rendered":"What Is Dead Stock and How to Deal With It"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">In today’s fast-moving eCommerce environment it’s vital to stay on top of your inventory &#8211; and by extension your warehouse space &#8211; to maintain efficiency and profitability. But there’s something that can hamper that; dead stock. <\/span><b><i>Read on to find out more about dead stock and how to deal with it. <\/i><\/b><\/p>\n<h2><span style=\"font-weight: 400;\">What is dead stock?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Dead stock (often also called dead inventory) refers to any unsold items or products that have been sitting in your warehouse for a long period of time <\/span><i><span style=\"font-weight: 400;\">and are unlikely to sell in the future<\/span><\/i><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Dead stock has never been sold to a customer, so returned items are not classed as dead stock. Instead, we’re referring to brand new items which for lack of demand or expired seasonality (for example, a t-shirt emblazoned with NYE 2020), are gathering dust in your warehouse and costing you money. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">That’s right, If you have dead stock, then it’ll be costing you money. Why? Because if you’re unable to recoup the cost of manufacturing or buying an item (by selling it), then that’s wasted capital that you could be spending on other, more profitable, products. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Dead stock also costs you in terms of warehouse space. Dead stock takes up space which could instead be used to house more of your top-selling, fast-moving products. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to being unable to stock more of your best selling items, dead stock also accumulates storage costs over time. These ‘holding costs’ include the cost of leasing your warehouse, utilities, insurance and more. According to a report by <\/span><i><span style=\"font-weight: 400;\">Industrial Distribution, <\/span><\/i><span style=\"font-weight: 400;\">some businesses pay more than 30% of an item&#8217;s value in holding costs alone. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, it pays to deal with your dead stock…<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What are the causes of dead stock?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Why do many eCommerce businesses end up with dead stock? Answering this question can help you avoid building up dead stock in the first place, so let’s take a look at some of the most common causes for the accumulation of dead stock<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Poor sales<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">It’s an obvious reason for dead stock, but it’s one that’s important to address.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Poor sales can happen for a variety of reasons. For example, your target market might not like the product; because it’s out-of-fashion, it’s too expensive (or cheap), or because a competitor has released a more appealing version of your product. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re suffering from poor sales, then you may need to go back to the drawing board and interrogate your market research. Flawed market research is often the root cause of poor product sales. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Defects<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Naturally, no one wants defective products in the first place, but unfortunately they can slip through the net and result in bad word-of-mouth, bad-reviews and more. All of which will hurt sales. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can tackle the issue of defects by introducing quality checking standards as part of your inventory process. These quality standards could include:<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Product specifications <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">If you’re ordering items from a supplier, you can set out product specifications that stipulate the standards, dimensions and functions of a particular product. By checking new stock against your product specifications, you can quickly and easily detect defects and prevent them becoming dead stock (or being sent to customers).<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Packaging requirements<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Introduce packaging requirements as these can help keep your products safe and secure and less likely to get damaged. You should set packaging standards with parameters such as quality of material, type of material and colour.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Accepted Quality Limit (AQL)<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Another step you can take to reduce the number of defective products that make it into your inventory is to introduce an Accepted Quality Limit or AQL. An AQL sets the maximum number of defective items that you will accept in a single batch of items picked randomly. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Instead of checking the entire batch of your latest products, you take a statistically significant sample &#8211; check it for defects &#8211; and then accept or reject <\/span><i><span style=\"font-weight: 400;\">the entire <\/span><\/i><span style=\"font-weight: 400;\">batch based on your assessment of that sample. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if you have received 100 printed t-shirts from a supplier, for your AQL analysis you should examine 10 of the t-shirts. If you have set your AQL at 3, it means you’ll only accept the entire batch if there are <\/span><i><span style=\"font-weight: 400;\">no more than <\/span><\/i><span style=\"font-weight: 400;\">3 defective items in the sample. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Ordering inconsistencies<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Ordering inconsistencies are another leading reason for the accumulation of dead stock. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re ordering too many items at once, or ordering items at the wrong time, then you’ll be increasing the likelihood that you’ll end up with dead stock. If your order process needs some ‘fine-tuning’ then consider incorporating some simple calculations such as Reorder Point, Economic Order Quantity (EOQ) or Inventory Turnover Ratio. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">These calculations can help you improve specific areas of your order management process. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Let’s take a look at each one in turn.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Reorder Point<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">The Reorder Point formula is based on the number of items you have in stock (often referred to as safety stock), calculated against demand during lead time. The formula is usually presented as:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Reorder Point = Demand during lead time + safety stock.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Using this formula you’ll know at which level of stock you should place your next order so that you don’t run out of items or end up with too many in your warehouse. If you’re not too sure what demand during lead time or safety stock means, keep reading. <\/span><\/p>\n<h5><span style=\"font-weight: 400;\">Demand during lead time<\/span><\/h5>\n<p><span style=\"font-weight: 400;\">Demand during lead time is the number of days between you placing a purchase order with your supplier and receiving the products. To calculate demand during lead time just multiply the lead time (in days for a product) by the average number of units sold each day:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Lead time demand = lead time x average daily sales.<\/span><\/p>\n<h5><span style=\"font-weight: 400;\">Safety stock<\/span><\/h5>\n<p><span style=\"font-weight: 400;\">As well as knowing the average demand for a product, you should also calculate how much safety stock you may need in case of a sudden surge in demand. Think of safety stock as being some extra stock that you hold ‘just in case’. The formula for figuring out safety stock is:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Safety stock level = (max daily orders x max lead time) &#8211; (average daily orders x average lead time). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Figuring out your reorder point formula for your key items will go a long way towards tackling ordering inconsistencies and, by extension, dead stock. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Economic Order Quantity<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Another way of reducing ordering inconsistencies is with the Economic Order Quantity (EOQ) formula. The EOQ helps you figure out the ideal quantity of products you should order to minimise inventory costs such as holding costs, storage costs etc. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The formula for figuring out your Economic Order Quantity is as follows:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Economic Order Quantity (EOQ) = demand x order cost \/ holding cost. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Be aware that the calculation of your EOQ will be based on a number of assumptions. An EOQ formula assumes that your demand will remain constant throughout the year (for example, it doesn’t factor in seasonality), it also assumes that your holding and ordering costs remain constant. Finally, the EOQ formula doesn’t take into account any supplier discounts that you may receive. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, if you are comfortable with those assumptions, EOQ offers another great way of reducing those ordering inconsistencies that can result in dead stock. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3218\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/04\/How-to-deal-with-dead-stock-eCommerce-store-min.jpg\" alt=\"Dead stock can cause real headaches for eCommerce stores, but there are plenty of ways to deal with it!\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/04\/How-to-deal-with-dead-stock-eCommerce-store-min.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/04\/How-to-deal-with-dead-stock-eCommerce-store-min-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/04\/How-to-deal-with-dead-stock-eCommerce-store-min-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/>How to deal with dead stock<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">So far, we’ve looked at what dead stock is, and the causes of dead stock (along with some ways to tackle those causes), but what if you end up with some dead stock or you already have some? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Don’t worry, the team at 3PL has set out some great ways of dealing with dead stock below.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Clearance sales<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Clearance sales are a classic way of dealing with dead stock. And, they’re a classic because they work.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Host a clearance event on your eCommerce store where you list all of your dead stock on your website. Give it a marketing push and make a big point about the discounts and you could soon find eager bargain hunters snapping up your dead stock. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Yes, you may not achieve the profit margin you had originally hoped for when you stocked the products initially, but you’ll free up space in your warehouse for faster-selling items, plus you’ll eliminate any future holding costs associated with the continued storage of your dead stock. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Product bundles<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Why not group your dead stock products with other, more popular, products? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Creating product bundles can be a great way of shifting dead stock, whilst also increasing the perceived value of an order. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But, for product bundles to work effectively, you should give them some thought. For example, you’ll want the products in your bundles to be of a similar theme e.g. a dead stock hat goes with a popular t-shirt. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As with clearance sales, product bundles may reduce the profit margin you were hoping to originally achieve for what is now dead stock (the bundled price is usually lower than the total price if the shopper purchased each item separately), but it does have the benefit of freeing up warehouse space and eliminating future holding costs. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Offer a free gift with purchases<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Giving away your dead stock for free may sound extreme (and it’s certainly not suitable for every eCommerce store), but it may work for you.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A free gift promotion is a great way of attracting new and repeat customers to your store. It can be a really effective marketing tactic. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Don’t just take our word for it. A study in the <\/span><i><span style=\"font-weight: 400;\">Journal of Marketing <\/span><\/i><span style=\"font-weight: 400;\">found that consumers value ‘free’ more than ‘discounted’. In the study customers in a coffee shop were offered either a 33% discount on their coffee, or 33% more coffee for free. You guessed it, the free option won out… (even though the 33% discount was actually a better deal!)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To improve the value of your free gift campaign, you can add a minimum purchase limit, which can help to offset some of the losses associated with giving away your dead stock for free.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can also offer a free gift as a surprise. Throw in the gift with an order and you’ll delight your customer, creating a positive experience and building brand loyalty. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Return dead stock to your supplier<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This is not always feasible, but depending on the product you may be able to reach out to your supplier to see if you can return your dead stock. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When thinking about returning dead stock to your supplier, there are a few important things to take into account:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your supplier may not be willing to offer a full refund. Instead, they may only be willing to repurchase the stock at a discounted price (if at all).<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You will probably have to pay a restocking and shipping fee.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your supplier may offer you a credit rather than a refund. If they don’t have other products that you think will sell well, then that could be a problem. You don’t want to return a product for a product which will also become dead stock!<\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Consider forming a partnership<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Do you have existing relationships with other retailers, eCommerce stores or brands? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If so, you could consider forming a partnership as a way of shifting dead stock. Co-branded product bundles are becoming more popular. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You could also partner with a brick and mortar store and hold a co-branded ‘garage sale’ where you jointly sell dead stock. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Donate your dead stock<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As with some of the other suggestions in this article, this is not necessarily suitable for all eCommerce stores and\/or products, but making a donation can be another good way of dealing with dead stock.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Consumers are increasingly concerned about the ethical and environmental impact of their purchases. Many of them want to buy from companies that actively contribute to social, economic and environmental causes. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Donating dead stock could potentially be a great way of boosting your brand’s reputation in the realm of Corporate Social Responsibility (CSR). That’s important because, according to a recent study, more than half of all consumers are willing to pay more to shop at a store that demonstrates good CSR.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Donations can be a particularly good tactic for retailers of apparel or consumables, where clothing and personal hygiene items are easy to donate to charity partners. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Consider wholesale, closeout and liquidation options<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you don’t want the hassle of shifting dead stock yourself, you could approach a wholesale, closeout or liquidation specialist. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Companies such as closeout specialists will buy your product in bulk and resell in their own shops at a discount price. If you have a lot of apparel and home goods that you are looking to move, then consignment\/second-hand shops are a good option. They sometimes also buy in bulk and may be willing to take your dead stock off your hands (for a discounted price). <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Could your dead stock be a hidden gem?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Before you start getting rid of your dead stock, it can pay to check the availability of the products you’re looking to move. If you find you are sitting on a pile of products that are no longer widely available, then you could in fact be sitting on a goldmine. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Popular dead stock items tend to be things like trainers or vintage apparel. People are willing to pay huge sums of money for things like editions of Nike Jordans which have long gone out of production. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Before you get rid of your dead stock, make sure it’s not highly sought after first!<\/span><\/p>\n<p><b>We hope you’ve found our guide to dead stock useful. If you want to tackle dead stock in your eCommerce store and prevent it happening in future, talk to a quality third party fulfilment provider. <\/b><b><i>Talk to 3PL<\/i><\/b><b>.<\/b><\/p>\n<h2 style=\"text-align: center;\"><span style=\"font-weight: 400;\">Want to know more about how to deal with dead stock? <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\"><span style=\"font-weight: 400;\">Contact 3PL<\/span><\/a><span style=\"font-weight: 400;\"> today for some friendly, expert advice.<\/span><\/h2>\n<p style=\"text-align: center;\"><b>Read more advice for your eCommerce store on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/inventory-turnover-ratio-what-is-it-how-to-calculate-it\/\"><b>Inventory Turnover Ratio: What Is It &amp; How to Calculate It<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/do-i-need-a-specialist-fulfilment-centre-for-my-product\/\"><b>Do I Need a Specialist Fulfilment Centre for My Product?<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-kitting-and-assembly\/\"><b>What Is Kitting and Assembly?<\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In today’s fast-moving eCommerce environment it’s vital to stay on top of your inventory &#8211; and by extension your warehouse space &#8211; to maintain efficiency and profitability. But there’s something&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3221,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3217"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3217"}],"version-history":[{"count":4,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3217\/revisions"}],"predecessor-version":[{"id":3224,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3217\/revisions\/3224"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3221"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}