{"id":3252,"date":"2021-05-10T16:47:49","date_gmt":"2021-05-10T15:47:49","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3252"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"how-to-pick-the-best-shipping-company-for-your-ecommerce-store","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-pick-the-best-shipping-company-for-your-ecommerce-store\/","title":{"rendered":"How to Pick the Best Shipping Company for Your eCommerce Store"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">You’ve just had another great week of sales at your eCommerce store. Great! But now you’ve got to get those items to your customer. You need to get them delivered quickly, and you need to get them delivered in one piece. If you’re sick and tired of handing over your products to postal companies that don’t ‘deliver’, then <\/span><b><i>read 3PL’s complete guide to picking the best shipping company for your eCommerce store<\/i><\/b><span style=\"font-weight: 400;\">. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why you need to use a shipping company<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are many reasons why you should use a shipping company, but perhaps the most important reason is customer satisfaction (or lack of it). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Thanks to companies such as Amazon offering next day (or even within the hour) delivery, consumer expectations have changed when it comes to the fulfilment of their online orders.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here are some eye-opening stats about the importance of getting your fulfilment right:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">55% of consumers will switch to a competing retailer\/brand if it offers a faster delivery service.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">82% of satisfied customers have shared positive delivery experiences with friends and family. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">44% of millennials have an Amazon Prime membership.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">According to research by UPS, 71% of online buyers rate free shipping as a top consideration at the time of purchase.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">41% of consumers told research firm IMRG that they abandoned a purchase due to a lack of convenient delivery options in the last year.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">We could go on…<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whichever way you look at it, you need to get your shipping right or risk losing out to competitors, damaging your reputation and reducing the likelihood of future purchases.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, what do you need to consider when selecting a shipping\/fulfilment partner?<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Profile your product<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Before you start Googling away and contacting shipping providers, you start by analysing what sort of delivery process your product requires. Undertake a full profile of your product, asking (and answering) as many questions you can that may influence what type of delivery your product will require:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Is your product fragile? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Is it mass-produced or is it a bespoke custom product? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do you manufacture your products yourself or do you obtain them from a supplier?<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">How heavy is your product? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Is it time-sensitive (e.g. is it a food item or medicine)? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">What volume of products do you sell (do you sell hundreds of products per week or thousands)? <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Interrogating your product’s delivery requirements will help you to rule out certain delivery partners and hone in on others. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, you shouldn’t just take into account your product, but your customers too. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Profile your customers<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The nature of your product will determine many aspects of your shipping requirements. Your customer will determine many aspects of your shipping requirements as well, so make sure you build a profile of your typical customer:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Who are they? (As the data at the top of this article shows, different demographics have different expectations. A millennial with an Amazon Prime account may have different delivery expectations to a baby boomer).<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">What delivery options can they get from your immediate competitors? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do they expect free delivery? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">How likely are they to return the item? (For example, clothing retailers such as ASOS factor in a high return rate on their orders). <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do they want to be able to track their order whilst it’s in transit? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do they want flexible delivery options? (40% of consumers said they would pay more if they could select a delivery time or date, rather than their purchase simply being delivered as quickly as possible). <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">As with your product profile, if you can answer all of these questions you’ll be able to build up a customer profile that will help you select the perfect shipping partner. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Once you’ve done that, it’s time to start researching your potential shipping partners. So,  what should you look for?<\/span><\/p>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3253\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Selecting-a-shipping-company-for-ecommerce.jpg\" alt=\"Selecting the right shipping company for your eCommerce store can have a huge impact on your business\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Selecting-a-shipping-company-for-ecommerce.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Selecting-a-shipping-company-for-ecommerce-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Selecting-a-shipping-company-for-ecommerce-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<h2><span style=\"font-weight: 400;\">5 questions to ask shipping companies<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Here are five key questions you should ask a shipping company before you give them your business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">1. How much?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">It’s the first question on the lips of many eCommerce store managers and owners. But it’s an important one. Get it wrong and the cost of shipping can have a detrimental impact on your profit margins. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But, don’t simply go for the cheapest option. You don’t just want your product to reach your customers for a low price. You want your products to reach your customers quickly and in one piece. Go for the cheapest option and you run the risk of your orders turning up late (or not at all), arriving damaged or worse. Partner with the wrong shipping partner and you could lose customers and fail to gain new ones if your reputation gets damaged. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Pricing factors<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">There are a number of different things that will influence what price a shipping company will charge you. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">One of the most significant pricing factors you’ll see is the volume and weight of your package. So, if your packages are normally heavy and\/or bulky then you should expect to pay more for shipping. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The other significant pricing factor is the destination of your packages. The cost per shipment will change depending on where you are sending your packages; local, regional, national, international. However, if you are sending a larger volume of packages, then a shipping company may reduce the price downwards. In other words, <\/span><i><span style=\"font-weight: 400;\">the more shipments, the lower the cost. <\/span><\/i><\/p>\n<h3><span style=\"font-weight: 400;\">2. What are the delivery options?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As we’ve already seen, the speed of delivery is an important part of keeping your customers happy. Therefore, it’s important to ask any potential shipping provider what delivery options they can provide and the cost of each. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">3. How do you handle returns or delivery problems?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Today, returns are just as much a part of improving customer satisfaction as the initial delivery. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ask any potential shipping company if they are able to handle returns. Not all of them do. And some of the ones that do, don’t do it well… <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should also ask how they handle problems with delivery. What if the customer is not at home at the time of delivery? Do they contact the customer to arrange an alternative time? Do they leave the package with a neighbour? Do they go back the next day to reattempt delivery? These are important considerations and if not handled correctly can really damage your relationship with your customers. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">4. What’s your geographical coverage?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As an eCommerce store you’re not geographically limited in the way that many brick and mortar stores are. You can sell your products nationally, or even internationally. But that’s all for naught if your shipping partner isn’t able to provide coverage in those areas. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ideally, you’ll want to partner with a shipping partner that can at the very least provide national delivery coverage. Many shipping companies have agreements with international shipping companies so they can offer international delivery options. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">5. Are they reliable? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Perhaps not a question you want to ask straight to their face, but you should carry out some research into a shipping company’s reliability before you agree to a partnership with them.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can do much of this research using review sites such as Trustpilot and Which and comparison sites such as Interparcel. <\/span><i><span style=\"font-weight: 400;\">Caveat &#8211; many of these websites are focused more on consumers rather than business customers, so treat any reviews with this in mind. Nevertheless they can still be good indicators as to the level of service a shipping company provides.<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">It’s also worth asking fellow businesses that use shipping companies what their experiences have been with various providers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a shipping provider can provide you with a good answer to each of those five questions, then you may be a step closer to finding your ideal shipping partner. <\/span><\/p>\n<p><b><i>However, there’s a form of order fulfilment which is completely transforming the way eCommerce stores do business. <\/i><\/b><\/p>\n<p><b><i>Keep reading to find out more…<\/i><\/b><\/p>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3254\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/3PL-offers-a-truly-multichannel-fulfilment-service.jpg\" alt=\"3PL offers a truly multichannel fulfilment service\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/3PL-offers-a-truly-multichannel-fulfilment-service.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/3PL-offers-a-truly-multichannel-fulfilment-service-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/3PL-offers-a-truly-multichannel-fulfilment-service-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<h2><span style=\"font-weight: 400;\">Multichannel Order Fulfilment<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If you’re looking to grow your eCommerce business fast, then multichannel order fulfilment could be the perfect choice for your eCommerce store. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Multichannel order fulfilment is a completely different way of thinking about delivery compared to the more traditional approach outlined above. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">By offering consumers more ways to buy your products, multichannel order fulfilment can not only increase your sales, but it also features technologies and channel integrations that will streamline your order fulfilment process and improve customer satisfaction. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">What is multichannel order fulfilment?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Multichannel order fulfilment is a service in which a shipping partner handles the storage, packing and shipping of your products on your behalf. You may be selling your products on multiple channels (for example, you may have multiple eCommerce stores, an eBay account, an Amazon retailer account, a Facebook Marketplace account etc).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some multichannel order fulfilment providers (such as 3PL) allow you to integrate these channels into a dashboard system so that it’s easier to fulfil orders on your behalf, as well as giving you better visibility, with data from multiple channels being collected all in one place.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As you can imagine, multichannel order fulfilment will not only free up a lot more of your time (that would otherwise be spent with tedious manual order fulfilment), it can actually help you grow your business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">How does multichannel order fulfilment work<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Let’s take a closer look at the end-to-end process of multichannel order fulfilment.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">The products<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Whether you create products yourself or order them from a supplier, with a multichannel order fulfilment service you have them sent to your shipping provider. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, if you order your products from a supplier, under this arrangement you never actually have to handle or store your products directly, saving you money on warehousing.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Channel integration<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">As well as having your products sent to your shipping provider, multichannel order fulfilment will see you integrate all of your channels with your shipping provider. This could be a single eCommerce store, or it could be several different channels including online marketplaces.<\/span><span style=\"font-weight: 400;\">Choose 3PL for multichannel order fulfilment and you’ll be able to integrate your channels using our 3PL Fusion dashboard. In addition to integration, this dashboard provides a wealth of benefits that we’ll detail later. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Quality control<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Under a multichannel order fulfilment service, your shipping provider should not only receive and store your products, but should carry out a quality control review too. That’s what we do here at 3PL. It’s a vital step in maintaining customer satisfaction.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Order processing<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Once your products are being sent to your shipping partner and your channels are integrated your orders will begin to be processed. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Because of the integration, your orders will be received directly by your shipping partner, saving you further time that you can use to build your business. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Order packing<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">As we’ve written <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-create-the-ultimate-unboxing-experience-for-your-brand\/\"><span style=\"font-weight: 400;\">previously<\/span><\/a><span style=\"font-weight: 400;\">, packing and packaging is an important part in boosting customer satisfaction. Here at 3PL our multichannel order fulfilment customers benefit from a bespoke packing service. We can pack orders that are tailored to your guidelines or with custom packaging.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">The world’s best shipping rates<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Once your order is packaged up, it’ll be sent out. However, unlike many other multichannel order fulfilment providers, 3PL is able to make use of cutting edge technology to get you the world’s best shipping rates, with the world’s best carriers, <\/span><i><span style=\"font-weight: 400;\">every single time. <\/span><\/i><span style=\"font-weight: 400;\">You’ll find more detail about this later on in this article.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Order tracking<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">A good multichannel order fulfilment provider will notify both yourself and your customer as soon as the order has been sent out (at least, that’s what we do here at 3PL!). <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Order returns and exchanges<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Should the worst happen and your customer decides they want to return their order, this can all be managed as part of a multichannel order fulfilment service. At 3PL we make this as easy as possible. All returns and exchanges can be managed through our 3PL Fusion dashboard.<\/span><\/p>\n<p><b><i>You can view a handy visualisation of our multichannel order fulfilment process <\/i><\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/how-it-works\/\"><b><i>here<\/i><\/b><\/a><b><i>.<\/i><\/b><\/p>\n<h3><span style=\"font-weight: 400;\">How do I sign up for multichannel order fulfilment?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Getting started with multichannel order fulfilment is easy. Here at 3PL we have an online portal and web-based user guides which make getting started with multichannel order fulfilment really straight forward.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Registering an account<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Simply <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\"><span style=\"font-weight: 400;\">register<\/span><\/a><span style=\"font-weight: 400;\"> for an account, create your products and your carrier rules, sync your store with the platform and you’re ready to make ship happen!<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">A user-friendly dashboard<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Once you’re registered for multichannel order fulfilment with 3PL you’ll have access to our  visual dashboard (3PL Fusion). Through this dashboard you can manage your inventory, amend orders, access invoices and much more. Plus, the dashboard is available 24\/7 365. What’s more, 3PL’s network of national and international fulfilment centres means your eCommerce store will have global reach.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Watch this short video below which will give you the full lowdown on 3PL Fusion:<\/span><\/p>\n<p><iframe title=\"YouTube video player\" src=\"https:\/\/www.youtube.com\/embed\/Xc1Xq8cjw64\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<h4><span style=\"font-weight: 400;\">Carrier automation<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Worried about having to continually check carrier prices so you don’t fall foul of extortionate price fluctuations? With 3PL’s multichannel order fulfilment service all of that is taken care of for you. We use industry-leading automated carrier management technology which selects the fastest and most cost-effective delivery service to deliver your package. As soon as your order is shipped both you and your customer are notified and kept up-to-date.<\/span><\/p>\n<p><b><i>We hope you’ve found our guide to picking the best shipping company for your eCommerce store useful! <\/i><\/b><\/p>\n<h2 style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\"><span style=\"font-weight: 400;\">Sign up for multichannel order fulfilment with 3PL today<\/span><\/a><\/h2>\n<p style=\"text-align: center;\"><b>Find more advice for your eCommerce store on the 3PL <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-are-the-key-factors-to-a-successful-ecommerce-order-fulfilment-process\/\"><b>What Are The Key Factors to a Successful eCommerce Order Fulfilment Process?<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\"><b>5 Ways to Improve Your Order Fulfilment Process<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/a-guide-to-international-shipping-for-ecommerce-stores\/\"><b>A Guide to International Shipping for eCommerce Stores<\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You’ve just had another great week of sales at your eCommerce store. Great! But now you’ve got to get those items to your customer. You need to get them delivered&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3257,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3252"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3252"}],"version-history":[{"count":3,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3252\/revisions"}],"predecessor-version":[{"id":3259,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3252\/revisions\/3259"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3257"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3252"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3252"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3252"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}