{"id":3286,"date":"2021-05-19T08:00:09","date_gmt":"2021-05-19T07:00:09","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3286"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"the-most-important-kpis-ecommerce-businesses-should-be-tracking","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-most-important-kpis-ecommerce-businesses-should-be-tracking\/","title":{"rendered":"The Most Important KPIs eCommerce Businesses Should Be Tracking"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">If you’re running an eCommerce business then you need to be measuring KPIs (Key Performance Indicators) to ensure your store is performing as it should be. But, what KPIs are the most important? Which ones will help you understand the health of your business? <\/span><b><i>Read on to find out the most important KPIs eCommerce businesses should be tracking.<\/i><\/b><\/p>\n<h2><span style=\"font-weight: 400;\">What are Key Performance Indicators?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">To put it simply, Key Performance Indicators (KPIs) are measures of success. They are milestones in the road that show you how your business is progressing. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">KPIs are quantitative, not qualitative. They are hard goals against which you can measure success (or not). KPIs enable you to make business decisions using data rather than guesswork or gut instinct.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To help you better understand what a KPI is, let’s take a look at a practical example:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">My eCommerce business will sell 1,000 t-shirts a month by the end of the year. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">This is a good KPI as it has a clear target &#8211; the sale of 1,000 t-shirts each month &#8211; and it sets out a clear timeframe for completion &#8211; the sales target must be met by the end of the year.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Clear, measurable KPIs can help you drive the performance of your eCommerce business. There’s one caveat though &#8211; your KPIs must be realistic. Don’t set a target which is impossible to achieve (for example, setting a target to sell more t-shirts than you can actually produce each month).<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Is a KPI the same as an SLA?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In addition to KPIs you may have heard of something called a Service Level Agreements (SLAs).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">They are not the same. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As we have seen above, a KPI is a target against which you can measure success. A Service Level Agreement on the other hand is a set of agreed working principles between your eCommerce business and a supplier. For example, you may have an SLA with the manufacturer of your t-shirts, whereby they promise to produce X number of t-shirts each month.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why should I set KPIs for my eCommerce store?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">KPIs are a useful way of measuring the success of your business. But, there are a whole host of other reasons why you may want to establish KPIs across various parts of your business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">KPIs help you measure growth<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">For the owners of many eCommerce stores, growth is one of their biggest ambitions. They want to grow their revenue (and profits). So, setting KPIs around growth is really important. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Establishing these KPIs will help you to measure growth and quickly make adjustments to your business strategy if things are going awry. For example, if you are missing your growth targets for the month, you can ramp up advertising spend to attract new customers. On the other hand, if you’re exceeding your growth targets for the month, then you can order additional products so that you can continue to meet demand.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">KPIs help you improve sales<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As the example above illustrates, KPIs can be <\/span><i><span style=\"font-weight: 400;\">actively <\/span><\/i><span style=\"font-weight: 400;\">used to improve sales. Measuring things such as conversion rate, customer retention rate, percentage returning customers, average order value, can help you identify ways of quickly and easily improving sales. KPIs can provide actionable insights far quicker than other forms of insight such as customer surveys.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">KPIs will provide you with data<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As we mentioned at the top of this article, KPIs will provide you with hard data which you can use to make business decisions. KPIs also provide investors and business partners with clear evidence of the performance of your business. So, effective KPIs can be used to garner additional investment, publicity and more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To consider a practical example, if your KPIs demonstrate sustained, strong growth, then it becomes easier to attract investment for a new, enlarged warehouse. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">KPIs provide employees with goals<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">A good KPI system will help employees understand the goals they have to achieve everyday. Establishing <\/span><i><span style=\"font-weight: 400;\">realistic <\/span><\/i><span style=\"font-weight: 400;\">KPIs can help motivate a workforce and drive improvements in customer service, fulfilment, and more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">KPIs can help keep your workforce accountable, aligned and focused on the company’s overarching performance. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">How do I decide which KPIs are right for my eCommerce store?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Knowing which KPIs are right for your eCommerce business can be a challenge. After all, every business is different and the number of things you could potentially measure and report against is almost endless. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To help you decide which KPIs are right for you, we’ve set out four crucial questions below. Answer these and you should have a better idea as to what KPIs you should be putting in place:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">What is your desired outcome?<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">How does this outcome benefit your business overall?<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">How will you know if you have achieved this outcome?<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Is this KPI a leading indicator of performance? Or a lagging indicator? <\/span><\/li>\n<\/ol>\n<h2><span style=\"font-weight: 400;\">What is a leading indicator KPI versus a lagging indicator KPI?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A leading indicator KPI is an indicator which will predict what will happen in the future. Leading indicator KPIs help you know if you’re on track to achieve the goals you’ve set out e.g. to sell 1,000 t-shirts a month by the end of the year. Leading indicator KPIs measure things like number of calls to customer service, number of website visits, participation numbers for webinars, livestreams etc.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whereas lagging indicator KPIs measure outputs that have already occurred in order to gain an insight on future success. Lagging indicator KPIs measure things like profit, expenses, renewal rates and revenue. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The most important KPIs to track in your eCommerce business<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Now that we understand what KPIs are and why they’re important, let’s take a look at what we here at 3PL consider to be the most important KPIs to track in your eCommerce business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Sales Performance KPIs<\/span><\/h3>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3289\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Sales-KPIs-for-eCommerce-Stores.jpg\" alt=\"Sales KPIs for eCommerce stores\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Sales-KPIs-for-eCommerce-Stores.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Sales-KPIs-for-eCommerce-Stores-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Sales-KPIs-for-eCommerce-Stores-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Arguably <\/span><i><span style=\"font-weight: 400;\">the <\/span><\/i><span style=\"font-weight: 400;\">most important set of KPIs you can put in place are those that measure how your eCommerce business is performing in terms of conversions and revenue. Here are some of the most important sales performance KPIs:<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Conversion rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">If a potential customer lands on your eCommerce store, but then departs without buying anything, that’s a missed opportunity! A conversion can be almost anything, but in the case of eCommerce stores, we’re talking about somebody visiting your store and then buying something.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can calculate the conversion rate of your eCommerce website by using the following formula:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Conversion Rate = (Conversions \/ Total Visitors) x 100%<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Cost of Goods Sold<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">It’s important to know how much it costs you to produce your products. And, we’re not just talking about the cost of the material used to manufacture your t-shirts (to continue the example from above). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Your Cost of Goods Sold (or COGS) should include the direct costs associated with the production of your t-shirts, so things like labour as well as materials.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A typical Cost of Goods Sold formula is as follows:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Beginning inventory (at the start of the year).<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Plus purchases and other costs. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Minus ending inventory (at the end of the year).<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Equals Cost of Goods Sold.<\/span><\/li>\n<\/ul>\n<h4><span style=\"font-weight: 400;\">Customer Lifetime Value<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Customer Lifetime Value (CLV) (sometimes also referred to as Lifetime Value), is another KPI that’ll give you a valuable insight into the performance of your business sales-wise.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This KPI measures the average profit per customer (or how much they spend with you over time), minus their acquisition and servicing costs (e.g. advertising spend, customer service and fulfilment time). This highlights the value of a customer’s repeat purchase rate &#8211; not just their value on a purchase-by-purchase basis.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is a particularly important KPI for two reasons. The first, is based on the old adage that it costs more to attract new customers than it does to retain existing ones. The second reason is that once you know the CLV of a customer, you can devise strategies to get them to spend more over time, thus increasing their lifetime value to your eCommerce store.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can calculate Customer Lifetime Value using the following formula:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">CLV = (Customer revenue per year x Duration of the relationship in years) &#8211; Total costs of acquiring and serving the customer<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Customer Acquisition Cost<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Customer Acquisition Cost (CAC) is a KPI that helps you figure out what resources you need to attract new customers. Your CAC can vary enormously depending on what marketing channels you use to attract new customers. For example, if you are paying alot for Google Ads each month versus obtaining press coverage for free or generating large amounts of organic traffic. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To give you an idea of what your CAC could be, the average customer acquisition cost for consumer goods is £15.50. So you can see why it’s important to set customer acquisition costs as a KPI. Measure CAC and you’ll quickly get an insight into the underlying profitability of your marketing strategy, enabling you to change acquisition costs if necessary.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Revenue Per Visitor<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">This is a simple KPI, but an important one. Revenue per visitor is simply a measurement of the amount of money generated each time someone visits your eCommerce store. Knowing this number can help you identify ways to improve your site through tactics such as Conversion Rate Optimisation (CRO), so you can turn more visitors into customers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Measuring revenue per visitor over time can help you benchmark any CRO work and see how effective it is versus other marketing and user experience tactics.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Average Order Value<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Your <\/span><i><span style=\"font-weight: 400;\">average <\/span><\/i><span style=\"font-weight: 400;\">order value helps you determine the average amount someone spends when they visit your website.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This KPI is particularly important for your pricing strategy. Once you know your average order value you can look at strategies to increase a customer’s average spend on your website. For example, you could price your products in such a way that you can offer free delivery (while offsetting your shipping and fulfilment costs). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Other ways you can increase order value include offering product bundles, free gifts, memberships and loyalty cards.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Churn rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">If you don’t know how many customers are leaving your brand, then you can’t figure out effective ways of stopping them leaving. Calculating your churn rate will provide you with another interesting insight into the underlying profitability of your eCommerce store. Why? Because, if your churn rate is at a level that doesn’t allow you to recoup your customer acquisition cost, then you’ll be losing money and heading for trouble. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, it’s well worth calculating the churn rate of your eCommerce store!<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Marketing KPIs<\/span><\/h3>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3290\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Marketing-KPIs-for-eCommerce-Stores.jpg\" alt=\"Marketing KPIs for eCommerce stores\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Marketing-KPIs-for-eCommerce-Stores.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Marketing-KPIs-for-eCommerce-Stores-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Marketing-KPIs-for-eCommerce-Stores-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">In addition to sales and revenue KPIs, it’s important for eCommerce stores to put a series of marketing KPIs in place. Below, we’ve listed the most crucial marketing KPIs that you should consider for your business.<\/span><\/p>\n<p><b><i>Tip &#8211; Google Analytics is the best tool for measuring and finding the necessary data for many of the KPIs outlined below.<\/i><\/b><\/p>\n<h4><span style=\"font-weight: 400;\">Website traffic<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">A rather obvious KPI, but if you’re not consistently measuring your website traffic then you aren’t going to be able to discern visitor trends (e.g. long term decline, rapid growth etc). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to the absolute visitor numbers per month, you can also look at the most visited pages on the site overall, the sources of traffic such as social media, organic search, paid search etc. All of these things will help you build a picture of how your eCommerce site is performing.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Bounce rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">For eCommerce websites, the bounce rate is a particularly important KPI. A ‘bounce’ is defined as the percentage of people who leave a web page without taking an action (such as clicking on a product or making a purchase).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you can reduce your bounce rate, then you increase the likelihood a visitor to your website will make a purchase &#8211; so this is definitely a KPI to add to your list!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Bounce rate is calculated using the following formula:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Bounce rate = Total one-page visits \/ Total entrance visits<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you have Google Analytics plugged into your site, then finding the bounce rate is as easy as clicking a button.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">New visitors v returning visitors<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Knowing how many people are returning to your eCommerce store can be a very useful metric, particularly for refining and enhancing your marketing efforts. If you have a very high proportion of returning visitors versus new visitors then the chances are you have a loyal audience of customers.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Newsletter subscribers<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Do you have a newsletter? If you do, then tracking the number of subscribers to it as a KPI is well worthwhile. Why? Because, according to the hierarchy of subscribers, newsletter subscribers are more engaged than followers on social media. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Newsletters are also a brilliant way of generating additional sales through special offers, subscriber exclusives and more.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Abandoned cart rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">How many of your customers are on the verge of making a purchase and then change their mind? By measuring your abandoned cart rate as a KPI you’ll have the answer to this question. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Shoppers abandon carts for a variety of reasons such as complicated or confusing checkout processes, high shipping costs, hidden fees and more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">By monitoring your abandoned cart rate you can identify trends and come up with strategies to reduce the number of customers who abandon their purchases.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Your abandoned cart rate is calculated as follows:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Shopping cart abandonment rate = (Total number of shoppers who completed transactions \/ Total number of shoppers who added items to their cart) &#8211; 1 x 100<\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to research company Statista, the average cart abandonment rate by industry is:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Retail &#8211; 72.8%<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Fashion &#8211; 68.3%<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Travel &#8211; 81.7%<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Gaming &#8211; 64.2%<\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Customer service KPIs<\/span><\/h3>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3291\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Customer-service-KPIs-for-eCommerce-Stores.jpg\" alt=\"Customer service KPIs for eCommerce stores\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Customer-service-KPIs-for-eCommerce-Stores.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Customer-service-KPIs-for-eCommerce-Stores-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Customer-service-KPIs-for-eCommerce-Stores-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Effective customer service is vital to attracting and retaining customers. So we’ve outlined several customer service KPIs below that you should be tracking for your eCommerce business.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Net Promoter Score<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">The Net Promoter Score (NPS) is an index that ranges from -100 to 100. It measures the willingness of a customer to recommend a company’s products to others. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Word of mouth promotion can be a powerful driver of sales and new customer acquisition, so you should definitely measure your NPS as a KPI. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To calculate your Net Promoter Score, you need to do the following:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Ask your customers (either by email or via phone) the following question &#8211; “On a scale of 0-10, how likely is it that you’d recommend our eCommerce store to a friend, family member or business associate?’ The scale being 0 not likely at all and 10 being extremely likely.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You then need to divide up all of your customers’ answers into the following categories:<\/span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Customers that scored you 6 or lower are known as Detractors.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Customers that gave you a score of 7 or 8 are known as Passives.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Customers that scored you 9 or 10 are Promoters.<\/span><\/li>\n<\/ul>\n<\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You then calculate your overall NPS by subtracting the percentage of customers who are detractors from the percentage who are promoters. This will give you your Net Promoter Score.<\/span><\/li>\n<\/ul>\n<h4><span style=\"font-weight: 400;\">Customer Resolution Time<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Customer Resolution Time (CRT) is a KPI that tells you how long <\/span><i><span style=\"font-weight: 400;\">on average <\/span><\/i><span style=\"font-weight: 400;\">it takes for your support team to resolve any issues that customers have. Like many of the other KPIs in this article, CRT is a relatively simple metric, but one that can deliver significant results if measured regularly, consistently and acted upon.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Customer Satisfaction Score <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Like the Net Promoter Score, the Customer Satisfaction Score (CSAT) measures how satisfied consumers are with your service. Where CSAT differs from NPS is that it is largely used to measure short term consumer loyalty. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">CSAT is normally calculated by asking a customer a question such as “How would you rate your buying experience on our eCommerce store?”. The customer can select one from a series of answers such as Poor, Bad, Okay, Great, Perfect. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You then work out your overall CSAT score using the following formula:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">CSAT = Number of positive responses \/ Total number of responses x 100<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Fulfilment and logistics KPIs<\/span><\/h3>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3292\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Fulfilment-and-Logistics-KPIs-for-eCommerce-Stores.jpg\" alt=\"Fulfilment and logistics KPIs for eCommerce stores\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Fulfilment-and-Logistics-KPIs-for-eCommerce-Stores.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Fulfilment-and-Logistics-KPIs-for-eCommerce-Stores-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/05\/Fulfilment-and-Logistics-KPIs-for-eCommerce-Stores-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">As well as setting up KPIs for sales, marketing and customer service, you should also consider setting up KPIs for fulfilment and logistics &#8211; especially as this is an area that can cause real headaches for eCommerce businesses. We’ve outlined some of the most important fulfilment and logistics KPIs below.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Inventory levels<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">In order to keep your customers happy and not miss out on sales, you should keep a continual track of your inventory levels. You need to know the amount of stock you currently have at hand and how quickly products are selling. Using a real-time inventory system will be the easiest way of doing this, as manually counting and monitoring inventory can be a very time-consuming process.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Inventory turnover rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">In the same way that you need to monitor your inventory levels, you should also measure your inventory turnover rate. The inventory turnover rate measures how many times your products are sold and then re-stocked over a set period of time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Knowing your inventory turnover rate will help you identify fast selling products as well as slower selling products. You can then adjust your purchasing requirements as necessary, improving your sales and reducing the amount of dead stock in your warehouse. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Inventory turnover rate is calculated as follows:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Inventory turnover = Cost of Goods Sold \/ Average Inventory Value<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Order accuracy rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">No one likes their order to arrive and find that it’s wrong. It’s a massive turn-off for customers. So, another important KPI to measure is your order accuracy rate. This measures the percentage of all orders that are fulfilled and shipped to their final destination without any errors, such as mis-picks or the incorrect amount. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Order accuracy rate is calculated as follows:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Order accuracy rate = (Total orders fulfilled accurately \/ Total orders fulfilled) x 100<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Return rate<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Do you worry about the impact that returns are having on your eCommerce business? Then  make sure you’re monitoring your return rate as a KPI. Knowing what your return rate is, can help you devise strategies to reduce the overall volume of returns. For example, you can improve product descriptions, conduct regular product testing, test packaging and other factors that may reduce your return rate.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Return rate is calculated as follows:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Return rate = The number of items returned \/ the number of items sold<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Percentage of sales lost due to out of stock issues<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">These days, if a product is out of stock a customer is unlikely to wait. They’ll simply head to Google and find another eCommerce store that can sell them their desired product straight away.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Therefore, it’s important that another of your KPIs is the percentage of sales lost due to products being out of stock. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This KPI can help you identify issues such as poor inventory management, supply chain issues, or problems with your logistics. Naturally, you can eliminate these issues by working with 3PL!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This KPI is calculated using the following formula:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Sales lost = (Value of sales lost \/ Total value of sales) x 100<\/span><\/p>\n<p><b><i>We hope you found our guide to the most important KPIs eCommerce business should be tracking useful. Explore the rest of our blog for more useful eCommerce tips, insights and advice.<\/i><\/b><\/p>\n<h2 style=\"text-align: center;\"><span style=\"font-weight: 400;\">To find out how 3PL can give your eCommerce business a boost, <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\"><span style=\"font-weight: 400;\">contact us<\/span><\/a><span style=\"font-weight: 400;\"> today<\/span><\/h2>\n<p style=\"text-align: center;\"><b>Find more eCommerce information and advice on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/inventory-valuation-methods-your-ecommerce-store-needs-to-know\/\"><b>Inventory Valuation Methods Your eCommerce Store Needs to Know<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-improve-your-shipping-process-make-it-your-competitive-advantage\/\"><b>How to Improve Your Shipping Process &amp; Make It Your Competitive Advantage<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/a-guide-to-international-shipping-for-ecommerce-stores\/\"><b>A Guide to International Shipping for eCommerce Stores<\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re running an eCommerce business then you need to be measuring KPIs (Key Performance Indicators) to ensure your store is performing as it should be. But, what KPIs are&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3287,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3286"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3286"}],"version-history":[{"count":2,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3286\/revisions"}],"predecessor-version":[{"id":3296,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3286\/revisions\/3296"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3287"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3286"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3286"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3286"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}