{"id":3298,"date":"2021-06-01T08:30:06","date_gmt":"2021-06-01T07:30:06","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3298"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"why-you-should-use-a-3pl-for-your-amazon-fulfilment","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/why-you-should-use-a-3pl-for-your-amazon-fulfilment\/","title":{"rendered":"Why You Should Use a 3PL for Your Amazon Fulfilment"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">If you’re selling goods through Amazon (be they your own or third party white label products) then you may automatically assume that Amazon’s FBA service is the best option for the fulfilment and delivery of your products. But, that’s not necessarily the case. You can make bigger savings, improve your customer service and more, all by using a 3PL instead. <\/span><b><i>Find out how in this article.<\/i><\/b><\/p>\n<h2><span style=\"font-weight: 400;\">What is Amazon FBA?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Before we go into the details of using a 3PL for your Amazon fulfilment, let’s begin by defining exactly what Amazon’s FBA service is. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">FBA stands for Fulfilment By Amazon. It’s a service which is offered to vendors on Amazon, whereby Amazon will store, pick, pack, ship and offer customer service on their behalf.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">What’s not to like about that? Certainly, Amazon has one of the most advanced fulfilment networks in the world, but there are many drawbacks to their FBA service which mean it’s not the right fit for every eCommerce business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re an eCommerce business, then you can reap far more benefits by switching to an independent 3PL.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What is a 3PL?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Put simply, a 3PL is a third party logistics company that takes care of the inventory management,  storing, picking, packing, shipping and the associated customer service of your products for you.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“Wait, what?! That sounds exactly like Amazon FBA?”, we hear you say. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You’re right. <\/span><i><span style=\"font-weight: 400;\">That’s because Amazon’s FBA service is basically a 3PL<\/span><\/i><span style=\"font-weight: 400;\">. They’ve just added the ubiquitous Amazon brand to it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is why you shouldn’t necessarily see Amazon FBA as a non-negotiable choice for fulfilment when you’re selling on Amazon. There are a whole host of other 3PL providers available, many of whom can provide a more cost-effective service with bespoke packing, storage and fulfilment options.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2021 Amazon fulfilment concerns<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">You’d assume that being the behemoth that it is, that Amazon and it’s FBA service would be a well-oiled machine, but that’s not necessarily the case. In fact, in recent months it’s become apparent that there are a number of issues that are negatively impacting vendors. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Let’s take a look at the most pressing of these issues below.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Inventory restrictions<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This is arguably the biggest issue currently facing vendors using the Amazon FBA service.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">During Q4 2020 Amazon introduced new inventory restrictions to limit storage capacity based on inventory performance, as well as ASIN-level quantity limits. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">IPI score threshold increased from 400 to 500<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Amazon has an inventory performance index (IPI) to measure how efficiently a seller drives sales by stocking popular products and managing on-hand (in-stock) inventory. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As with many things Amazon, the exact criteria as to how a seller’s IPI score is calculated are not easily available, however the following factors are likely to influence a seller’s IPI score:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">In-stock inventory.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Excess inventory.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Sell-through (otherwise known as throughput).<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Stranded inventory (inventory that you have stored with Amazon, but isn’t listed on the Amazon store).<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">As of Q4 2020 Amazon changed their IPI threshold for sellers from 400 to 500. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This means that if you’re a seller and your IPI score falls below 500 you will suddenly become subject to an array of storage volume limits for standard-sized, oversize, apparel, and footwear items. These costs can soon add up and have a punitive impact on your business.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">ASIN-level quantity limits<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">If you don’t know, ASIN stands for Amazon Standard Identification Number. ASINs are unique product codes made up of 10 characters which allow shoppers and sellers alike to search for specific items. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">These ASIN numbers are assigned to a product by Amazon. Since Q4 2020 Amazon has, for select ASINs, limited the maximum unit quantity that sellers can ship to fulfilment centres. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to Amazon directly, these new limits have been introduced to:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“Help you avoid sending products that already have high overall inventory levels but low customer demand. Units that have been in our fulfilment centres for six to 12 months or 12 months or longer (with an exemption of one unit for each applicable product ASIN), will be assessed a semi-annual Long-Term Storage Fee”.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In other words, if you’re unlucky enough to be selling products that have one of these ‘select’ ASINs, you’ll experience significant delays in storing and shipping them with Amazon, and if you’re already have products with these ‘select’ ASINs stored with Amazon for a long period of time, then you’ll be facing higher storage fees!<\/span><\/p>\n<p><b><i>Note &#8211; ASIN limits can apply to you even if your IPI score is over 500. For example if you have a brand new ASIN or a slow-moving ASIN, then ASIN limits may be applied.<\/i><\/b><\/p>\n<h3><span style=\"font-weight: 400;\">Poor quality control<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This is an issue which is particularly impacting sellers of third-party, white label products. For example, if you’re selling a generic dustpan and brush set, then Amazon will simply select a set from the nearest warehouse to the customer and send it out. This means that you have little to no scope for quality control. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Minimal order customisation<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you’re trying to build your brand, then unfortunately Amazon’s fulfilment service offers minimal order customisation. Your products will be packaged in Amazon branded packaging. If you’re selling white-label third-party products, then in the eyes of your customer, they are buying directly from Amazon.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Amazon is a direct competitor<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Increasingly, Amazon is monitoring what products are selling well amongst vendors and then creating their own Amazon-branded versions.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Limited access to Amazon customer service<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you’re going to be using a third party to fulfil and ship your goods then you want to be able to talk to them quickly and easily if any issues arise. After all, shipping and fulfilment is a hugely important part of your customer experience. Any issues can damage your brand.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Unfortunately, Amazon is hard to reach when it comes to FBA issues. They have a ‘click-to-call’ feature, which connects to a single hotline. They don’t have any account managers, and it’s just generally difficult to get an answer out of them.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">“Buy box” status is not guaranteed with Amazon FBA<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">There’s an urban myth that says you need to be signed up to Amazon FBA in order to achieve the much coveted ‘Buy Box” status. There’s certainly no truth to this.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Amazon’s criteria for assigning Buy Box status is based on a series of specific seller criteria that identify the sellers that have consistently provided customers with a great buying experience on Amazon. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">These requirements vary by category and change on a fairly regular basis, but being an Amazon FBA seller <\/span><i><span style=\"font-weight: 400;\">alone<\/span><\/i><span style=\"font-weight: 400;\"> is absolutely no guarantee that you’ll be given Buy Box status.<\/span><\/p>\n<p><b><i>Guide &#8211; you can read more about the pros and cons of Amazon FBA in our guide &#8211; <\/i><\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/amazon-fba-what-are-the-advantages-and-disadvantages\/\"><b><i>Amazon FBA: What Are The Advantages And Disadvantages?<\/i><\/b><\/a><b><i> <\/i><\/b><\/p>\n<p><span style=\"font-weight: 400;\">So, because of all of the issues outlined above (and more!), eCommerce businesses are increasingly looking at alternative fulfilment methods. We’ve detailed these below.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3303\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/The-Benefits-of-Using-a-3PL-for-Amazon-Fulfilment.jpg\" alt=\"Using a 3PL instead of Amazon FBA can have many benefits\" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/The-Benefits-of-Using-a-3PL-for-Amazon-Fulfilment.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/The-Benefits-of-Using-a-3PL-for-Amazon-Fulfilment-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/The-Benefits-of-Using-a-3PL-for-Amazon-Fulfilment-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/>Fulfilment alternatives to Amazon FBA: Using a 3PL<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If reading the above information has made you think twice about Amazon FBA, then don’t worry. There are plenty of third-party fulfilment alternatives. Here at 3PL we’re experts in fulfilling orders that are 100% compliant with Amazon’s requirements. Find out more below. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Amazon FBA Prep<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">So, you may want to continue to use Amazon’s FBA service, but want the added reassurance that your products are quality assessed, not subject to Amazon’s expensive storage fees, and are packed according to Amazon’s strict criteria. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In that case 3PL’s Amazon FBA Prep service is the perfect choice. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We guarantee your products are 100% Fulfilled by Amazon (FBA) compliant. 3PL prepares your products to adhere to Amazon’s strict guidelines and sends them to your chosen Amazon fulfilment centres through Amazon’s multi-channel fulfilment service. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Amazon Fulfilment by Merchant (FBM)<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The leading alternative to Amazon FBA, is Amazon FBM. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">With Amazon FBM it is up to you, the seller, to fulfil any sales you make on Amazon. FBM is sometimes also referred to as a Merchant Fulfilled Network (MFN). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whilst only around 9% of Amazon sellers use FBM, it can be a very profitable model, especially if you partner with a 3PL. In fact, <\/span><i><span style=\"font-weight: 400;\">Amazon FBM sellers consistently earn more revenue and enjoy better profit margins than their competitors using FBA.<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">The only potential downside to Amazon FBM, is that you have to be more ‘hands-on’, arranging warehousing for your inventory, organising picking, packing and shipping. <\/span><i><span style=\"font-weight: 400;\">However,<\/span><\/i><span style=\"font-weight: 400;\"> you can completely eliminate these burdens by choosing a 3PL to undertake these tasks on your behalf.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At 3PL we can store, pick, pack and ship your Amazon FBM orders on your behalf. We can even take care of any customer service queries for you from our contact centre. We also have a nifty dashboard called 3PL Fusion where you can see the status of all your orders at a glance. It can also integrate <\/span><i><span style=\"font-weight: 400;\">all <\/span><\/i><span style=\"font-weight: 400;\">of your online sales channels, so if you sell your goods from your own website or Shopify store as well as Amazon, <\/span><i><span style=\"font-weight: 400;\">we can take care of the shipping and fulfilment requirements for all of these channels.<\/span><\/i><\/p>\n<p><b><i>Find out more about our Multichannel eCommerce Fulfilment services <\/i><\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/multichannel-ecommerce-order-fulfilment\/\"><b><i>here<\/i><\/b><\/a><b><i>.<\/i><\/b><\/p>\n<h3><span style=\"font-weight: 400;\">Self-Fulfilled Amazon Prime<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Amazon Prime is an incredibly powerful sales platform. With over 100 million Prime subscribers, it’s an audience of potential customers that you can’t ignore. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Luckily, you don’t have to rely on Amazon to ship and fulfill your Prime orders. There’s an alternative &#8211; Self-Fulfilled Prime (SFP). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Self-Fulfilled Prime is, at root, the same sort of set-up as FBM &#8211; but with a big difference &#8211; the valuable Prime badge. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you want to go down the Self-Fulfilled Prime route, then you’ll need to meet some strict criteria. Under the SFP route, you are allowed to offer 2-day Prime shipping to your customers without having to store any of your inventory in Amazon’s warehouses (or be subject to FBA fees). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, to become eligible to be an SFP seller, you must first go through a trial period where you must consistently meet all of Amazon’s standards for Prime. During this trial period, you will need to ensure all of your orders are delivered within two days, but they won’t bear the Prime badge. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you pass this trial period, then you can sell your products under the Prime label.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Naturally, the idea of fulfilling all of your orders within two days sounds intimidating. But, like with Amazon FBM, 3PL can help you achieve Self-Fulfilled Prime deliveries. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We quality check and prepare your products to ensure they meet Amazon’s strict compliance criteria. Your shipments are then quickly despatched to the nominated Amazon receiving centre via approved Amazon carriers. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3304\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Amazon-FBA-versus-3PL.jpg\" alt=\"Should I use a 3PL for my Amazon fulfilment? \" width=\"900\" height=\"600\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Amazon-FBA-versus-3PL.jpg 900w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Amazon-FBA-versus-3PL-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Amazon-FBA-versus-3PL-768x512.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/>The benefits of using a 3PL for your Amazon fulfilment<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">As you can see from the options listed above, there are plenty of different ways that a 3PL can deliver your Amazon fulfilment for you ( instead of leaving it in the hands of Amazon). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But, what are the benefits of using a 3PL for your Amazon fulfilment? We’ve detailed them below.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Expertise-at-hand<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">By working with a 3PL you’ll be able to draw upon the talents and experience of a pool of logistics, fulfilment, and warehousing experts. Unlike Amazon, where you have to spend ages on hold to speak to anyone, a 3PL will be immediately available at the end of the phone. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Many 3PLs will have account managers who will act as your ‘go-to’ contact for any and all issues. So, if you have any worries or concerns about any aspect of your fulfilment you can speak to a real human being and be reassured that action will be taken, as opposed to the anonymous corporate entry of Amazon where requests and concerns can get lost in the ‘machine’.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Customised service<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Amazon is a gargantuan one-size-fits-all service. This means that if you have specific requirements for your fulfilment service, you ain’t gonna get that from Bezos and his crew. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You either accept their standardised approach to fulfilment or you go elsewhere.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A good 3PL will be able to tailor their service to exactly meet your requirements. If you need your orders tracked in a certain way, or packed to certain requirements, they can accommodate that. Bear in mind that things like the <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-create-the-ultimate-unboxing-experience-for-your-brand\/\"><span style=\"font-weight: 400;\">unboxing experience<\/span><\/a><span style=\"font-weight: 400;\"> can have a big impact on customer satisfaction and repeat sales, so it pays to work with a fulfilment partner that can provide bespoke services.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Many 3PLs can also handle both B2B and B2C fulfilment and support sales from multiple channels such as Amazon <\/span><i><span style=\"font-weight: 400;\">and <\/span><\/i><span style=\"font-weight: 400;\">Shopify, eBay, and even brick and mortar stores. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Lower shipping and storage rates<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">With Amazon having one of the largest distribution networks in the world, you’d assume their shipping and storage rates would be amongst the lowest due to economies of scale. Wrong. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">3PLs can offer more competitive shipping and storage rates as they are able to choose between different shipping carriers and negotiate the best price. They are able to use the element of competition between carriers to drive down prices whilst maintaining quality fulfilment. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As 3PLs are also often using carriers in significant volumes on a regular basis, they are able to achieve bulk discounts that you would not be able to secure on your own.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additionally, storage costs tend to be far cheaper with 3PLs. This is down to a number of reasons. Firstly, storage is part of a 3PL’s core business, whereas for Amazon, the FBA service (and associated storage) is a minor part of their overall business. It literally pays for a 3PL to offer competitive storage rates. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Secondly, it’s in the interests of the 3PL to maintain high throughput through their warehouses. Unlike Amazon, which is quite happy to let your unsold inventory sit in their warehouse (in exchange for hefty long-term storage fees!), a 3PL has many different customers to service and will want to help you shift your stock.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">More stability<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As you can see from the changes they made in Q4 2020, Amazon can change its storage and shipping rates at a whim (and in the case of the ASIN and IPI changes, it didn&#8217;t even notify sellers!), so by using Amazon FBA rather than an independent 3PL you run the risk of major changes disrupting your revenue and profit margins overnight. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A good 3PL on the other hand will give you advanced notice of any changes to inventory management, warehouse fees, shipping changes etc, so you have time to factor these things into your business and pricing models.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">A growth partner<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">By choosing a 3PL you’ll be working with a partner that’s actively invested in helping you grow your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Amazon, on the other hand, doesn’t feel the need to support sellers. It’ll be making vast profits anyway. In fact, as we mentioned earlier, Amazon even copies some sellers’ products and sells their own branded versions, thus actually reducing these sellers’ sales…<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The more a 3PL can help you to grow, the more they will grow too. As you sell more and more goods, they’ll have more and more goods to pick, pack, and ship. <\/span><b><i>Think of it as a positive symbiotic relationship<\/i><\/b><span style=\"font-weight: 400;\">. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Consider 3PL for your Amazon fulfilment today<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If you’re looking to start selling on Amazon, or you’re currently using Amazon’s FBA service, we hope the above information has given you some food for thought. If you’d like to find out more about how a 3PL can transform your Amazon fulfilment and help you generate increased revenue and profit margins, get in contact with us today. <\/span><\/p>\n<h2 style=\"text-align: center;\"><span style=\"font-weight: 400;\">Find out more about 3PL’s <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/amazon-fba-preperation-fulfilment\/\"><span style=\"font-weight: 400;\">Amazon fulfilment services<\/span><\/a><span style=\"font-weight: 400;\"> now<\/span><\/h2>\n<p style=\"text-align: center;\"><b>Find more advice for your eCommerce business on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/amazon-fba-what-are-the-advantages-and-disadvantages\/\"><b>Amazon FBA: What Are The Advantages And Disadvantages?<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-ship-products-using-amazon-fbm\/\"><b>How to Ship Products Using Amazon FBM<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/amazon-fba-or-fbm\/\"><b>Amazon FBA or FBM?<\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re selling goods through Amazon (be they your own or third party white label products) then you may automatically assume that Amazon’s FBA service is the best option for&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3299,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3298"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3298"}],"version-history":[{"count":3,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3298\/revisions"}],"predecessor-version":[{"id":3302,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3298\/revisions\/3302"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3299"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3298"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3298"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3298"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}