{"id":3311,"date":"2021-06-11T10:00:55","date_gmt":"2021-06-11T09:00:55","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3311"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"why-international-shipping-rates-are-so-high-and-what-this-means-for-ecommerce-stores","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/why-international-shipping-rates-are-so-high-and-what-this-means-for-ecommerce-stores\/","title":{"rendered":"Why International Shipping Rates Are so High and What This Means for eCommerce Stores"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">The Covid-19 pandemic has had multiple social, economic and cultural impacts. One of the most disruptive of these impacts has been the upheaval of the global shipping industry, which has resulted in higher shipping costs and significantly restricted capacity. So, what does this mean for your eCommerce store and what can you do to reduce your international shipping costs? <\/span><b><i>Read 3PL’s guide to find out. <\/i><\/b><\/p>\n<h2><span style=\"font-weight: 400;\">Why are international freight shipping costs so high right now? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">You might not think that shipping as an industry would be impacted by a pandemic, but in fact it’s been <\/span><i><span style=\"font-weight: 400;\">one of the worst hit sectors. <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">This is down to several reasons which we’ve detailed below. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Oil prices<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">When the epidemic became a pandemic in early 2020 and nations across the world began implementing lockdowns and other measures to prevent the spread of Covid-19, the major oil producing nations of OPEC+ drastically cut production of oil.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Oil supplies cannot be turned on and off like a tap, so any disruption to oil production has an enormous ‘ripple effect’. The result of the production cuts of early-2020 are still being felt in the form of a demand-supply imbalance &#8211; that’s another way of saying that oil supply hasn’t yet caught up with demand, meaning oil prices have risen considerably. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">International shipping firms are therefore facing higher operating costs, which means end users such as eCommerce stores are being hit with bigger shipping bills.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Surging demand<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As anyone who has ever studied economics will tell you, if something is in high demand, yet short in supply, the price of it will increase. That’s exactly the situation that many eCommerce stores that operate globally are facing right now with their shipping. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The past 18 months have proven to be an absolute boon for online retailers. With brick and mortar stores closed across most of the Western Hemisphere, consumers have flocked to online outlets. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, the global shipping industry has not been able to match this level of demand. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to restricted capacity amongst shipping firms, we are now also beginning to see restricted capacity in the manufacture of consumer goods such as furniture, household appliances and more. So both shipping firms and eCommerce stores are experiencing their own capacity issues. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Container shortage<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">At present, there just aren’t enough shipping containers for all of the goods that are being shipped internationally. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Covid-19 pandemic brought container production to a halt in early 2020 and since then manufacturers have struggled to step-up their production quotas to meet sky-high demand. This has had an enormous knock-on effect on the wider shipping industry, making it more expensive for eCommerce stores to ship their goods internationally. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Lack of new vessel deliveries<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As well as a shortage of containers the shipping industry is also facing a shortage of… ships. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In much the same way that a shut-down of production caused a shortage and backlog of containers, the same happened with ships. Fabrication yards across the world shut down during early 2020 meaning there will now be a reduced volume of new vessel deliveries through to at least 2023. As you would expect, with a limited number of ships, international shipping capacity will remain constricted, pushing up prices for eCommerce retailers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, shipping firms have acted rapidly to address this capacity issue. In the fourth quarter of 2020 alone, the volume of new vessel orders was more than three times that of the previous nine months of 2020. This flurry of new orders has continued in 2021 with orders in quarter one equalling an immense 1.45 million teu of capacity. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3316\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-scaled.jpg\" alt=\"Why are international shipping rates so high? \" width=\"2000\" height=\"1334\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-scaled.jpg 2000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-1024x683.jpg 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-768x512.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-1536x1024.jpg 1536w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-2048x1366.jpg 2048w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/Why-are-international-shipping-rates-so-high-min-900x600.jpg 900w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" \/>Limited air freight capacity<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If there’s another industry that’s been hit as hard as shipping by the pandemic, it’s aviation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Pushed to the precipice of insolvency during the early days of the pandemic, the aviation industry has struggled to recover. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">With international flight volumes having plunged due to travel bans and flight cancellations, there has been a shortage of ‘belly hold’ air freight capacity, pushing even more demand onto the shipping industry. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This appears to be an issue which isn’t going to be resolved any time soon, with air freight capacity expected to be constrained until at least 2023.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Brexit<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Brexit was always expected to create a greater or lesser amount of disruption to international shipping. In combination with Covid-19 it has caused a great deal of friction to trade. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The cost of shipping goods to and from the UK has increased significantly, as the UK has had to give up several subsidies that it previously received under the EU umbrella. With the transfer of goods to the UK now being counted as international shipments, the cost of shipments has increased in kind. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additional friction at the UK border, such as increased customs bureaucracy has resulted in some shipping firms rejecting previously agreed contracts, resulting in affected eCommerce companies having to pay increased spot rates. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Shipments to and from China<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As global demand for consumer products has exploded over the past 12 months, demand for containers in China has skyrocketed. China is the largest manufacturer in the world and as a result, Western nations are now spending double or even triple the amount they would have previously to secure goods from China. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, the increased cost of procuring goods from China has pushed up shipping rates for eCommerce retailers. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What can eCommerce stores do to reduce the cost of international shipping? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">All of the above may make pretty depressing reading, especially if a large percentage of your eCommerce store’s revenue comes from overseas customers or you’re reliant on importing your products from overseas. But, all is not lost. There are a number of actions you can take to help reduce the impact of higher international shipping costs on your business. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Advance planning<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This is one of the most effective ways of reducing the overall cost of your international shipping.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should strategically plan your shipments in advance. For example, if you’re an online retailer of garden furniture which you source from China, you should consider booking your container space as far in advance as you can. Whilst this may mean you have to order more furniture than you normally would, the shipping savings you will gain could offset the higher outlay on a larger volume of furniture. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should also look out for early bird facilities which are offered by some shipping companies. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Given the current bottleneck in international shipping, booking your shipping in advance can help you avoid any delays and ensure that you don’t run out of stock. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use historical shipping data<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">“If you don’t learn from history, you’ll be doomed to repeat it”. That’s a saying which certainly rings true at the moment.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can use historical data on freight costs to predict upcoming trends and price fluctuations. There are large amounts of historical freight data which are freely available online. <\/span><\/p>\n<p><b><i>Tip &#8211; if you want to leverage data to forecast the best times to book your shipping, try the OECD’s Maritime Transport Costs datasheet <\/i><\/b><a href=\"https:\/\/stats.oecd.org\/Index.aspx?DataSetCode=MTC\"><b><i>here<\/i><\/b><\/a><b><i>, or try the Lloyd’s List Containers Data Hub <\/i><\/b><a href=\"https:\/\/lloydslist.maritimeintelligence.informa.com\/markets\/containers\/data-hub\"><b><i>here<\/i><\/b><\/a><b><i>.<\/i><\/b><\/p>\n<h3><span style=\"font-weight: 400;\">Ship with multiple international shipping companies<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">It pays not to stick with one single shipping supplier. This is because shipping rates change continually (especially during this period of unprecedented volatility in the shipping market). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whilst it can be a pain using multiple different shipping partners, it can pay to review your shipping options on a regular basis. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s also important to think about which suppliers offer the best rates and services to different parts of the world. It’s rare that you’ll find a single shipping partner that can offer the best rates for every single country in the world. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you want to use multiple shipping partners, but don’t want to deal with all of the admin associated with this, then consider using a 3PL (more on that later).<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Choose the right insurance<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Overseas shipments, whether they are coming from a supplier to your warehouse, or from your warehouse to a consumer, can be more susceptible to damage. So, it pays to make sure you’ve got the right insurance. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Losses during transit can have a significant impact upon your business. Some international shipping providers include insurance as part of their shipping rates (generally up to a certain level). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, you’ll need to weigh up whether it’s cheaper for you to arrange your own insurance or to use a shipping partner that also provides insurance. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">By checking if your chosen shipping partner includes insurance or not, you can potentially reduce the cost of your international shipping. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Choose between FCL and LCL<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Depending on how many goods you’re looking to ship internationally, you may benefit from either booking an entire container, or just part of one. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Shipping companies generally offer these two options. For companies that only require a small amount of space and are happy to share a container with other customers, they can choose to book a container on a LCL basis. LCL stands for Less Than Container Load (and is also sometimes known as a part-load shipment). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, if you’re going to ship larger amounts of goods (for example, a large volume of garden furniture), then you will need to book a container on a FCL basis. FCL stands for Full Container Load (or sole-use shipment). This basically means you get an entire container to yourself. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Choosing the right option for you could save you a significant amount of money. You certainly don’t want to pay for an entire container if you’ll only end up filling half of it. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3317\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-scaled.jpg\" alt=\"How do you make international shipping cheaper?\" width=\"2000\" height=\"1333\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-scaled.jpg 2000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-1024x683.jpg 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-768x512.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-1536x1024.jpg 1536w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-2048x1365.jpg 2048w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/06\/How-eCommerce-stores-can-reduce-the-cost-of-international-shipping-min-900x600.jpg 900w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" \/>Choose truck or train freight<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you’re shipping internationally, but not across any oceans, then a cheaper alternative could be truck or train freight. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Trucks are very flexible and can provide door-to-door delivery. They are also not currently facing the kind of capacity issues that maritime shipping companies are facing. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Train freight is also relatively cheap. It’s also a particularly environmentally friendly way of shipping your goods. However, you’ll need to factor in transportation from the rail depot to the final destination, although there are an increasing number of last mile transport providers cropping up across the globe that can do this for you. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Get the paperwork right!<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">International shipping often involves the completion of quite detailed paperwork. It’s vital that you get this right, as mistakes can end up being very costly. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should ensure that all commercial invoice and customs documents have been completed correctly, including details of the item&#8217;s value, country of origin, sender details and the recipient’s details. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Failure to include those details can lead to fines and significant delays &#8211; neither of which you or your customer\/supplier want to incur!<\/span><\/p>\n<p><b><i>Tip &#8211; it’s important to check the country’s individual paperwork requirements, as these are not the same across the world.<\/i><\/b><\/p>\n<h3><span style=\"font-weight: 400;\">Check any shipping restrictions<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Different countries have different restrictions on the types of goods that can be imported. And, these restrictions change all the time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To save yourself from any potential fines, delays or even legal penalties, always check the country’s shipping restrictions before you send any goods.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Choose Ex Works (EXW) international shipping<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This is a shipping option which is definitely NOT for everyone. However, if it’s right for you, then it could save you an enormous amount of money on international shipping. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">EXW shipping places complete responsibility for arranging and paying for shipping on the buyer (you can see why this isn’t for everyone). All you need to do as the seller is provide all of the necessary documents for the export process. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">EXW is particularly suitable for very high value items where the buyer may wish to arrange their own shipping (for example a classic car). <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Choose Free On Board (FOB) international shipping<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">FOB shipping is similar to EXW shipping. Under FOB shipping, you as the seller are only responsible for the goods until they are onboard the ship (FOB shipping is usually only available from maritime shipping providers). As the seller you will still be responsible for providing the correct documents for the export process.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Once the goods are onboard, the buyer takes on the risks associated with the shipment and must arrange collection of the goods and passage through customs etc. As with EXB, FOB is certainly not suitable for every customer.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use 3PL<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The easiest and most effective way of reducing the cost of your international shipping is to partner with 3PL.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">3PL can take on the burden of arranging international shipping on your behalf. We get the world’s best shipping rates from the world’s best shipping companies. We are negotiating with shipping companies every day, at scale, for multiple customers, so we are able to access preferential rates that you wouldn’t be able to access on your own.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Plus, 3PL can help you with more than just international shipping. We can support you across the entirety of the fulfilment process, from storing, picking and packing your products through to performing quality controls and reviews to package tracking and dealing with customer service enquiries.<\/span><\/p>\n<h2 style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\"><span style=\"font-weight: 400;\">Find out how 3PL can reduce your international shipping rates today<\/span><\/a><\/h2>\n<p style=\"text-align: center;\"><b>Find more advice for your eCommerce business on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/going-global-what-are-the-advantages-of-global-logistics-for-ecommerce-stores\/\"><b>Going Global: What Are The Advantages of Global Logistics for eCommerce Stores?<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/faults-in-your-fulfilment-could-be-costing-you-money-heres-how-to-fix-it\/\"><b>Faults in Your Fulfilment Could Be Costing You Money. Here’s How to Fix It<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-are-the-key-factors-to-a-successful-ecommerce-order-fulfilment-process\/\"><b>What Are The Key Factors to a Successful eCommerce Order Fulfilment Process?<\/b><\/a><b>  <\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Covid-19 pandemic has had multiple social, economic and cultural impacts. One of the most disruptive of these impacts has been the upheaval of the global shipping industry, which has&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3313,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3311"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3311"}],"version-history":[{"count":3,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3311\/revisions"}],"predecessor-version":[{"id":3315,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3311\/revisions\/3315"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3313"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3311"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3311"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3311"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}