{"id":3350,"date":"2021-07-12T09:07:10","date_gmt":"2021-07-12T08:07:10","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3350"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"what-does-lead-time-mean-a-guide-for-ecommerce-businesses","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-does-lead-time-mean-a-guide-for-ecommerce-businesses\/","title":{"rendered":"What Does Lead Time Mean? A Guide for eCommerce Businesses"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Lead time. Two words that can mean different things to different people. If you’re running an eCommerce business and you want to keep your customers, suppliers, partners and staff happy, it’s important you have an accurate understanding of what lead time means and how it can impact your business. <\/span><b><i>Read on to find out everything you need to know about lead time. <\/i><\/b><\/p>\n<h2><span style=\"font-weight: 400;\">What is lead time?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Put simply, lead time is the length of time it takes from when a purchase order is raised and an item being delivered. We realise that might sound a little abstract, so here are some tangible examples of lead time:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The time it takes for your order of new products to arrive from your supplier at your warehouse. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The time it takes from a customer placing an order on your eCommerce website to the customer receiving their order. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Hopefully, that provides some context to the words ‘lead time’.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What are the different types of lead time? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Whilst the above examples provide you with an idea of what lead time is, it can be helpful for many eCommerce businesses to break down their lead times into different segments. This can help them differentiate between lead times for suppliers, partners and customers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Below are some examples of the different types of lead times that eCommerce businesses use.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Material lead time<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Material lead time refers to the production process of products. It is the amount of time it takes for an order of raw materials to be delivered to the factory\/place of manufacture. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Naturally, if you don’t manufacture your products directly, the material lead time is less of a concern, but it’s still worth bearing in mind when thinking about your inventory. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Production lead time<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This is a form of lead time which should certainly be at the front of mind for eCommerce businesses. Production lead time refers to the length of time it takes for a factory receiving an order to produce products and those products arriving at your warehouse. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Given that global supply chains are currently severely strained as a result of the Covid-19 pandemic, production lead time is something that is impacting eCommerce businesses across the globe. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Customer lead time<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This refers to the time from which a customer places an order on your website and receives it. This is the lead time over which you (arguably) have the most control. Whilst the other lead times described above are dependent on third parties, customer lead time is very much dependent on the effectiveness of your inventory management, logistics and shipping. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Cumulative lead time<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">These three different lead times combine to create the cumulative (or total) lead time for producing and delivering products. The overall lead time can be significant, stretching from a lumberyard in Malaysia where timber is created, the timber being supplied to a toy factory in China and the completed toys being shipped to an eCommerce warehouse in Birmingham, UK. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As you can imagine, there are multiple factors which can influence lead time at each stage of the production and delivery process. So, it’s important that where you can, you do all you can to improve overall lead time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The most significant lead time for customer satisfaction is obviously the customer lead time, however you need to think about the relationship between the different lead times:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">How will production lead time impact your inventory planning and cashflow? <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do you want to shorten customer lead time? Then you’ll also need to shorten your material and production lead times. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Can you balance production lead times versus customer lead times? <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Answering all of these questions can help you arrive at the right balance of different lead times. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Is lead time the same as cycle time or takt time? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Cycle time and takt time are two related, but different metrics than lead time. We’ve explained what each term means below.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Cycle time<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Cycle time refers to the amount of time it takes to <\/span><i><span style=\"font-weight: 400;\">manufacture <\/span><\/i><span style=\"font-weight: 400;\">a product from beginning to end. To figure out the cycle time of your product, take your net production time and divide that number by the number of products you can make during a production cycle. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Takt time<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Takt time refers to the amount of time it takes an individual (or a team), to complete the production process <\/span><i><span style=\"font-weight: 400;\">to satisfy customer demand. <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">This is best explained with a hospitality industry example. If a donut shop receives an order every 15 minutes, then it needs to produce enough donuts to be able to supply a customer with a donut every 15 minutes. If it can’t do that, then it won’t be keeping up with customer demand.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s useful to know the cycle and takt times for your eCommerce business. If you want to shorten your cumulative lead time, then you will need to adjust your workflows, in order to reduce both your cycle and takt times. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">How to calculate lead time for eCommerce stores<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are many different ways of calculating lead times. But, for eCommerce stores that predominantly sell products which have been manufactured on their behalf (or manufactured for a third party), the best way of calculating lead time is to combine two contributing factors: <\/span><i><span style=\"font-weight: 400;\">reordering delay <\/span><\/i><span style=\"font-weight: 400;\">and <\/span><i><span style=\"font-weight: 400;\">supply delay. <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Here’s what these two terms mean:<\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Reordering Delay &#8211; <\/b><span style=\"font-weight: 400;\">Reordering delay is the time it takes for your supplier to accept, process and begin actioning your purchase order. This is the first part of your lead time calculation.<\/span><\/li>\n<li aria-level=\"1\"><b>Supply Delay &#8211; <\/b><span style=\"font-weight: 400;\">This is the time it takes for your supplier (or a third party’s supplier) to ship the products to your warehouse. This is the second part of your lead time calculation and is generally the biggest contributory factor to long lead times. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">So, based on these factors, use the following formula to calculate lead time for your eCommerce store:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">Lead Time = Reordering Delay + Supply Delay<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Example of lead time calculation for eCommerce stores<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">How would this formula play out in real life? Let’s take a look at an example:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Outdoor footwear manufacturer, ‘Boot It’ sells 200 pairs of boots each week.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">It takes their supplier 1 day to process Boot It’s purchase order.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">It then takes the supplier 2 days to manufacture 200 boots.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Finally, it takes the supplier 3 days to ship the order to Boot It’s warehouse.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">This means that Boot It’s reordering delay is 1 day. The supply delay is 5 days (that’s manufacturing <\/span><i><span style=\"font-weight: 400;\">and <\/span><\/i><span style=\"font-weight: 400;\">shipping).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The formula in this instance would look like this:<\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"font-weight: 400;\">6 Days (Lead Time) = 1 Day (Reordering Delay) + 5 Days (Supply Delay = 2 Days Manufacturing + 3 Days Shipping)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">That all adds up to one important thing for Boot It. Their average lead time is 6 days. That means they will need to order 200 pairs of boots at least 6 days before they are expected to start selling this batch.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why shorter lead times are important for eCommerce stores<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Is lead time all that important? Yes! As you’ll be well aware, customer expectations have changed thanks to companies such as Amazon, Uber and others. Today, customers expect to be able to place an order online and have it arrive very quickly. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If your lead times (at whatever stage of the production or delivery process) are too long, you’ll have unhappy customers on your hands. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But, aside from improved customer satisfaction, shorter lead times will provide other benefits for your eCommerce store:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You can maintain a leaner warehouse, with less inventory. With shorter lead times, you can optimise your warehouse, creating something closer to a ‘just on time’ inventory process.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You improve your ‘cash at hand’ situation. With shorter lead times, you have cash in hand for longer. This means you can use this liquidity to replenish your inventory faster and gain new customers. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Flexibility. With a shorter lead time, you will be impacted less by unexpected market fluctuations. As we’ve seen since the Covid-19 pandemic, it’s companies that have shorter lead times that have had fewer disruptions to trade. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Seasonality. Depending on what vertical you are in, seasonality can be an important factor in your sales performance. Shorter lead times mean you are less likely to miss these important selling windows.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Competitive edge. Shorter lead times will also give you an edge over your competitors. If you are able to replenish your stock quicker than your competitors (thanks to a shorter lead time), then you’ll pick up customers who can’t get their desired items elsewhere.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">It’s also important to turn this point on its head and consider how long lead times negatively impact your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Longer lead times result in inefficient resource use, higher shipping costs (e.g. you may have to pay more for faster delivery than you normally would to compensate for a long lead time), excessive inventory in your warehouse and more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It really does pay to shorten the cumulative lead time of your products. <\/span><\/p>\n<p><img decoding=\"async\" class=\"aligncenter size-full wp-image-3351\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-scaled.jpg\" alt=\"What are the lead times for ecommerce stores\" width=\"2000\" height=\"1333\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-scaled.jpg 2000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-1024x683.jpg 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-768x512.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-1536x1024.jpg 1536w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-2048x1365.jpg 2048w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-are-the-lead-times-for-ecommerce-stores-900x600.jpg 900w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" \/><\/p>\n<h2><span style=\"font-weight: 400;\">How to reduce lead time for your eCommerce store<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Now that you’ve read about the importance of reducing lead time, what can you do to make shorter lead times a reality for your business? We’ve set out some recommendations below. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Of course, some of these will be more or less relevant to you depending on the industry\/vertical in which you operate, but we’d recommend thinking about them all.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Change to more efficient shipping methods<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">One of the most common causes of longer lead times is inefficient shipping methods. Depending on where you source your products from, you may want to consider changing from marine to air freight. You could switch from road to rail or vice versa. There are also a wealth of new last mile delivery services which can improve your overall lead times. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Establish contracts with suppliers that include timeframes<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Holding your suppliers to account is another way of shortening your cumulative lead times.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Where possible you should get your suppliers to sign a ‘lead time contract’. Some suppliers will claim they can achieve impressive turnaround windows. That’s great, but sometimes it’s just talk. See if you can get them to sign a legally binding agreement with set timeframes for delivery. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The sort of things you’d want to include in a lead time contract could include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Set delivery times for your highest priority products. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Penalties or fines for late deliveries. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Liability for damaged or incorrect products. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Advanced notice of delays, price changes or material shortages that will impact your cumulative lead time. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">If you can get a supplier to agree to a lead time contract, you’ll go a long way toward improving those parts of your lead time that you don’t directly have control over. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Offer incentives to your suppliers<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">It can pay to use the carrot as well as the stick with your suppliers. In addition to making them agree to delivery deadlines, you should also offer them incentives for fulfilling orders on time (or ahead of time!). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A combination of carrot and stick will make your suppliers more likely to stick to agreed fulfilment dates.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Source materials or products locally<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As we’ve seen since the start of the Covid-19 pandemic, sourcing your products from the other side of the globe can have dire consequences on your lead times should any disruptions occur. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sourcing your materials or products locally can help you protect your supply chain from transport-based disruptions. Whilst international suppliers may offer you lower prices, the cost of transportation and warehousing may actually negate any upfront saving. It’s worth doing the maths to see if a local supplier works out to be better value. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Streamline your ordering process<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Your ordering process may be making your lead times longer than they need to be. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Examine each stage of your ordering process and streamline it where possible. For example, do you necessarily need a hierarchy of permissions to place a small order? Are there any form filling or ordering processes which can be eliminated or streamlined? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Any steps you can take to reduce the admin associated with ordering can help to shorten lead times. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Automate your ordering process<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As well as streamlining your ordering process, you should consider automating it too. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re working with a fairly sophisticated supplier, then you may be able to integrate your eCommerce store to their supply systems, triggering automatic orders once stock levels get too low.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If it’s possible to integrate your inventory management software with your supplier’s, you can significantly reduce reordering delay and therefore your lead time. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Share data with suppliers<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Where possible, you should try and share sales data with your suppliers (unless it’s particularly commercially sensitive). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a supplier can see your sales data, they will be able to more accurately forecast peaks in demand, incoming order volumes etc. That way, they’ll be better prepared to support you and can help reduce your lead times. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Place smaller orders, more frequently<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Depending on the type of products you are ordering, placing a large, bulk order may significantly increase the lead time. Instead, consider placing smaller orders, on a more regular basis.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Before doing this though, weigh up the saving in lead time versus the additional admin that this approach may involve for your eCommerce business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use 3PL for your eCommerce orders and fulfilment<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Whilst the actions outlined above can help you reduce your overall lead time, perhaps the easiest and most cost-effective way of reducing your lead times is to partner with 3PL. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">At 3PL we offer a fully integrated, end-to-end fulfillment service that’ll save you time, money and hassle &#8211; and shorten your lead times!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s how it works:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You create, market and sell an incredible product (or products). <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You (or your supplier) send the products directly to 3PL. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your sales channels (such as an eCommerce store, Amazon store, eBay store) can be integrated into a single dashboard (3PL Fusion). This means that we receive your orders on your behalf and begin fulfilling them. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">3PL performs a quality control review of your products when they arrive with us.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Once we begin to receive orders through the dashboard, we pick and pack the orders (which can be tailored to your guidelines e.g. brand packaging).<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">3PL arranges the best shipping rates from the best carriers. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your customer receives an email and tracking number. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your customer gets their order and is happy!<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">We take the hassle out of order processing and fulfilment so you can concentrate on your eCommerce efforts and increase your sales. <\/span><\/p>\n<h2 style=\"text-align: center;\"><span style=\"font-weight: 400;\">Reduce your lead times: <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\"><span style=\"font-weight: 400;\">speak to 3PL<\/span><\/a><span style=\"font-weight: 400;\"> today<\/span><\/h2>\n<p style=\"text-align: center;\"><b>Find more eCommerce advice on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/inventory-valuation-methods-your-ecommerce-store-needs-to-know\/\"><b>Inventory Valuation Methods Your eCommerce Store Needs to Know<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-landed-cost-a-complete-guide\/\"><b>What Is Landed Cost? A Complete Guide<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-dead-stock-and-how-to-deal-with-it\/\"><b>What Is Dead Stock and How to Deal With It<\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Lead time. Two words that can mean different things to different people. If you’re running an eCommerce business and you want to keep your customers, suppliers, partners and staff happy,&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3352,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3350"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3350"}],"version-history":[{"count":2,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3350\/revisions"}],"predecessor-version":[{"id":3355,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3350\/revisions\/3355"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3352"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3350"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3350"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3350"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}