{"id":3374,"date":"2021-07-22T13:19:17","date_gmt":"2021-07-22T12:19:17","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3374"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"a-guide-to-shipping-crowdfunded-projects","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/a-guide-to-shipping-crowdfunded-projects\/","title":{"rendered":"A Guide to Shipping Crowdfunded Projects"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Yes! Your crowdfunding campaign has been a success and you’ve met your funding target. Now you’ll be able to make that innovative new product you’ve been working on a reality. But, wait. You’re now facing a logistical challenge. How are you going to get your shiny new product to those hundreds (or even thousands) of crowdfunding supporters!? <\/span><b><i>Well, keep reading and 3PL will tell you how with our guide to shipping crowdfunded projects…<\/i><\/b><\/p>\n<h2><span style=\"font-weight: 400;\">What is crowdfunding? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Unless you’ve been living under a rock for the past five or more years, you’ll probably be aware of what crowdfunding is. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, we want to provide a definition as crowdfunding has become something of a generic term, covering several different ways of collectively raising money (some of which shouldn’t really be classed as crowdfunding). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, what is crowdfunding then?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In the simplest terms, crowdfunding involves receiving many small sums of money from large numbers of people to fund a new project or develop a product. In the majority of crowdfunding campaigns, funders will either receive a reward for donating (if they are funding a project), or they’ll receive the product (if they are funding a new product).<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What crowdfunding platforms are there? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If you’re looking to crowdfund for a new product, then there are quite a few different crowdfunding platforms to choose from. Some are industry specific (e.g. for creative\/arts-based projects), whilst others are more generic and will accept pretty much any project or product campaign. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Below we’ve detailed some of the most popular crowdfunding platforms currently in operation. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Indiegogo<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Indiegogo is one of the world’s most popular crowdfunding sites, having successfully funded more than 800,000 ideas since its founding in 2008. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Indiegogo receives more than 15 million website visits each month and is available in over 230 countries. It also allows entrepreneurs to integrate their campaign with other platforms such as Google and Facebook, so they can more effectively market their project or product. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Kickstarter<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Kickstarter is a popular platform amongst entertainers and artists, but it’s also been used to launch successful products across the world. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Since the platform’s launch in 2009, over 20 million people have backed a project on Kickstarter, with over 205,000 projects being successfully funded. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Funding Circle<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Funding Circle is a UK-based platform which specialises in peer-to-peer lending. The platform connects creditworthy businesses looking for finance with people or organisations that have money to lend. Whilst Funding Circle is a more ‘serious’ platform than the others listed above, it’s still been used successfully by entrepreneurs to launch new products. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">These are just a few of the many different crowdfunding platforms currently in operation. So, once you’ve chosen your desired platform, launched your project and had it successfully funded, you’ll be faced with the challenge of shipping out your product to those eager backers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Below, we’ll take you through the things you need to think about when shipping crowdfunded projects. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3379\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-scaled.jpg\" alt=\"What you need to know when shipping a crowdfunded project\" width=\"2000\" height=\"1333\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-scaled.jpg 2000w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-300x200.jpg 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-1024x683.jpg 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-768x512.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-1536x1024.jpg 1536w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-2048x1365.jpg 2048w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/What-you-need-to-know-when-shipping-a-crowdfunded-project-900x600.jpg 900w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" \/>How to effectively ship crowdfunded projects<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Before you rush out and sign up with a shipping company, there are many different things you should consider in order to make the shipping of your crowdfunded project profitable, successful and headache free.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Set up a budget<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">What’s the point in crowdfunding a new product, if you end up losing money on it? You won’t be in business long if you take that approach, so it’s vital that you establish a budget for shipping.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should ideally establish a budget for shipping <\/span><i><span style=\"font-weight: 400;\">before <\/span><\/i><span style=\"font-weight: 400;\">you launch your crowdfunding project. You’d be surprised how often people overlook this part of crowdfunding campaigns.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Yes, you’re launching the campaign so you can fund the manufacture of your new product, but if you don’t also raise enough cash to also cover shipping, you’ll be in financial trouble.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Setting a budget can make a really big difference to the overall profitability of your campaign. According to some calculations, establishing a budget and planning in advance can cut spending so that shipping only accounts for 15-20% of your funds raised. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Decide where you’ll ship to<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Another key part of successfully shipping crowdfunding projects, is deciding where you’ll ship your products to. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should begin by looking at the audience of your chosen crowdfunding platform. Some crowdfunding platforms are very US-centric, meaning that as much as 60% of your potential funders could be based in the USA. If you’re happy to ship to the US, that’s great. But if you’re not, then you’ll need to find a platform with an audience located in places you’re happy to ship to. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you are happy to ship internationally, then you’ll need to take into account the different rules that apply in different countries. Partnering with a 3PL can help remove much of the hard work that goes into figuring out international shipping factors (but more on that later). <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Work out the applicable taxes and duties<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you’ve decided to ship your product internationally (and many crowdfunders do, due to the international audiences of most crowdfunding platforms), then you’ll need to work out which taxes and duties you’ll have to pay for each region and country you’re shipping to. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if you’re shipping into the European Union then there are a variety of import taxes, customs duties, brokerage fees and other potential taxes that you’ll have to pay. If a very large percentage of your backers live in the EU, then it may be better to ship from within the EU itself. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">No matter where you’re shipping to, the most important thing is to plan ahead and make sure you’re familiar with all of the applicable rules and regulations. Get this wrong and you risk landing your backers with hefty customs bills and other charges &#8211; not the sort of ending you want for your crowdfunding campaign!<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Packaging<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Packaging is more important than many people realise. Before you buy a load of packaging, you should first establish the dimensions and weight of your product. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is as simple as measuring the length, width and height of the product. Once you’ve done this and you’ve bought appropriate packaging, you should fully package up a product and then weigh it (that’s because a box or packet can sometimes add crucial grams to the overall weight). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Shipping carriers sometimes round up to the nearest kilogram, so it really can pay to keep your packaging as light as possible.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"aligncenter size-full wp-image-3380\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-scaled.jpg\" alt=\"The things you should do when shipping a crowdfunded project\" width=\"1433\" height=\"1500\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-scaled.jpg 1433w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-286x300.jpg 286w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-978x1024.jpg 978w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-768x804.jpg 768w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-1467x1536.jpg 1467w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/07\/The-things-you-should-do-when-shipping-a-crowdfunded-project-1956x2048.jpg 1956w\" sizes=\"(max-width: 1433px) 100vw, 1433px\" \/>Estimate the number of packages<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">As well as figuring out the size and weight of your packages, you should try and calculate how many total packages you’ll be sending out. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’ve set a concrete goal in your crowdfunding campaign, then this should be straightforward. For example, if it takes 100 pledges to meet the funding target for your new product, then you know you’ll be sending out 100 packages. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">By calculating the total number of packages you’ll be sending, you’ll be able to take advantage of batch fulfillment (i.e. sending everything at once). Many shipping carriers will provide you with a discount if you’re sending a large number of packages at once. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Instead, if you decide to send your packages on an ad-hoc basis, you’ll end up spending a lot more overall on shipping. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">How quickly will you send your product to backers? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">How quickly will your backers expect their product? This is an important question to answer if you’re going to make your crowdfunding project a success. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Naturally, many individuals are happy to wait whilst a crowdfunding project heads towards its target, but as soon as a project becomes fully-funded, they’ll want to know that their product is on the way. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">How quickly you send your products to your product’s backers largely depends on how much you’re willing to pay for shipping. The faster the delivery, the more you’ll pay.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’ve worked out your shipping budget, then you’ll know how much you can spend to ship each item. You should set expectations on the crowdfunding project page, and make it clear to funders how you’ll be sending the project e.g. first class, second class, expedited. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This should reduce the number of queries you get from people asking where their product is…<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Think about returns<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">People may have pledged money to buy your product and eagerly awaited it’s arrival. But that doesn’t mean they might not want to return it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Unfortunately, like any eCommerce transaction, there will always be instances where someone wants to return an item they’ve paid for. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re crowdfunding a tangible, manufactured product, then it’s absolutely essential that you have a clearly articulated warranty and returns policy in place before you launch your campaign. If you’re not sure what sort of warranty or returns policy you should put in place, try researching similar products on crowdfunding sites and see what they offer. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to returns, you should also factor in lost shipments (particularly if you are shipping internationally). <\/span><\/p>\n<p><b><i>Tip &#8211; It’s a good idea to create 3% more inventory as an overage to cover lost shipments. <\/i><\/b><\/p>\n<h3><span style=\"font-weight: 400;\">Communicate with your backers<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">One of the most important things you can do to make the shipping of your crowdfunded products as smooth as possible is to communicate as much as possible with the backers\/funders of your project. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You should expect to receive questions from multiple different channels &#8211; directly via email and telephone, but also indirectly via Twitter, the comment section of your crowdfunding page and elsewhere. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As with other forms of eCommerce customer service, the aim should be to contact the customer, before they have to contact you. If they end up having to contact you for updates, they’ll get frustrated or even angry!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However you do it, make sure that you communicate regularly with your backers, notifying them when their product has shipped, and alerting them to any potential delays or issues. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why you should use a 3PL to fulfill your crowdfunded project<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If you’ve made it this far, then it’ll be clear that there’s an enormous amount of time, effort and (potentially) money that goes into the fulfillment of a crowdfunded project. That’s time that you could spend more profitably elsewhere, such as marketing your product or working on your next product. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But, there is a solution. You can partner with a 3PL that’ll take care of every aspect of fulfilling and shipping your crowdfunded project on your behalf. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The advantages of using 3PL for crowdfunding fulfillment<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">So, why should you choose 3PL to fulfill your crowdfunded project? We’ve set out some of the key advantages below. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">We are the experts!<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">3PL spends all day, every day fulfilling and shipping products on behalf of companies and individuals. We have dedicated experts and advanced facilities to ensure that everything runs smoothly, that products are picked and packed properly, that the shipping is cost-effective and reliable. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re going to entrust anyone with the delivery of your crowdfunded project, it should be 3PL.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">We provide you and your customers with support<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Arranging international shipping can be a complicated business, but when you choose to work with 3PL you’ll be assigned a dedicated account manager who will be on-hand to offer you support and answer any questions you may have about the fulfillment process. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">At 3PL we are also able to offer customer support services (via dedicated call centres and\/or app notifications), answering your customers’ questions on your behalf and keeping backers updated on the progress of their product. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">You’ll benefit from rapid, cost-effective delivery<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Because we send out large volumes of packages everyday, we are able to secure the best rates from the best shipping carriers. By working with 3PL you’ll get the sort of rates that’d be impossible to get on your own.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Should you work with 3PL? <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">If you’re not sure if using 3PL to fulfill your crowdfunding project is the right thing for you, there’s a simple answer &#8211; ask us! Our friendly team is happy to discuss your requirements with you and provide you with more information about our dedicated <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/crowdfunding-fulfilment\/\"><span style=\"font-weight: 400;\">crowdfunding fulfillment services<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<h2 style=\"text-align: center;\"><span style=\"font-weight: 400;\">Take the hassle out of your crowdfunding fulfillment by <\/span><a href=\"https:\/\/www.3p-logistics.co.uk\/contact\/\"><span style=\"font-weight: 400;\">speaking to 3PL<\/span><\/a><span style=\"font-weight: 400;\"> today<\/span><\/h2>\n<p style=\"text-align: center;\"><b>Find more eCommerce advice on the <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><b>3PL blog<\/b><\/a><b>…<\/b><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/why-you-should-use-a-3pl-for-your-amazon-fulfilment\/\"><b>Why You Should Use a 3PL for Your Amazon Fulfilment<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-pick-the-best-shipping-company-for-your-ecommerce-store\/\"><b>How to Pick the Best Shipping Company for Your eCommerce Store<\/b><\/a><b> | <\/b><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/5-ways-to-improve-your-order-fulfillment-process\/\"><b>5 Ways to Improve Your Order Fulfillment Process<\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yes! Your crowdfunding campaign has been a success and you’ve met your funding target. Now you’ll be able to make that innovative new product you’ve been working on a reality&#8230;.<\/p>\n","protected":false},"author":1,"featured_media":3376,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11,10],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3374"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3374"}],"version-history":[{"count":3,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3374\/revisions"}],"predecessor-version":[{"id":3378,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3374\/revisions\/3378"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3376"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}