{"id":3499,"date":"2021-10-11T16:16:13","date_gmt":"2021-10-11T15:16:13","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3499"},"modified":"2022-05-30T14:59:29","modified_gmt":"2022-05-30T13:59:29","slug":"guide-to-winning-the-amazon-buy-box-and-making-more-sales","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/guide-to-winning-the-amazon-buy-box-and-making-more-sales\/","title":{"rendered":"Guide to Winning the Amazon Buy Box and Making More Sales"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221; bg_image_animation=&#8221;none&#8221;][vc_column_text]As one of the world’s biggest online retailers, Amazon holds a commanding position in the world of eCommerce.<\/p>\n<p>If you’re selling your products through Amazon then you’re going to be competing with hundreds, even thousands, of competitors. So, if you want your product to cut through the noise and achieve major sales, you’ll need to win the Amazon Buy Box. But what exactly is it? How do you win it?<strong><em> Keep reading and 3PL will answer these questions and more…<\/em><\/strong><\/p>\n<p>&nbsp;<\/p>\n<h2>What is the Amazon Buy Box?<\/h2>\n<p>As an Amazon seller, the Amazon Buy Box is potentially the most important element in determining whether you make a major number of sales or not.<\/p>\n<p>Because there’s no limit on the number of sellers who can use the Amazon platform (it’s an online ‘marketplace’ after all), you will find that there are usually multiple sellers who are selling the same item.<\/p>\n<p>This creates intense competition to appear at the top of search results.<\/p>\n<p><strong>So, Amazon created the Buy Box:<\/strong><\/p>\n<p><img decoding=\"async\" class=\"alignnone wp-image-3502 size-full\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Box.png\" alt=\"Amazon Buy Box Used Items\" width=\"368\" height=\"524\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Box.png 368w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Box-211x300.png 211w\" sizes=\"(max-width: 368px) 100vw, 368px\" \/><\/p>\n<p>The Buy Box is, as the name suggests, a small box that sits just beneath the ‘Add to Basket’ part of a product page.<\/p>\n<p>The Buy Box effectively offers consumers an alternative choice when shopping for a popular item. The Box will typically show the seller’s name as well as their price for the item &#8211; however, it can also show other details such as delivery options, gift wrapping selection etc.<\/p>\n<p>And, it’s fantastically effective!<\/p>\n<p><strong><em>It’s estimated that over 80% of Amazon sales are driven by the Buy Box.<\/em><\/strong><\/p>\n<p>We’re not exaggerating when we say that getting your product to appear in the Buy Box can have a transformative impact on your business.<\/p>\n<p>So, let’s take a look at how you go about winning a place in that coveted Buy Box!<\/p>\n<h2>How do you become eligible for the Buy Box?<\/h2>\n<p>Before you start dreaming about all of the money that’ll come rolling in from your Buy Box placement, you first need to make sure you have some fundamental things in place in order to get there.<\/p>\n<p>Whilst there’s no sure-fire formula for ‘winning’ the Buy Box (it’s determined by one of Amazon’s many mysterious algorithms after all), you should ensure you have the following things in place.<\/p>\n<h3>Pro-merchant account<\/h3>\n<p>First of all, you’re going to need to make sure you have a pro-merchant account (also known as a Professional Selling Plan (PSP).<\/p>\n<p>This involves signing up to a monthly subscription, however it opens up a series of professional selling tools that improve your Amazon merchant experience.<\/p>\n<h3>Buy Box eligibility status<\/h3>\n<p>As you can imagine, competition for the Buy Box is fierce, so Amazon only makes certain sellers eligible. You can check whether you are eligible by looking at Amazon Seller Central. If you’re wondering <em>how <\/em>you actually become eligible, then keep reading. We’ll provide you with more information later on in this article.<\/p>\n<h3>New items<\/h3>\n<p>Are you selling second-hand items on Amazon? If your answer is yes, then you can say goodbye to winning the Buy Box. Only new items are eligible for Buy Box status.<\/p>\n<p><em>However, <\/em>you can get your used items to appear on a separate Buy Used Box<\/p>\n<h3><img decoding=\"async\" class=\"alignnone wp-image-3501 size-full\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Used-Box.png\" alt=\"Amazon Buy Box Used Items\" width=\"1528\" height=\"770\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Used-Box.png 1528w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Used-Box-300x151.png 300w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Used-Box-1024x516.png 1024w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Amazon-Buy-Used-Box-768x387.png 768w\" sizes=\"(max-width: 1528px) 100vw, 1528px\" \/><\/h3>\n<h3>Inventory<\/h3>\n<p>You actually need to make sure you have plenty of your items in stock!<\/p>\n<p>If Amazon can see that you don’t have sufficient inventory, then they simply award the Buy Box to a merchant that does…<\/p>\n<p>Once you’ve got these fundamental things in place, you can start to refine and hone your account further to maximise your chances of winning the buy box.<\/p>\n<p>And, that’s just what we’ll cover in the next section of this article…<\/p>\n<h2>How to maximise your chances of winning the Amazon Buy Box<\/h2>\n<p>Okay, so you’ve got the basics boxed off. Now what? Even some cursory Googling will bring up hundreds, even thousands, of recommendations.<\/p>\n<p>We know that eCommerce retailers are generally hard-pressed for time, so you can’t afford to waste your precious resources optimising for a factor that isn’t going to improve your chances of winning the Buy Box.<\/p>\n<p>So, we’ve created a ‘priority list’ of actions &#8211; rated on how more or less likely they are going to help you to win the Buy Box &#8211; below.<\/p>\n<p>&nbsp;<\/p>\n<p><img decoding=\"async\" class=\"alignnone wp-image-3500 size-full\" src=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Unknown.png\" alt=\"Infographic - How to Win The Amazon Buy Box\" width=\"715\" height=\"803\" srcset=\"https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Unknown.png 715w, https:\/\/www.3p-logistics.co.uk\/wp-content\/uploads\/2021\/10\/Unknown-267x300.png 267w\" sizes=\"(max-width: 715px) 100vw, 715px\" \/><\/p>\n<h3>Be signed up to FBA or Seller Fulfilled Prime<\/h3>\n<p>This is the absolute number one thing you need to do to win the Amazon Buy Box.<\/p>\n<p>Whether you choose Fulfillment by Amazon (FBA) or Seller Fulfilled Prime, it’s important that you use one of these services. Both have their pros and cons, but if you want to be rewarded with a placement in the Buy Box, you need to show Amazon that you’re willing to play by their rules and integrate your business into their shipping and fulfilment networks.<\/p>\n<p>There is also an opportunity for Fulfillment by Merchant (FBM) sellers to achieve Buy Box status, however, it’s generally much harder for them to do so compared to FBA sellers. If you want to find out more about the pros and cons of both FBA and FBM read our <a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/amazon-fba-or-fbm\/\">guide here<\/a>.<\/p>\n<p><strong><em>Guide &#8211; if you’re wondering if Seller Fulfilled Prime is right for you, read our <\/em><\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/is-amazon-seller-fulfilled-prime-worth-it-the-pros-cons-and-requirements\/\"><strong><em>guide here<\/em><\/strong><\/a><strong><em>.<\/em><\/strong><\/p>\n<p>Whether you choose FBA, FBM or Seller Fulfilled Prime, you need to make sure you are signed up to at least one of these to be in with a chance of winning the Amazon Buy Box.<\/p>\n<h3>Price with shipping<\/h3>\n<p>As you would expect, the price of your item has a huge impact on your chances of winning the Buy Box.<\/p>\n<p>Amazon has an obsessive focus on customer satisfaction, and a core part of making customers satisfied is offering the best possible prices on items.<\/p>\n<p>You need to ensure that the sale price of your item (along with the cost of shipping) is as competitive as possible. This is especially important if you are selling a highly commodified item with lots of sellers (e.g. a household consumable or common piece of stationery).<\/p>\n<h3>Percentage of perfect orders<\/h3>\n<p>Are you a perfectionist? You better be if you want to win the Buy Box.<\/p>\n<p>This is another one of the most important factors that’ll influence your chances of winning that coveted position.<\/p>\n<p>If you are to attain the Buy Box for your item, then ideally you should have a 100% perfect rating for your orders. As an absolute minimum, you should have a 95% rating. When assessing this factor Amazon will specifically look at your order history over the last 90 days.<\/p>\n<h3>Delivery time<\/h3>\n<p>Convenience is one of Amazon’s core USPs, so it expects Buy Box sellers to be able to fulfil and deliver their items as soon as possible.<\/p>\n<p>If you can fulfil your orders within a minimum of 2 days, then you’ll be firmly in Buy Box territory. Having said that though, Buy Box status has occasionally been granted to merchants that fulfil their items in no more than 14 days.<\/p>\n<h3>Percentage of defective products<\/h3>\n<p>To be blunt, Amazon wants to see that you have a track record of sending out <em>zero <\/em>defective products. To determine your overall percentage of defective products, Amazon takes into account negative feedback against your account, the number of A-Z guarantee claims against you, and chargeback rates.<\/p>\n<p>This is a factor where Amazon is particularly stringent. Unfortunately, you don’t get much leeway, so even a defective product percentage of over 1% can rule you out of Buy Box eligibility.<\/p>\n<h3>Feedback score<\/h3>\n<p>What are your customers saying about you? And, how many of them are saying something at all? When determining Buy Box status, Amazon looks at the total amount of feedback that you have received, and what percentage of that feedback is good or bad. This provides you with a feedback score.<\/p>\n<p>Naturally, the higher your feedback score, the higher the chances you’ll win the Buy Box for your product.<\/p>\n<h3>Percentage of on-time deliveries<\/h3>\n<p>It’s not merely enough to clearly set out your delivery times (be it up to 2 days &#8211; the ideal &#8211; or slightly longer), you actually have to meet them!<\/p>\n<p>One of the core reasons that people buy from Amazon is because they know they’ll receive whatever they’ve ordered at the time that’s promised. If you break that promise &#8211; and have less than a 100% record of fulfilling orders on time &#8211; you won’t be getting that Buy Box.<\/p>\n<h3>Valid tracking rate<\/h3>\n<p>100%. That’s the percentage of your orders that need to be shipped with tracking numbers if you are to win the Buy Box. Again, this feeds into Amazon’s promise to customers that they’ll not only get their orders on time but will be able to track the progress of their order.<\/p>\n<p>Amazon will accept a 95% rate or higher, but ideally, you should be aiming for 100%. Amazon checks your compliance with this metric over the last 30 days.<\/p>\n<h3>Late shipment<\/h3>\n<p>Another delivery-focused metric that Amazon uses to determine who should win the Buy Box is the number of your orders which have been shipped late.<\/p>\n<p>Remember, Amazon sees itself first and foremost as a logistics company. It’s because of the efficient, accurate and <em>timely <\/em>delivery of products that many people choose to shop with Amazon.<\/p>\n<p>So, to win the Buy Box you should have a late shipment rate of 0%. However, you can still be in with a chance of achieving Buy Box status if you have a rate of 4% or less.<\/p>\n<h3>Feedback<\/h3>\n<p>If you’re not actively encouraging customers to leave reviews and feedback on your products, then you should be!<\/p>\n<p>When determining which merchants should get Buy Box status, Amazon <em>will look at the percentage of customers who leave feedback. <\/em>Whilst this isn’t as high a priority as some of the other factors on this list, it’s best practice to accrue as many customer reviews as you can.<\/p>\n<p>Aside from achieving Buy Box status, positive customer reviews can lead to more sales in general.<\/p>\n<h3>Stock reliability<\/h3>\n<p>As we mentioned earlier, you should ensure you always have sufficient inventory in place to fulfil orders. Consumers don’t want to click on an item only to find it’s out of stock. Again, this is particularly important when you’re selling an item that is widely available from other merchants.<\/p>\n<h3>Cancellations<\/h3>\n<p>Yes, we know that some cancellations are completely out of your hands, but Amazon likes to reward sellers with low cancellation rates with the Buy Box.<\/p>\n<p>Ideally, you’ll have a 0% cancellation rate &#8211; but we have seen merchants win the Buy Box who have cancellation rates of around 2.5%.<\/p>\n<h3>Refund request<\/h3>\n<p>As with cancellations, Amazon prefers to award the Buy Box to merchants who have a low percentage of refund requests.<\/p>\n<p>Amazon wants merchants to get things right first time. A refund request is an indication that a merchant has failed to do that &#8211; so the more refund requests you have against your account, the less likely you are to win that coveted Buy Box.<\/p>\n<h2>Improve your Amazon fulfilment with 3PL<\/h2>\n<p>Whether you are signed up to Amazon FBA, FBM or Seller Fulfilled Prime, we know that things can sometimes get complex, stressful and downright difficult to manage.<\/p>\n<p>That’s why you should choose 3PL to help you with your Amazon fulfilment. As experts in inventory management, quality assessment, picking, packing and fulfilment, 3PL can remove the stress involved with managing your Amazon fulfilment &#8211; leaving you to concentrate on what you do best &#8211; marketing and selling your awesome products!<\/p>\n<p><strong><a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\" rel=\"\">Let’s chat<\/a>…<\/strong><\/p>\n<h2 style=\"text-align: center;\">Find out more about 3PL’s <a href=\"https:\/\/www.3p-logistics.co.uk\/amazon-fba-preperation-fulfilment\/\">Amazon fulfilment services<\/a><\/h2>\n<p style=\"text-align: center;\"><strong>Find more eCommerce business, marketing and fulfilment advice on the <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><strong>3PL blog<\/strong><\/a><strong>…<\/strong><\/p>\n<p style=\"text-align: center;\"><strong> <\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-ship-products-using-amazon-fbm\/\"><strong>How to Ship Products Using Amazon FBM<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/why-you-should-use-a-3pl-for-your-amazon-fulfilment\/\"><strong>Why You Should Use a 3PL for Your Amazon Fulfilment<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/is-amazon-seller-fulfilled-prime-worth-it-the-pros-cons-and-requirements\/\"><strong>Is Amazon Seller Fulfilled Prime Worth It? (The Pros, Cons and Requirements)<\/strong><\/a><\/p>\n<p> [\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221;&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3501,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3499"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3499"}],"version-history":[{"count":2,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3499\/revisions"}],"predecessor-version":[{"id":3504,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3499\/revisions\/3504"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3501"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3499"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3499"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3499"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}