{"id":3763,"date":"2022-03-16T16:08:37","date_gmt":"2022-03-16T16:08:37","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3763"},"modified":"2022-03-16T16:17:45","modified_gmt":"2022-03-16T16:17:45","slug":"guide-to-sku-management-ecommerce-best-practices","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/guide-to-sku-management-ecommerce-best-practices\/","title":{"rendered":"Guide to SKU Management: eCommerce Best Practices"},"content":{"rendered":"<p>If you’re running an eCommerce store that sells multiple lines of products (and variations of those products), you’ll know that managing your SKUs, and by extension your inventory, can be a challenging process. But there are some solutions that&#8217;ll make things easier. <strong><em>Keep reading and the 3PL team will tell you about the best SKU management practices for eCommerce businesses…<\/em><\/strong><\/p>\n<h2>What is an SKU?<\/h2>\n<p>If you’re a fledgling eCommerce business, or if you’re completely new to the world of retail, then you may be wondering what an SKU is.<\/p>\n<p>SKU is an acronym which stands for ‘stock keeping unit’. It’s a unit of measurement which is designed to make it easier for retailers to clearly categorise different types of products within their inventory.<\/p>\n<p>SKUs are typically made up of a series of letters and numbers to create an alphanumeric code.<\/p>\n<p>With SKUs in place for each of your products, it becomes far easier for your team (and for third-parties who may be assisting you with your inventory management, logistics and shipping), to pull up information about particular products e.g. how many of a particular item are in stock.<\/p>\n<h2>SKU management: what is it?<\/h2>\n<p>SKU management is the process of creating SKUs, assigning them to products, and integrating the SKUs into your broader inventory management and fulfilment processes.<\/p>\n<p>In short, SKU management is about ensuring that SKUs are created, used and managed in a uniform way that makes it easier for you to control and monitor your inventory.<\/p>\n<h3><strong>What are the benefits of SKU management?<\/strong><\/h3>\n<p>Like anything that’s really worth doing, SKU management can be a complex and in-depth task.<\/p>\n<p>But, it’s something that will generate significant benefits for your eCommerce business, particularly as you grow and scale.<\/p>\n<p>Ensure that your SKU management is up to speed and in order, and the benefits will include:<\/p>\n<ul>\n<li>Optimised inventory management and tracking.<\/li>\n<li>Improved sales processes.<\/li>\n<li>Better warehouse operations.<\/li>\n<li>Improved accuracy during the pick and pack process.<\/li>\n<li>Faster and improved logistics and fulfilment.<\/li>\n<\/ul>\n<p><strong>SKUs provide eCommerce businesses with a more accurate picture of their inventory, allowing them to make better decisions, with better data.<\/strong><\/p>\n<h2>What are SKU management best practices?<\/h2>\n<p>So, if you’re going to be using SKUs within your eCommerce business (and, you should!), then what are the best practices you should be adopting for the management of your SKUs?<\/p>\n<p>The 3PL team has listed their recommended SKU management best practices below.<\/p>\n<h3><strong>Create simple, standardised SKUs<\/strong><\/h3>\n<p>The foundation of an effective SKU management system is clear, simple, consistent SKUs.<\/p>\n<p>You’ll want to make sure that each SKU is unique and that important identifying characteristics of the products are quickly and easily identifiable.<\/p>\n<p>The sorts of characteristics you’ll want to include in your SKUs include brand, size, colour etc.<\/p>\n<p>To help you create your own SKUs, we’ve provided an example of SKU formation for a fictional online footwear retailer, ‘Boot It’.<\/p>\n<table width=\"602\">\n<tbody>\n<tr>\n<td width=\"100\"><strong>Brand (code)<\/strong><\/td>\n<td width=\"100\"><strong>Item (code)<\/strong><\/td>\n<td width=\"100\"><strong>Colour (code)<\/strong><\/td>\n<td width=\"100\"><strong>Sex (code)<\/strong><\/td>\n<td width=\"100\"><strong>Size (code)<\/strong><\/td>\n<td width=\"100\"><strong>SKU<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"100\">Caterpillar (CAT)<\/td>\n<td width=\"100\">Boot (BT)<\/td>\n<td width=\"100\">Brown (BRN)<\/td>\n<td width=\"100\">Men’s (M)<\/td>\n<td width=\"100\">12 UK (12)<\/td>\n<td width=\"100\">CAT-BT-BRN-M12<\/td>\n<\/tr>\n<tr>\n<td width=\"100\">Nike (NKE)<\/td>\n<td width=\"100\">Trainer (TRN)<\/td>\n<td width=\"100\">White (WT)<\/td>\n<td width=\"100\">Women’s (W)<\/td>\n<td width=\"100\">6 UK (6)<\/td>\n<td width=\"100\">NKE-TRN-WT-W6<\/td>\n<\/tr>\n<tr>\n<td width=\"100\">Reebok (RBK)<\/td>\n<td width=\"100\">Trainer (TRN)<\/td>\n<td width=\"100\">Blue (BL)<\/td>\n<td width=\"100\">Women’s (W)<\/td>\n<td width=\"100\">4 UK (4)<\/td>\n<td width=\"100\">RBK-TRN-BL-W4<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>As you can see, with a properly organised SKU system, you can create codes which denote the exact characteristics of your products in a quick and easy to recognise way.<\/p>\n<p>The beauty of this type of SKU formation is that it’s easy to add additional characteristics &#8211; for example, as the number of products you carry grows, you easily add in extra identifying sections to the codes.<\/p>\n<h4>Top tips for creating SKUs<\/h4>\n<p>As well as using a proper technique for your SKU formation, there are a few other top tips that will help you create effective SKUs:<\/p>\n<ul>\n<li>Ensure that all of your SKUs are unique. It’s particularly important that you don’t reuse SKUs from previous seasons.<\/li>\n<li>Keep your SKUs short. At most you shouldn’t use any more than 32 characters. Beyond that number, some inventory management platforms won’t be able to accommodate your SKUs.<\/li>\n<li>Try to avoid using characters which can be easily confused with others. For example, O and I can easily be confused with numbers.<\/li>\n<li>Don’t start SKUs with a zero. Using a zero at the start of an SKU can confuse some inventory management programs.<\/li>\n<li>Don’t use symbols such as @%* unless they are absolutely critical in describing the product. As with zeros, symbols can cause problems with some inventory management programs.<\/li>\n<\/ul>\n<h3><strong>Calculate your SKU ratio<\/strong><\/h3>\n<p>Once you’ve put in place a process for proper SKU formation, the next best practice you should adopt is the calculation of your SKU ratios.<\/p>\n<p>Figuring out your SKU ratios will help you to determine how each product (SKU) is impacting your sales.<\/p>\n<p>To do this, create a spreadsheet and input your SKUs and their respective sales price, cost and gross profit.<\/p>\n<p>It should look something like this:<\/p>\n<table width=\"602\">\n<tbody>\n<tr>\n<td width=\"150\"><strong>SKU No<\/strong><\/td>\n<td width=\"150\"><strong>Sales Price<\/strong><\/td>\n<td width=\"150\"><strong>Cost<\/strong><\/td>\n<td width=\"150\"><strong>Gross Profit<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"150\">SKU 1<\/td>\n<td width=\"150\">£98.00<\/td>\n<td width=\"150\">£37.00<\/td>\n<td width=\"150\">£61.00<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">SKU 2<\/td>\n<td width=\"150\">£8.50<\/td>\n<td width=\"150\">£4.10<\/td>\n<td width=\"150\">£4.40<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">SKU 3<\/td>\n<td width=\"150\">£103.00<\/td>\n<td width=\"150\">£55.00<\/td>\n<td width=\"150\">£48.00<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">SKU 4<\/td>\n<td width=\"150\">£67.00<\/td>\n<td width=\"150\">£32.00<\/td>\n<td width=\"150\">£35.00<\/td>\n<\/tr>\n<tr>\n<td width=\"150\">SKU 5<\/td>\n<td width=\"150\">£48.00<\/td>\n<td width=\"150\">£21.00<\/td>\n<td width=\"150\">£27.00<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Once you’ve done this, you should group your SKUs into gross profit ranges e.g. less than £10, £10 &#8211; £25 etc.<\/p>\n<p>Finally, multiply the number of SKUs in each gross profit range by 100% to establish your SKU ratio.<\/p>\n<p>This will help you to figure out which SKUs are generating the most gross profit amongst your inventory.<\/p>\n<h3><strong>Ensure scalability<\/strong><\/h3>\n<p>When you are creating your SKU formation process, it’s important that you design your SKU architecture in such a way that it can be scaled.<\/p>\n<p>To get this right, you need to think about your current inventory, your growth plans and what your inventory will consist of once you’ve achieved your growth plans.<\/p>\n<p>For example, will you be adding new brands to your inventory once you’ve achieved a certain level of growth? Will you be adding different sizes to your existing ranges (e.g. very small and very large clothing) as you grow? Perhaps you’ll be diversifying and incorporating completely new product types into your inventory?<\/p>\n<p>Think about your answers to all of these questions and more when creating your SKU architecture.<\/p>\n<p>In other words, you need to be able to simply add new product types, characteristics and more to your SKU architecture as you grow. Fail to do that, and you could face a massive job of reorganising your SKU system a few years down the line.<\/p>\n<h3><strong>Test and refine your SKUs<\/strong><\/h3>\n<p>As we mentioned earlier, creating an entirely new SKU architecture and management process from scratch isn’t easy.<\/p>\n<p>So, don’t beat yourself up if you don’t get it quite right the first time.<\/p>\n<p>But do keep testing and refining your SKUs and the way you manage them.<\/p>\n<p>The key is to start testing and refining from day one. As soon as you start spotting drawbacks or problems with your system, remedy them!<\/p>\n<p>Ask your staff for their feedback and input. They may well spot a glaring error that you’ve missed.<\/p>\n<p>And, keep it up! Even a year or two down the line you should still be refining your SKU management.<\/p>\n<h3><strong>Use order fulfilment software<\/strong><\/h3>\n<p>One of the most effective things you can do &#8211; and certainly the top SKU best practice you can adopt &#8211; is to use order fulfilment software like <a href=\"https:\/\/www.3p-logistics.co.uk\/fusion-platform\/\">3PL’s Fusion platform<\/a>.<\/p>\n<p>With powerful order fulfilment software you can more easily and effectively manage your SKUs, and by extension, your inventory.<\/p>\n<p>Platforms such as 3PL’s Fusion provide you with a powerful dashboard that provides you with:<\/p>\n<ul>\n<li>A real-time view of your inventory levels by SKU.<\/li>\n<li>The ability to specify that individual SKUs are picked and packed in a certain way.<\/li>\n<li>The ability to bundle SKUs for promotions or offers.<\/li>\n<li>The option to set automatic ‘just in time’ reorder points for particular SKUs.<\/li>\n<li>The ability to set different shipping types for different SKUs.<\/li>\n<li>And more…<\/li>\n<\/ul>\n<p>With a powerful tool such as 3PL Fusion at your disposal, you’ll be able to easily manage your SKUs and reduce admin costs, identify savings, efficiencies, profitability and more.<\/p>\n<p><strong><em>Find out more about <\/em><\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/fusion-platform\/\"><strong><em>3PL’s Fusion platform<\/em><\/strong><\/a><strong><em> and the benefits it can realise for your business now.<\/em><\/strong><\/p>\n<h2>Improve your SKU management with 3PL today<\/h2>\n<p>If you want help with your SKU management, then speak to the experts today.<\/p>\n<p>Those experts are 3PL.<\/p>\n<p>Not only can our 3PL Fusion platform help you to better manage your SKUs and inventory, but we can handle the complete <a href=\"https:\/\/www.3p-logistics.co.uk\/ecommerce-order-fulfilment\/\">end-to-end fulfilment process<\/a> for your eCommerce business.<\/p>\n<p>So, if you want to focus on what you do best &#8211; promoting and selling your great products &#8211; whilst someone else takes care of your fulfilment for you, speak to 3PL<\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\">Speak to 3PL<\/a> about your fulfilment requirements today<\/h2>\n<p style=\"text-align: center;\"><strong>For more fulfilment, inventory management and shipping advice, read the <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><strong>3PL blog<\/strong><\/a><strong>…<\/strong><strong> <\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/learn-how-switching-to-a-3pl-can-save-your-business-money\/\"><strong>Learn How Switching to a 3PL Can Save Your Business Money<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-inventory-control-a-guide-for-ecommerce-retailers\/\"><strong>What Is Inventory Control? A Guide for eCommerce Retailers<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-landed-cost-a-complete-guide\/\"><strong>What Is Landed Cost? A Complete Guide<\/strong><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re running an eCommerce store that sells multiple lines of products (and variations of those products), you’ll know that managing your SKUs, and by extension your inventory, can be&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3767,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3763"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3763"}],"version-history":[{"count":9,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3763\/revisions"}],"predecessor-version":[{"id":3773,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3763\/revisions\/3773"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3767"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3763"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3763"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3763"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}