{"id":3940,"date":"2022-06-08T10:19:22","date_gmt":"2022-06-08T09:19:22","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3940"},"modified":"2022-06-08T10:48:13","modified_gmt":"2022-06-08T09:48:13","slug":"the-ultimate-guide-to-freight-shipping-for-ecommerce","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-ultimate-guide-to-freight-shipping-for-ecommerce\/","title":{"rendered":"The Ultimate Guide to Freight Shipping for eCommerce"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overflow=&#8221;visible&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; column_position=&#8221;default&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; animation_type=&#8221;default&#8221; bg_image_animation=&#8221;none&#8221; border_type=&#8221;simple&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221;][vc_column_text]Whether you want to source large amounts of goods from suppliers for your eCommerce store, or you want to send goods in bulk to a customer, you’re going to have to use what’s called ‘freight shipping’. <strong><em>If you’re not too sure what this is, and what it involves, then read 3PL’s ultimate guide to freight shipping now.<\/em><\/strong><\/p>\n<h2>What is freight shipping?<\/h2>\n<p>So, what exactly is freight shipping? What does the term refer to?<\/p>\n<p>The answer is that freight shipping is the transportation of goods <em>in bulk <\/em>via road, rail, intermodal (rail and road), ship or air.<\/p>\n<p>The key part to that definition is the word ‘bulk’.<\/p>\n<p>This is what differentiates freight shipping from other types of shipping you may have heard of.<\/p>\n<p>Freight shipping typically involves the goods being loaded onto pallets, and in the case of shipping, rail and some forms of road transport, being then loaded into containers.<\/p>\n<h2>What goods can be shipped via freight shipping?<\/h2>\n<p>So, what goods are suitable for freight shipping?<\/p>\n<p>As a general rule, any goods that are larger than 30 inches by 30 inches by 30 inches (76cm) and over 22kg in weight are suitable for freight shipping. Although, this isn’t a hard and fast rule. Some freight shippers use different definitions. For example, FedEx classifies any goods over 68kgs as suitable for freight shipping.<\/p>\n<p>If you want to ship goods which are smaller and lighter than the above figures, then it’ll be more cost effective to send via traditional parcel options.<\/p>\n<p>Freight becomes cost effective and the optimal choice when you have multiple bulky, heavy items that you need to send somewhere.<\/p>\n<p>As we mentioned earlier, in order to make the shipping of large, bulky goods easier, your goods will typically be loaded onto pallets. To give you an idea of how many goods or products you can fit on a pallet, a pallet’s average dimensions will be:<\/p>\n<ul>\n<li>48 inches (121cm) wide.<\/li>\n<li>40 inches (101cm) long.<\/li>\n<li>Loaded to an average height of 48 inches (121cm). It is possible to load a pallet up to 80 inches (203cm) in height, but a shipping company will then class it as a ‘double stacked pallet’.<\/li>\n<\/ul>\n<h2>What goods cannot be shipped via freight shipping?<\/h2>\n<p>Bear in mind that there are also some goods which <strong>cannot <\/strong>be freight shipped. These goods are typically defined by the shipping companies and usually vary depending on the form of transport being used.<\/p>\n<p>For example, air shipping companies do not normally permit the transport of goods such as aerosols, pressurised cans, and fire extinguishers, as these can pose a safety risk during transport.<\/p>\n<p>In the case of maritime transport, prohibited items typically include flammable items, some pharmaceutical products, perfumes, drinks and plants.<\/p>\n<p>It’s also worth noting that there are some items\/goods which can be transported by freight, <em>but only <\/em>if you have secured permission from the relevant authorities. These goods include antibiotics, some consumer goods, and certain therapeutic substances and medicines.<\/p>\n<p>A good freight shipping company will be able to advise you on whether your goods can be shipped via freight, and whether or not you require permits to do so.<\/p>\n<h2>What are the different freight shipping options?<\/h2>\n<p>When it’s time to send your goods via freight, you’ll have five options open to you. The five main freight shipping options are:<\/p>\n<ol>\n<li>Full truckload (FTL).<\/li>\n<li>Less-than-truckload (LTL).<\/li>\n<li>Partial truckload (PTL).<\/li>\n<li>Intermodal.<\/li>\n<li>Expedited.<\/li>\n<\/ol>\n<p>Below, we’ve provided more information on what each of these freight shipping options involves.<\/p>\n<h3>Full truckload (FTL)<\/h3>\n<p>Full truckload shipping is used when you need to transport bulk or pallet loads which are large enough to justify the use of an entire container\/truck trailer.<\/p>\n<p>In other words, if you have a large volume of goods that need to be transported, then full truckload shipping will be the most cost effective option.<\/p>\n<p>The exact volume of cargo that is classified as a full truckload varies between different freight shipping companies, but is typically any volume over 6800kg in weight.<\/p>\n<p>If you are going to palletise your goods, then dimensions are an important consideration. The average full truckload container can accommodate around 24 to 26 pallets.<\/p>\n<p>Full truckload shipping is also handy if you have particular pickup or delivery deadlines to hit. This is because the shipping company is only dealing with your cargo, and doesn’t have to pickup\/dropoff goods for other customers (who may be using the same container if you use another freight shipping option such as partial truckload).<\/p>\n<p>Full truckload shipping also reduces the chances of your goods being damaged, as there is less handling of your goods.<\/p>\n<h3>Less-than-truckload (LTL)<\/h3>\n<p>As the name suggests, less-than-truckload shipping is used when you have less than a truckload of goods that need transporting.<\/p>\n<p>Although the figures vary between different shipping companies, less-than-truckload shipping tends to be used for volumes of goods between 68kg and 6,800kg in weight.<\/p>\n<p>Thinking of this in terms of pallets, if you need to transport between one and six pallets, then less-than-truckload shipping will be the ideal solution.<\/p>\n<h3>Partial truckload (PTL)<\/h3>\n<p>Partial truckload shipping essentially involves sharing a truckload\/container with other people.<\/p>\n<p>It’s not only a great option if you’re sending a volume of goods around 2200kg in weight (about six pallets), but it also offers great value for money, as you’ll be splitting the cost of shipping with other shippers.<\/p>\n<h3>Intermodal<\/h3>\n<p>Intermodal freight shipping focuses on streamlining the shipping process as much as possible.<\/p>\n<p>So, depending on where you are sending your goods, the shipping process could involve rail and road, and sometimes even ships, to ensure that your goods reach their destination quickly.<\/p>\n<p>Aside from the streamlined process, intermodal shipping also has the benefit of incorporating rail transport, which reduces fuel use, lowers costs and lowers emissions, which is great if you have green targets that you need to meet each year.<\/p>\n<h3>Expedited<\/h3>\n<p>If you need to get a large volume of your goods somewhere quickly (or have them picked up quickly), then expedited freight shipping is the best option to use.<\/p>\n<p>Expedited freight shipping usually makes use of air and road transport, and focuses on speed. Because of this, expedited shipping does usually come with a higher price tag, but if you need your goods to be somewhere quickly, the extra cost is usually more than worth it.<\/p>\n<h2>How to prepare a freight shipment<\/h2>\n<p>Before you go and book a freight shipment for your goods, there are a few essential bits of preparation that you’ll need to do first.<\/p>\n<p>We’ve taken a look at what you need to do to prepare a freight shipment below.<\/p>\n<h3>Palletise your goods<\/h3>\n<p>If you’re sending goods in bulk, then generally the safest and best way to prepare them for freight shipping is to palletise them.<\/p>\n<p>Make sure that you use high-quality pallets made from either wood or plastic. You can tell a good quality pallet by its weight. A quality pallet will weigh between 10kg and 30kg depending on how big it is.<\/p>\n<p>Don’t be tempted to save money on cheap, flimsy pallets. You’ll regret it if your pallet falls apart in transit!<\/p>\n<h3>Label, label, label<\/h3>\n<p>We can’t stress this enough. Make sure you clearly label your pallets with the name of your company, your address and contact details.<\/p>\n<p>This makes the life of shipping companies much easier, particularly in the event that there’s an issue with your shipment.<\/p>\n<h3>Follow freight carrier instructions<\/h3>\n<p>Freight carriers have their own way of doing things. Be sure to follow their instructions to the letter.<\/p>\n<p>This will make both your and their lives easier and will ensure there are no unexpected hitches or delays to your shipment.<\/p>\n<h3>Use a freight-forwarding company<\/h3>\n<p>If you don’t want the hassle of contacting different freight shipping companies and preparing your shipments, then it’s a good idea to use a <a href=\"https:\/\/www.3p-logistics.co.uk\/international-freight-forwarding\/\">freight-forwarding company<\/a>.<\/p>\n<p>A freight-forwarding company like 3PL will do the hard work for you, and whether it’s air, ocean or international road shipping, they’ll be able to fully support you through the process.<\/p>\n<p>Using a freight-forwarding company can also help you get the best freight shipping rates, as well as benefit from the knowledge and experience of freight forwarding experts.<\/p>\n<h2 style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\">Speak to 3PL<\/a> about international freight forwarding today<\/h2>\n<p style=\"text-align: center;\"><strong>For more eCommerce logistics and shipping advice, read the <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><strong>3PL blog<\/strong><\/a><strong>…<\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-delivered-duty-paid-dpp-shipping-and-why-is-it-used\/\"><strong>What Is Delivered Duty Paid (DDP) Shipping and Why Is It Used?<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/what-is-an-order-fulfilment-strategy\/\"><strong>What Is an Order Fulfilment Strategy?<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/how-to-pick-the-best-shipping-company-for-your-ecommerce-store\/\"><strong>How to Pick the Best Shipping Company for Your eCommerce Store<\/strong><\/a><\/p>\n[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overflow=&#8221;visible&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; column_position=&#8221;default&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243;&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3942,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3940"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3940"}],"version-history":[{"count":1,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3940\/revisions"}],"predecessor-version":[{"id":3941,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3940\/revisions\/3941"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3942"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3940"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3940"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3940"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}