{"id":3988,"date":"2022-07-18T10:32:39","date_gmt":"2022-07-18T09:32:39","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=3988"},"modified":"2022-07-18T15:35:38","modified_gmt":"2022-07-18T14:35:38","slug":"shipping-costs-101-all-the-basics-you-need-to-know","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/shipping-costs-101-all-the-basics-you-need-to-know\/","title":{"rendered":"Shipping Costs 101: All the Basics You Need to Know"},"content":{"rendered":"[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overflow=&#8221;visible&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; column_position=&#8221;default&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243; width=&#8221;1\/1&#8243; tablet_width_inherit=&#8221;default&#8221; tablet_text_alignment=&#8221;default&#8221; phone_text_alignment=&#8221;default&#8221; animation_type=&#8221;default&#8221; bg_image_animation=&#8221;none&#8221; border_type=&#8221;simple&#8221; column_border_width=&#8221;none&#8221; column_border_style=&#8221;solid&#8221;][vc_column_text]Shipping costs are on the rise. Whether you’re securing supplies from overseas, or sending out orders to customers, you’ve no doubt noticed that your shipping bill is getting higher and higher. That’s why you should keep reading, as the 3PL team tells you everything you need to know about nailing your shipping basics and keeping costs in check…<\/p>\n<h2><strong>Why are shipping costs rising?<\/strong><\/h2>\n<p>As an owner of an eCommerce store or other type of business, you’re undoubtedly watching the continually rising cost of shipping with concern.<\/p>\n<p>But, <em>why <\/em>is the cost of shipping rising so much at the moment?<\/p>\n<p>As with any issue that spans the globe, there are multiple reasons, but speak to any logistics expert and they’ll usually say it’s mainly down to the following factors.<\/p>\n<h3><strong>Shipping container shortage<\/strong><\/h3>\n<p>As the Covid-19 lockdowns came into effect, demand for containers collapsed. This resulted in manufacturers of containers significantly dialling down production.<\/p>\n<p>Since demand has recovered, container manufacturers have struggled to catch up, meaning that any available container has an exceptional surcharge attached to it.<\/p>\n<h3><strong>Increased consumer demand<\/strong><\/h3>\n<p>During the Covid-19 lockdowns we saw a massive increase in consumer demand for everything from furniture to clothing.<\/p>\n<p>This huge increase in consumer demand meant that higher volumes of goods were being shipped. This huge consumer demand was not matched with a higher supply of vessels etc. As a result, shipping costs increased.<\/p>\n<h3><strong>Oil price rises<\/strong><\/h3>\n<p>Due to the collapse in demand for oil during the Covid-19 lockdowns (resulting in the cancellation of many new oil and gas projects), and the war in Ukraine, oil prices have skyrocketed and are now consistently over $100 a barrel.<\/p>\n<p>The result of this is that couriers and shipping companies are facing more expensive fuel costs. They are increasingly passing on these rising fuel costs to customers in the form of higher shipping rates.<\/p>\n<h2><strong>What are shipping costs?<\/strong><\/h2>\n<p>Before we go any further, let’s just define exactly what we mean by the term ‘shipping costs’.<\/p>\n<p>Shipping refers to the process of preparing and packing an order and then sending it to a customer. The means by which it reaches a customer will depend on the courier or shipping service that you choose, but common means of shipping include road transport (vans or lorries) or rail, and in the case of international shipping, container ships or aeroplanes.<\/p>\n<p>Therefore shipping costs refer to any costs incurred throughout this process. This includes labour time, the cost of packaging, storage in inventory, and costs associated with transport and delivery.<\/p>\n<p>If you’re using a courier to send your orders to customers, then you’ll usually be charged a single fee which covers transport and delivery, whilst the cost of packaging is covered by yourself.<\/p>\n<h2><strong>How are shipping costs calculated?<\/strong><\/h2>\n<p>With the above in mind, you might be wondering how shipping costs are calculated. Is it simply based on the inputs involved?<\/p>\n<p>Not necessarily. Different shipping companies calculate shipping costs in different ways, however they generally involve one (or more) of the following variables.<\/p>\n<h3><strong>Package weight<\/strong><\/h3>\n<p>This is one of the biggest factors that influences shipping cost. As you would expect, the heavier an item, the more it’s going to cost to ship.<\/p>\n<p>Some shipping companies and couriers will use a pricing technique called dimensional weight (also called DIM weight). This not only takes into account an item’s weight, but it’s dimensions too.<\/p>\n<h3><strong>Package dimensions<\/strong><\/h3>\n<p>So, what exactly is dimensional weight? This involves a shipping company calculating both the dimensions (the size and shape of a package) as well as its weight.<\/p>\n<p>It’s calculated by multiplying the height, length and width of a package and then dividing it by a standard DIM divisor (this is a figure which represents cubic inches per pound). Different shipping companies use different DIM divisors.<\/p>\n<p>Be aware that many shipping companies, like USPS, FedEx and UPS calculate their shipping charges based on whatever is higher &#8211; the package’s weight, or its dimensional weight.<\/p>\n<p>Whichever of these is the higher, becomes the ‘billable weight’ for your shipment.<\/p>\n<h3><strong>Shipping destination<\/strong><\/h3>\n<p>Destination matters. If you’re only sending a package to the next town over, then this is going to cost you a lot less than sending a package to another country.<\/p>\n<p>Many shipping companies use what are called ‘shipping zones’ to calculate their shipping rates. These zones can range from Zone 1 to Zone 8 and are calculated on where your package is being shipped from.<\/p>\n<p>As a result, if you end up shipping a package across multiple shipping zones, then you’re likely going to end up with a higher shipping bill.<\/p>\n<h3><strong>Value of contents<\/strong><\/h3>\n<p>If you need to send out high-value items to customers, this can result in the overall cost of your shipment going up as a result of needing to insure the package.<\/p>\n<h3><strong>Delivery speed<\/strong><\/h3>\n<p>The faster you need to get a parcel to a customer, the more you’re going to pay in shipping rates.<\/p>\n<p>If you decide to offer 1 or 2-day shipping to your customers, then you’re going to face higher shipping rates as the shipping company will have to use more elaborate, expensive ways of transporting your packages e.g. air freight.<\/p>\n<h2><strong>How to reduce your shipping costs<\/strong><\/h2>\n<p>As you can see, there are many variables that can affect the amount of money you pay for shipping. However, it’s not a lost cause! There are many things which you can do to reduce your overall shipping bill.<\/p>\n<p>We’ve set out our top cost-saving tips below.<\/p>\n<h3><strong>Weigh your packages<\/strong><\/h3>\n<p>This seems like a no brainer, but you’d be surprised how many eCommerce companies miss this simple trick.<\/p>\n<p>You should get your fulfilment team into the habit of weighing every package and making sure that it’s not absurdly heavy.<\/p>\n<p>With shipping costs being as high as they are, it may actually cost you more to send very heavy items than what you actually make on them in profit!<\/p>\n<p>If you find that you have very heavy items which don’t necessarily have huge profit margins, it may be better to sell them on a ‘customer collect’ basis, or allow customers to arrange their own delivery.<\/p>\n<h3><strong>Check your packaging dimensions<\/strong><\/h3>\n<p>As we’ve seen above, the dimensions of a package can play a big role in increasing the cost of shipping.<\/p>\n<p>To save money, you should seek to rationalise your packaging dimensions. For example, are you sending everything out in the same size box? It may cost more to stock different size boxes, but in the long run you’ll save handsomely on shipping rates.<\/p>\n<p>In addition to using boxes which are of a suitable size for each item, you should see if you can use custom packaging where possible. This will allow you to pack items as snugly as possible, with no wasted space which needs to be filled with packing material.<\/p>\n<h3><strong>Use SIOC packaging<\/strong><\/h3>\n<p>Another packaging-based trick you can try, is to use SIOC packaging.<\/p>\n<p>SIOC (ships in own container) packaging isn’t necessarily suitable for all products, but can be a handy way of reducing the bulk of your package, as you are applying the shipping label directly to the product box.<\/p>\n<p>Obviously, this means that the product box has to be robust enough to withstand the rigours of shipping.<\/p>\n<p>So, if you have products which are in good quality boxes, it can make sense to ship them ‘as is’ rather than placing them in another box just to ship.<\/p>\n<h3><strong>Purchase packaging in bulk<\/strong><\/h3>\n<p>Whether it’s boxes or packing materials, you can save money by buying these items in bulk.<\/p>\n<p>If you know that you’re going to have a consistent level of orders over the coming months, then you should be able to calculate the best bulk buying deal for your business.<\/p>\n<h3><strong>Outsource your fulfilment<\/strong><\/h3>\n<p>One of the best ways of reducing your shipping costs is to outsource your fulfilment to a third-party logistics provider (known as a 3PL).<\/p>\n<p>The reasoning is as follows &#8211; because a 3PL is handling shipping for multiple companies at once, they are able to negotiate much cheaper shipping rates. Because they will generally be sending hundreds (or even thousands) of packages every week, shipping companies will essentially provide them with a bulk discount.<\/p>\n<p>In short &#8211; 3PLs can negotiate far cheaper shipping rates than you’ll be able to do on your own.<\/p>\n<h2><strong>Access cheaper shipping rates today with 3PL<\/strong><\/h2>\n<p>If you want to access cheaper shipping rates and are considering outsourcing your fulfilment, then speak to 3PL today.<\/p>\n<p>We’ve got many <a href=\"https:\/\/www.3p-logistics.co.uk\/case-studies\/\">happy customers<\/a> who rely on us to deliver the smoothest, most efficient fulfilment service with the most cost-effective shipping. If you’d like to join them, <a href=\"https:\/\/www.3p-logistics.co.uk\/get-started\/\">speak to us today<\/a>!<\/p>\n<h2 style=\"text-align: center;\">Find out more about 3PL’s <a href=\"https:\/\/www.3p-logistics.co.uk\/ecommerce-order-fulfilment\/\">eCommerce Fulfilment<\/a> services now<\/h2>\n<p style=\"text-align: center;\"><strong>For more eCommerce shipping, logistics and fulfilment advice, read the <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/\"><strong>3PL blog<\/strong><\/a><strong>…<\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/learn-how-switching-to-a-3pl-can-save-your-business-money\/\"><strong>Learn How Switching to a 3PL Can Save Your Business Money<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/a-practical-guide-to-delivery-management\/\"><strong>A Practical Guide to Delivery Management<\/strong><\/a><strong> | <\/strong><a href=\"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/the-ultimate-guide-to-freight-shipping-for-ecommerce\/\"><strong>The Ultimate Guide to Freight Shipping for eCommerce<\/strong><\/a><\/p>\n<p>&nbsp;<\/p>\n[\/vc_column_text][\/vc_column][\/vc_row]\n","protected":false},"excerpt":{"rendered":"<p>[vc_row type=&#8221;in_container&#8221; full_screen_row_position=&#8221;middle&#8221; column_margin=&#8221;default&#8221; column_direction=&#8221;default&#8221; column_direction_tablet=&#8221;default&#8221; column_direction_phone=&#8221;default&#8221; scene_position=&#8221;center&#8221; text_color=&#8221;dark&#8221; text_align=&#8221;left&#8221; row_border_radius=&#8221;none&#8221; row_border_radius_applies=&#8221;bg&#8221; overflow=&#8221;visible&#8221; overlay_strength=&#8221;0.3&#8243; gradient_direction=&#8221;left_to_right&#8221; shape_divider_position=&#8221;bottom&#8221; bg_image_animation=&#8221;none&#8221;][vc_column column_padding=&#8221;no-extra-padding&#8221; column_padding_tablet=&#8221;inherit&#8221; column_padding_phone=&#8221;inherit&#8221; column_padding_position=&#8221;all&#8221; column_element_spacing=&#8221;default&#8221; background_color_opacity=&#8221;1&#8243; background_hover_color_opacity=&#8221;1&#8243; column_shadow=&#8221;none&#8221; column_border_radius=&#8221;none&#8221; column_link_target=&#8221;_self&#8221; column_position=&#8221;default&#8221; gradient_direction=&#8221;left_to_right&#8221; overlay_strength=&#8221;0.3&#8243;&#8230;<\/p>\n","protected":false},"author":1,"featured_media":3990,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[11],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3988"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=3988"}],"version-history":[{"count":1,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3988\/revisions"}],"predecessor-version":[{"id":3989,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/3988\/revisions\/3989"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/3990"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=3988"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=3988"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=3988"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}