{"id":4350,"date":"2023-01-16T14:55:45","date_gmt":"2023-01-16T14:55:45","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=4350"},"modified":"2023-01-16T17:00:33","modified_gmt":"2023-01-16T17:00:33","slug":"3pl-unveils-new-senior-management-team","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/3pl-unveils-new-senior-management-team\/","title":{"rendered":"3PL Unveils New Senior Management Team"},"content":{"rendered":"<p>In support of its continued expansion <a href=\"https:\/\/www.3p-logistics.co.uk\/omnichannel-fulfilment\/\">omnichannel fulfilment<\/a> specialist 3PL has announced the revamp of its Senior Management Team across the verticals of Technical Support, Human Resources, Operations Delivery and Customer Success.<\/p>\n<p style=\"font-weight: 400;\">Hailed internally as the “Fantastic Four” all posts have been fulfilled through internal promotions awarded to Leon Parkinson, Rosie Currie, Steve Rigby, and Dan Wood. Their new roles will be effective February 2023.<\/p>\n<p style=\"font-weight: 400;\">“It gives me immense satisfaction in congratulating everyone on their promotion to the newly reformed SMT. This exciting restructure is specifically designed to further complement and support of the Main Board in expressing our future expansion plans. They are an outstanding group of people with exceptional talent, skill, and experience, who embody the very DNA of our business,” said Founder &amp; MD Ian Walker. “This is the largest ever collective promotion in our history, reflecting our continued commitment to invest in the future of our people, whilst demonstrating the confidence we have about the future growth opportunities that lie ahead. This collective appointment is a fitting testament to their valued contribution to date and their enthusiastic outlook.”<\/p>\n<p style=\"font-weight: 400;\">“As 2023 marks another milestone anniversary in sales growth, the newly formed SMT represents the next generation of diverse management who will continue reinforcing 3PL as a &#8216;best in class&#8217; valued outsourced service provider. The decision to promote all four roles internally underlines the strength and depth within our business, and will undoubtedly have a positive everyday impact on both our customers and colleagues alike.&#8221;<\/p>\n<p style=\"font-weight: 400;\">Pointing to the broader sector and the company&#8217;s ongoing growth, FD David Holland echoed the praise, noting that the promotions support expansion in key areas of the business aligned to meet future demand. “The creation of four new senior “impact” roles is designed to complement the current Senior Leadership Team (SLT) and reflects the significant demand we are seeing from the Retail sector in both existing customer growth and the attraction of new business.  Our newly promoted talent has each made a vital contribution to the success of the business to date and I applaud them all on achieving this important career milestone”.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>About 3PL<\/strong><\/p>\n<p>Headquartered in Greater Manchester, 3PL is a technology-led omnichannel fulfilment offering for growing retail brands. As an end-to-end fulfilment solution, 3PL operates from over 250,000 sq. ft of warehousing supported by access to a network of international warehouses to support global expansion for its customers. Its fast-moving operations house over 80 million items of stock, and dispatch over 8 million orders across some 32,000 product lines each year with an emphasis towards supporting health, beauty, wellbeing, and lifestyle brands.<\/p>\n<p>Learn more by visiting <a href=\"http:\/\/www.3p-logistics.co.uk\/\">3p-logistics.co.uk<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In support of its continued expansion omnichannel fulfilment specialist 3PL has announced the revamp of its Senior Management Team across the verticals of Technical Support, Human Resources, Operations Delivery and&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4351,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/4350"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=4350"}],"version-history":[{"count":8,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/4350\/revisions"}],"predecessor-version":[{"id":4360,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/4350\/revisions\/4360"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/4351"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=4350"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=4350"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=4350"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}