{"id":4384,"date":"2023-02-06T12:46:18","date_gmt":"2023-02-06T12:46:18","guid":{"rendered":"https:\/\/www.3p-logistics.co.uk\/?p=4384"},"modified":"2023-02-06T13:03:42","modified_gmt":"2023-02-06T13:03:42","slug":"smugglers-crate-and-geek-crate-appoint-3pl-as-subscription-box-fulfilment-partner","status":"publish","type":"post","link":"https:\/\/www.3p-logistics.co.uk\/3pl-blog\/smugglers-crate-and-geek-crate-appoint-3pl-as-subscription-box-fulfilment-partner\/","title":{"rendered":"Smugglers Crate and Geek Crate Appoint 3PL as Subscription Box Fulfilment Partner"},"content":{"rendered":"<p><a href=\"https:\/\/smugglerscrate.com\/\">Smugglers Crate<\/a> and <a href=\"https:\/\/geekcrate.co.uk\/\">Geek Crate<\/a>, the mystery boxes curated specifically for Star Wars, Marvel, and Pokémon fans have teamed up with the UK leader in omnichannel order fulfilment 3PL to provide their legions of customers with an incredible unboxing experience.<\/p>\n<p>Known for their flexible subscription box plans tailored to customers, Smugglers Crate and Geek Crate have quickly grown an international fanbase of Star Wars, Marvel, and Pokémon enthusiasts and collectors. Partnering with knowledgeable and exclusive suppliers, the mystery boxes include exclusive artworks, memorabilia, figures, lifestyle, accessories and more to provide a unique experience with lots of surprises.<\/p>\n<p>The appointment of 3PL is a direct response to the thriving global marketplace and the growing demand for fast and affordable shipping. This exciting new partnership will leverage 3PL’s experience and industry expertise in <a href=\"https:\/\/www.3p-logistics.co.uk\/subscription-box-fulfilment\/\">subscription box fulfilment<\/a> as well as take advantage of <a href=\"https:\/\/www.3p-logistics.co.uk\/fusion-platform\/\">3PL’s Fusion software<\/a> to help automate and optimise the order fulfilment operations. By partnering with 3PL, Smugglers Crate and Geek Crate will target continued brand growth and development by offering timely and reliable shipping, out-of-this-world unboxing experience and customer service.<\/p>\n<p>Sam Birch, Founder &amp; Director at Smugglers Crate and Geek Crate commented:<\/p>\n<p>&#8220;It&#8217;s a pleasure to be joining 3PL to take over our fulfilment operations. Since starting in late 2020, Smugglers Crate and Geek Crate have seen significant year-on-year growth and we now plan on expanding further into our next stage of development. With their industry-leading Fusion software and extensive experience in the e-commerce space, I&#8217;m confident that working with 3PL will allow us to not only continue but accelerate this growth.&#8221;<\/p>\n<p>“We’re thrilled to partner with Smugglers Crate and Geek Crate and look forward to working with Sam and his team.” James Taylor, Business Development Manager at 3PL said. “Sam’s brands and vision for the future are very exciting and we’re eager to help power growth and efficiency across his business. Long may their exciting journey continue an upward boost.”<\/p>\n<p>&nbsp;<\/p>\n<p><strong>About 3PL<\/strong><\/p>\n<p>3PL is a technology-enabled third-party logistics enterprise providing award-winning omnichannel fulfilment and logistics services to growing brands. 3PL operates from over 250,000 sq. ft of accredited multi-client warehousing in the UK, supported by its integrated access to a network of international fulfilment centres.  Its fast-moving operations house more than 20 million units of stock, across some 40,000 unique product lines and ship thousands of D2C &amp; B2B orders each week on behalf of its clients further complemented by its extensive range of value-added services. Learn how 3PL ‘make ship happen’ by visiting <a href=\"http:\/\/www.3p-logistics.co.uk\/\">www.3p-logistics.co.uk<\/a><\/p>\n<p><strong> <\/strong><strong>About Smugglers Crate and Geek Crate<\/strong><\/p>\n<p>Fun, innovative, and high-quality pop culture subscription box companies based in the UK.<\/p>\n<p>Smugglers Crate was founded by a team of obsessed Star Wars fanatics and is specifically aimed at Star Wars fans. The mystery boxes include not only brand-new official products from the Sequel Trilogy, Clone Wars and The Mandalorian but also retro items from the Original and Prequel Trilogy eras by working with a mixture of officially licensed and independent retailers. Find out more: <a href=\"https:\/\/smugglerscrate.com\/\">https:\/\/smugglerscrate.com\/<\/a><\/p>\n<p>Geek Crate is providing mystery boxes for all fandoms including Star Wars, Marvel, and Pokémon. Learn more by visiting: <a href=\"https:\/\/geekcrate.co.uk\/pages\/our-box\">https:\/\/geekcrate.co.uk\/pages\/our-box<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Smugglers Crate and Geek Crate, the mystery boxes curated specifically for Star Wars, Marvel, and Pokémon fans have teamed up with the UK leader in omnichannel order fulfilment 3PL to&#8230;<\/p>\n","protected":false},"author":6,"featured_media":4385,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":"","inline_featured_image":false,"wds_primary_category":0},"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/4384"}],"collection":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/comments?post=4384"}],"version-history":[{"count":3,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/4384\/revisions"}],"predecessor-version":[{"id":4389,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/posts\/4384\/revisions\/4389"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media\/4385"}],"wp:attachment":[{"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/media?parent=4384"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/categories?post=4384"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.3p-logistics.co.uk\/wp-json\/wp\/v2\/tags?post=4384"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}